{
  "recipes": [
    {
      "category": "Miscellaneous",
      "title": "Chai Exfoliating Face Scrub",
      "image": "images/chai_exfoliating_face_scrub.png",
      "notes": "",
      "ingredients": [
        "1 cup - Organic Cane Sugar",
        "1/4 cup - Coconut Oil",
        "1 Tbsp - Ground Cinnamon",
        "1/2 tsp - Ground Ginger",
        "1/4 tsp - Ground Cloves"
      ],
      "instructions": [
        "In a small glass bowl, mix together all ingredients until well-combined.",
        "Store in a small tightly-capped glass jar for up to 6 months.",
        "To use, wet your skin. Scoop out a small amount of sugar scrub and gently rub into the skin in a circular motion to exfoliate. Rinse well."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Egg Substitutes",
      "image": "images/egg_substitutes.png",
      "notes": "Can also use 1/4 cup unsweetened applesauce or 1/4 cup mashed banana.",
      "ingredients": [
        "1 1/4 tsp - Unflavored Grass-Fed Beef Gelatin",
        "3 Tbsp - Hot Water"
      ],
      "instructions": [
        "Place the gelatin and hot water in a small glass bowl.",
        "Blend together until it becomes frothy, about 30 seconds. Add immediately to your baking recipe."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Grain-Free All-Purpose Flour",
      "image": "images/grain_free_all_purpose_flour.png",
      "notes": "",
      "ingredients": [
        "2 cups - Almond Flour",
        "1 cup - Arrowroot Flour",
        "1/2 cup - Coconut Flour",
        "1/2 cup - Tapioca Starch"
      ],
      "instructions": [
        "Combine and mix all ingredients.",
        "Store in an airtight canning jar in the fridge. Use to substitute regular flour in any recipe."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Grain-Free Baking Powder",
      "image": "images/grain_free_baking_powder.png",
      "notes": "",
      "ingredients": [
        "1/4 cup - Baking Soda",
        "1/4 cup - Arrowroot Flour",
        "1/2 cup - Cream of Tartar"
      ],
      "instructions": [
        "Combine and mix all ingredients.",
        "Store in an airtight canning jar in the fridge."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Homemade Citrus Cleaner",
      "image": "images/homemade_citrus_cleaner.png",
      "notes": "Do not use vinegar solutions to clean granite, marble or stone.",
      "ingredients": ["32 oz - White Vinegar", "3 Lemon Peels"],
      "instructions": [
        "Peel the lemons and place into a large glass jar with a lid.",
        "Pour the entire bottle of vinegar over the top of the lemon peels.",
        "Screw on the lid and let sit for 2-4 weeks.",
        "Strain the liquid into a storage container. This is your concentrate. When ready to use, dilute with half vinegar solution and half water into a spray bottle."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Natural Powder Blush",
      "image": "images/natural_powder_blush.png",
      "notes": "The amounts of each ingredient to use will vary per person. You will have to experiment to find out what works for you.",
      "ingredients": ["Arrowroot Flour", "Cocoa Powder", "Ground Hibiscus"],
      "instructions": [
        "Start with 1 tsp arrowroot in a small 4 oz mason jar.",
        "Add cocoa powder and hibiscus until you reach desired shade.",
        "Measure each time you are adding something so once you find the perfect shade you can reproduce it easily.",
        "Store in the 4 oz mason jar with a lid and apply with a blush brush."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Paleo Sandwich Bread",
      "image": "images/paleo_sandwich_bread.png",
      "notes": "",
      "ingredients": [
        "2 cups - Almond Flour",
        "2 Tbsp - Coconut Flour",
        "1/4 cup - Flax Seed Meal",
        "1/2 cup - Tapioca or Arrowroot Flour",
        "1/2 tsp - Baking Soda",
        "1 1/2 tsp - Baking Powder",
        "3/4 tsp - Sea Salt",
        "3 Eggs, whisked",
        "2 Egg Whites, whisked",
        "6 Tbsp - Almond or Coconut Milk",
        "1/2 Tbsp - Apple Cider Vinegar",
        "1/4 cup - Coconut Oil, melted, cooled"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees and line a 4” x 8” loaf pan with parchment paper.",
        "In a large bowl, combine all dry ingredients and set aside.",
        "In a separate bowl, whisk together the eggs and egg whites, milk, vinegar and coconut oil.",
        "Immediately stir the dry mixture into the wet mixture, stirring until moistened, but do not overmix.",
        "Transfer the batter into the loaf pan and spread out evenly.",
        "Bake for 60 minutes or until loaf has risen and top is a deep golden brown.",
        "Cool on a wire rack for about 30 minutes, then remove from the pan by holding the sides of the parchment paper and continue to cool on the rack until fully cooled.",
        "Slice as desired and store tightly in the fridge for up to 4 days. Bread can also be frozen."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Pumpkin Seeds",
      "image": "images/pumpkin_seeds.png",
      "notes": "",
      "ingredients": ["Pumpkin Seeds", "Coconut Oil"],
      "instructions": [
        "Remove and wash seeds.",
        "Pat dry.",
        "Mix with melted coconut oil.",
        "Spread flat on a cookie sheet on unbleached parchment paper.",
        "Bake at 275 degrees for 1 hour."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Strawberry Freezer Jam",
      "image": "images/strawberry_freezer_jam.png",
      "notes": "Recipe yields 6 half-pint jars.",
      "ingredients": [
        "6 Mason Jars and Lids",
        "4 cups - Lightly Blended Strawberries",
        "1 cup - Organic Cane Sugar",
        "Dab of Coconut Oil (optional)",
        "Pomona's Universal Low Sweetener Pectin (2 tsp pectin powder and 2 tsp calcium water)"
      ],
      "instructions": [
        "Before beginning, make calcium water:  Mix 1/2 tsp calcium powder (smaller packet in Pamona's box) with 1/2 cup water in a jar with a lid.",
        "Wash strawberries and cut off tops.",
        "Rinse jars and fill with hot water. Set aside.",
        "Pulse blend the strawberries in the blender until it reaches desired consistency.",
        "Pour strawberry puree into the saucepan, add 2 tsp calcium water, and stir.",
        "Measure sugar into a separate bowl. Add 2 tsp pectin powder and thoroughly stir. Turn the saucepan burner up to med/high.",
        "Bring strawberry puree to a boil, while stirring. Add sugar/pectin mixture and a dab of coconut oil and stir vigorously for 2 minutes to dissolve pectin. Return to a boil and remove from heat.",
        "Pour water out of jars. Use a funnel to fill jars to 1/4 inches from the top.",
        "Keep jars on the counter until they reach room temperature. Screw lids onto the jars, then freeze until ready to use. After removing from the freezer, store in the refrigerator."
      ]
    },
    {
      "category": "Miscellaneous",
      "title": "Taco Seasoning",
      "image": "images/taco_seasoning.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Chili Powder",
        "1/4 tsp - Garlic Powder",
        "1/4 tsp - Onion Powder",
        "1/4 tsp - Dried Oregano",
        "1/2 tsp - Paprika",
        "1 1/2 tsp - Ground Cumin",
        "1 tsp - Sea Salt",
        "1 tsp - Pepper"
      ],
      "instructions": [
        "Combine and mix all ingredients.",
        "Store in a small Mason jar with a lid."
      ]
    },
    {
      "category": "Desserts",
      "title": "No-Bake Almond Butter Bars",
      "image": "images/almond_butter_bars.png",
      "notes": "",
      "ingredients": [
        "1 cup - Almond Butter",
        "1/2 cup - Coconut Butter",
        "2 Tbsp - Raw Honey",
        "1 cup - Finely Shredded Coconut, Unsweetened",
        "2 Tbsp - Cocoa Powder",
        "3 Tbsp - Coconut Oil, Melted",
        "1/2 cup - Dark Chocolate, Chopped",
        "2 Tbsp - Roasted, Salted Almonds, Chopped"
      ],
      "instructions": [
        "Melt the coconut oil in the oven while starting on other ingredients.",
        "In a medium bowl, blend almond butter, coconut butter, honey, shredded coconut, cocoa powder and coconut oil until well blended.",
        "Press mixture into a parchment paper lined 8\" by 8\" baking dish and refrigerate until firm.",
        "Meanwhile, melt the dark chocolate in a double boiler over simmering water. Spread the melted chocolate over the bars and sprinkle with chopped almonds quickly before the chocolate hardens.",
        "Remove parchment paper from the baking dish and cut into bars.",
        "Keep refrigerated until ready to eat, or freeze for later use."
      ]
    },
    {
      "category": "Desserts",
      "title": "Almond Butter Cups",
      "image": "images/almond_butter_cups.png",
      "notes": "",
      "ingredients": [
        "Shells:",
        "4 Tbsp - Coconut Milk, Melted",
        "4 Tbsp - Coconut Cream",
        "1/4 cup - Unsweetened Cocoa Powder",
        "3 tsp - Pure Maple Syrup",
        "1/2 tsp - Pure Vanilla Extract",
        "Pinch of Sea Salt",
        "Pinch of Cinnamon",
        "Filling:",
        "3 Tbsp - Almond Butter",
        "1 Tbsp - Coconut Oil, Melted",
        "1 tsp - Pure Maple Syrup",
        "Pinch of Sea Salt"
      ],
      "instructions": [
        "In a medium bowl, whisk together all shell ingredients.",
        "Place paper liners in a 24 mini-muffin baking tin, or a 12 regular muffin tin. Spoon a 1/8-inch layer of the shell mixture in the bottom of each muffin liner. Place the tray in the freezer to solidify.",
        "While waiting, place the filling ingredients into a small mixing bowl and combine well. Transfer mixture to a small ziplock bag or pastry bag. Snip a tiny corner off the bag with scissors.",
        "Take the shells out of the freezer. Pipe a small amount of the filling into the center of each muffin liner, leaving the edges visible. Add the remaining shell mixture to each muffin tin until filling is covered.",
        "Place the tray back in the freezer to set. Serve cold or room temperature."
      ]
    },
    {
      "category": "Desserts",
      "title": "Almond Shortbread Cookies",
      "image": "images/almond_shortbread_cookies.png",
      "notes": "",
      "ingredients": [
        "1 cup - Almond Flour",
        "1/4 cup - Coconut Flour",
        "2/3 cup - Arrowroot Starch",
        "1/2 tsp - Sea Salt",
        "1/4 cup - Coconut Sugar",
        "1/4 cup - Pure Maple Syrup",
        "1/2 tsp - Pure Almond Extract",
        "1/4 cup - Coconut Oil, Melted"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Place coconut oil in a glass dish in the oven to melt. In a small bowl, combine almond flour, coconut flour, arrowroot starch and sea salt.",
        "In a medium sized bowl, blend the coconut sugar, maple syrup and almond extract until combined.",
        "Add the contents of the small bowl to the medium sized bowl and mix. Slowly add the coconut oil and blend well.",
        "Place dough on a sheet of parchment paper and press until it is about ½ inch thickness. Use a cookie cutter to cut out shapes. Place the cut cookies on a cookie sheet lined with parchment paper. Re-roll excess dough and cut more.",
        "Bake for 14 min. or until cookies are golden brown. Let them cool completely on a wire rack.",
        "Store in an airtight container until ready to eat, or freeze."
      ]
    },
    {
      "category": "Desserts",
      "title": "Baked Custard",
      "image": "images/baked_custard.png",
      "notes": "This recipe is single serve. Multiply for more servings.",
      "ingredients": [
        "Coconut Oil",
        "1 Egg",
        "1/3 cup - Almond Milk",
        "2 tsp - Raw Honey",
        "1/4 tsp - Pure Vanilla Extract",
        "1/4 cup - Roughly Chopped Fresh Berries (strawberry or raspberry, or a mix)",
        "1 tsp - Fresh Lime Juice",
        "1 Sprig Fresh Mint Leaf",
        "1/2 Pint Glass Canning Jar"
      ],
      "instructions": [
        "Preheat the oven to 400 degrees. Use a paper towel to wipe the inside of the jar with coconut oil.",
        "Bring a kettle of water to a boil.",
        "In a medium bowl, whisk egg, milk, honey and vanilla. Pour into a jar.",
        "Transfer the jar to a casserole dish and fill the dish with just enough boiling water to go about halfway up the sides of the jar.",
        "Bake until set, about 20 min. Remove from the oven and water bath and set aside until cooled to room temp.",
        "Meanwhile, in a glass dish, combine berries and lime juice. Spread over custard and top with mint. Cover with lid and refrigerate."
      ]
    },
    {
      "category": "Desserts",
      "title": "Banana Chia Pudding",
      "image": "images/banana_chia_pudding.png",
      "notes": "",
      "ingredients": [
        "2 Ripe Bananas",
        "1 1/2 cups - Almond or Coconut Milk",
        "1/4 cup + 2 Tbsp - Chia Seeds",
        "2 1/2 Tbsp - Pure Maple Syrup",
        "1/2 tsp - Pure Vanilla Extract",
        "1/2 tsp - Ground Cinnamon",
        "1/4 tsp - Sea Salt"
      ],
      "instructions": [
        "Mash the bananas with a fork in a medium bowl.",
        "Add the rest of the ingredients and mix well.",
        "Pour into single serving size bowls, cover, and place in the fridge for at least 4 hours or overnight."
      ]
    },
    {
      "category": "Desserts",
      "title": "Banana Coconut Saute",
      "image": "images/banana_coconut_saute.png",
      "notes": "This recipe is simple but surprisingly delicious!",
      "ingredients": [
        "Bananas (as many as desired)",
        "1 Tbsp - Coconut Oil",
        "Shredded Unsweetened Coconut Flakes"
      ],
      "instructions": [
        "Preheat a skillet to medium/low with coconut oil.",
        "Slice the bananas in half lengthwise. Place the bananas in the skillet. After a minute or two, flip the bananas for another minute and sprinkle them with coconut flakes."
      ]
    },
    {
      "category": "Desserts",
      "title": "Banana Cream Pudding Pie",
      "image": "images/banana_cream_pudding_pie.png",
      "notes": "These can also be made in individual size serving dishes as shown above.",
      "ingredients": [
        "Crust:",
        "1 cup - Dates",
        "1 cup - Pecans",
        "1 tsp - Coconut Oil",
        "1/8 tsp - Sea Salt",
        "Pie Filling:",
        "3/4 cup - Coconut Sugar",
        "1/4 cup - Arrowroot Flour",
        "3 cups - Full Fat Coconut Milk",
        "2 Tbsp - Grass Fed Beef Gelatin",
        "5 1/2 Tbsp - Hot Water",
        "1 Tbsp - Coconut Oil",
        "2 tsp - Vanilla Extract",
        "3 Bananas"
      ],
      "instructions": [
        "Place all crust ingredients in a blender and pulse, scraping down the sides, until well mixed. Press into the bottom of a pie pan.",
        "For filling, combine sugar, arrowroot flour and coconut milk in a saucepan. Mix well and heat on medium-high, stirring continuously until thickened and bubbly. Stir for one minute more, then remove from heat.",
        "Place the grass fed beef gelatin in a small bowl, add hot water and stir until completely dissolved. Pour the mixture into the saucepan and stir well.",
        "Stir in the coconut oil and vanilla and mix well.",
        "Slice the bananas and place on top of the pie crust, arranging them in a flat layer.",
        "Pour the filling mixture on top of the bananas. Cover and place in the fridge to set for at least 3 hours."
      ]
    },
    {
      "category": "Desserts",
      "title": "Berry Custard Pie",
      "image": "images/berry_custard_pie.png",
      "notes": "",
      "ingredients": [
        "Coconut Oil (for greasing pan)",
        "3/4 cup - Coconut Flour",
        "Pinch of Sea Salt",
        "13.5 oz Full Fat Coconut Milk (or Coconut Cream)",
        "4 Large Eggs",
        "1/3 cup - Pure Maple Syrup",
        "1 Tbsp - Pure Vanilla Extract",
        "2 cups - Fresh (or Frozen) Berries (Blackberries, Blueberries, Strawberries, or a Mix)"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Grease a pie pan with coconut oil.",
        "Mix coconut flour and salt in a small bowl.",
        "In a large bowl, whisk together coconut milk, eggs, maple syrup, and vanilla.",
        "Add dry ingredients to wet ingredients and mix until smooth. Pour into the greased pan.",
        "Sprinkle berries over the top of the batter.",
        "Bake for 45 min. (Add 10 minutes to bake time if using frozen berries).",
        "Allow to cool before serving."
      ]
    },
    {
      "category": "Desserts",
      "title": "Blueberry Crumble",
      "image": "images/blueberry_crumble.png",
      "notes": "Keeps well in the fridge and is delicious served cold.",
      "ingredients": [
        "4 cups - Fresh or Frozen Blueberries (or other Berries)- Sometimes we throw in some peach slices or strawberries!",
        "1/4 cup - Almond Flour",
        "1/2 cup - Coconut Flour",
        "1/2 cup - Tapioca or Arrowroot Starch",
        "3 Tbsp - Pure Maple Syrup",
        "3 Tbsp - Avocado Oil or Coconut Oil, Melted",
        "Ground Cinnamon"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees. Place the berries in an 8\"x8\" glass dish and sprinkle with cinnamon if desired.",
        "In a medium bowl, combine almond flour, coconut flour, tapioca or arrowroot, maple syrup and oil and mix until crumbly.",
        "Sprinkle the topping mix over the berries.",
        "Bake covered for 35 minutes, then remove cover and bake for another 20 minutes. Easy and Delish!"
      ]
    },
    {
      "category": "Desserts",
      "title": "Caramel Date Bars",
      "image": "images/caramel_date_bars.png",
      "notes": "",
      "ingredients": [
        "Crust:",
        "1 cup - Dates, Pitted",
        "1/2 cup - Pecans",
        "1 tsp - Coconut Oil",
        "Caramel Layer:",
        "1 cup - Dates, Pitted",
        "1/2 cup - Coconut Oil",
        "1 1/2 Tbsp - Almond Butter",
        "1/4 cup - Pure Maple Syrup",
        "1 cup - Raw Macadamia Nuts, Soaked in water for 1 hour and rinsed",
        "1/3 cup - Water",
        "Top Layer:",
        "1/4 cup - Coconut Oil",
        "1/4 cup - Pure Maple Syrup",
        "1/4 cup - Cocoa Powder"
      ],
      "instructions": [
        "Soak the macadamia nuts in water for an hour, then rinse.",
        "Put crust ingredients into a blender and pulse until crumbly. Pour into an 8\"x8\" parchment paper lined glass dish and press firmly to form a crust. Place in the freezer while continuing to work.",
        "To prepare the caramel layer, put all caramel layer ingredients into the blender and blend until smooth, scraping down the sides as you go. Pour on top of the crust, spread evenly,  and return to the freezer to set.",
        "Wait 20 minutes for it to become firm in the freezer.",
        "For the top layer, mix the top layer ingredients in a saucepan on low heat and stir until combined and smooth (like chocolate sauce). Spread it with a spoon on top of the caramel layer and return it to the freezer for an hour to set.",
        "Remove from the freezer and lift the parchment paper to remove from the glass dish. Slice into squares and store in the fridge."
      ]
    },
    {
      "category": "Desserts",
      "title": "Carrot Cake Bites",
      "image": "images/carrot_cake_bites.png",
      "notes": "",
      "ingredients": [
        "Honey-Vanilla Frosting:",
        "1/2 cup - Macadamia Nuts",
        "Juice of Half a Lemon",
        "2 Tbsp - Coconut Cream",
        "1 1/2 Tbsp - Raw Honey",
        "1 1/2 Tbsp - Coconut Oil, Soft but not Melted",
        "1/4 tsp - Vanilla Extract",
        "Bites:",
        "1 1/2 cups - Pecans (or Walnuts)",
        "8 Medjool Dates, Pitted and Chopped",
        "2/3 cup - Unsweetened Shredded Coconut",
        "3 Tbsp - Coconut Oil",
        "1 1/4 tsp - Ground Cinnamon",
        "3/4 tsp - Ground Ginger",
        "1/4 tsp - Ground Allspice",
        "1/4 tsp - Ground Nutmeg",
        "1/4 tsp - Sea Salt",
        "1 1/2 cups - Grated Carrots"
      ],
      "instructions": [
        "First make the frosting. Soak the macadamia nuts in water for 3 hours or overnight. Rinse with cold water and drain well.",
        "In a blender/food processor, combine all the frosting ingredients and blend on low. Slowly increase speed until smooth and creamy, scraping down the sides as needed. Pour into a bowl, cover and refrigerate while you make the bites.",
        "For the bites: Pulse all bite ingredients except the carrots in a blender until it becomes uniform throughout. Move mixture to a medium bowl and fold in the shredded carrots by hand. Combine well.",
        "Line a 12 mini muffin pan with paper liners. Fill each muffin cup almost to the top and press to flatten. Use a spoon to dollop the frosting onto the top of each muffin cup.",
        "Chill in the fridge for at least 30 minutes before serving."
      ]
    },
    {
      "category": "Desserts",
      "title": "Caveman Cookies",
      "image": "images/caveman_cookies.png",
      "notes": "",
      "ingredients": [
        "1 1/2 cups - Almond Flour",
        "2/3 cup - Almond Butter",
        "1/2 cup - Pure Maple Syrup",
        "1 Egg",
        "1/2 tsp - Baking Soda",
        "1/2 tsp - Sea Salt",
        "1/2 tsp - Pure Vanilla Extract",
        "3/4 cup - Dark Chocolate Chips"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Combine almond flour, baking soda and salt.",
        "In a separate bowl, cream together almond butter, syrup, egg and vanilla.",
        "Add almond flour and mix gradually, then fold in chocolate chips.",
        "Line a cookie sheet with parchment paper. Scoop dough onto cookie sheet 1” apart.",
        "Bake for 10 min or until set.",
        "Cool 2 min. and transfer to a cooking rack."
      ]
    },
    {
      "category": "Desserts",
      "title": "Cherry Spice Sandwich Cookies",
      "image": "images/cherry_spice_sandwich_cookies.png",
      "notes": "",
      "ingredients": [
        "Cookies:",
        "2 1/2 cups - Almond Flour",
        "1/2 cup - Arrowroot Flour",
        "2 Tbsp - Coconut Flour",
        "1 tsp - Baking Soda",
        "1/2 tsp - Sea Salt",
        "1/2 tsp - Ground Cinnamon",
        "1/4 tsp - Ground Ginger",
        "2 Tbsp - Orange Zest",
        "1/4 cup - Pistachios (or Pecans), Finely Chopped",
        "1/3 cup - Coconut Oil, Melted",
        "1/2 cup - Pure Maple Syrup",
        "1 tsp - Vanilla",
        "1 1/2 Tbsp - Water",
        "Cherry Filling:",
        "1 1/2 cup - Frozen Cherries, Thawed",
        "1/3 cup - Juice from Orange",
        "1/4 cup - Pure Maple Syrup",
        "1/4 tsp - Ground Cinnamon",
        "1/8 tsp - Sea Salt"
      ],
      "instructions": [
        "To make the cookies, add the almond flour, arrowroot, coconut flour, baking soda, salt, cinnamon, ginger, orange zest and nuts to a bowl. Stir to combine.",
        "Then pour in the coconut oil, maple syrup, vanilla and water. Stir until well combined. If needed, add extra water to get the dough to stick together. Continue stirring until you can form the dough into a ball with your hands.",
        "Divide the ball into 2 portions and roll each one into a 4” long log. Wrap the logs in parchment paper and transfer to the fridge. Chill at least 30 min. The longer it chills, the easier it is to slice.",
        "While dough is chilling, prepare the filling. Add all the ingredients to the blender and blend until smooth. Transfer to a sauce pan and bring to a simmer over medium heat. Simmer until most of the liquid has evaporated and consistency is spreadable. Stir every few minutes to avoid burning. Once ready, remove from heat and set aside to cool.",
        "Preheat the oven to 350 degrees and line baking sheet with parchment paper. Remove dough from fridge, remove wrapper, and slice each log into 12 rounds. Evenly spread them out on the baking sheet.",
        "Bake for 12 minutes, remove, and let cool completely.",
        "Spread 1 Tbsp of cherry filling onto one side of a cookie and place another cooie on top to make a sandwich. Repeat until all sandwiches are made.",
        "Refrigerate up to 1 week or freeze."
      ]
    },
    {
      "category": "Desserts",
      "title": "Chia Caramel Apple Parfait",
      "image": "images/chia_caramel_apple_parfait.png",
      "notes": "",
      "ingredients": [
        "Chia Mix:",
        "1/2 cup - Chia Seeds",
        "2 cups - Almond Milk (or Coconut Milk)",
        "2 tsp - Pure Vanilla Extract",
        "Caramel Apple Mix:",
        "1 Tbsp - Coconut Oil",
        "3 Apples, Cored and Roughly Chopped",
        "1/3 cup - Coconut Sugar",
        "1/2 cup - Coconut Milk",
        "1/2 tsp - Ground Cinnamon",
        "Pinch of Sea Salt"
      ],
      "instructions": [
        "Combine Chia mix ingredients in a small bowl. Cover and place in the fridge to soak for at least 3 hours.",
        "For the apple mix, melt the coconut oil in a saucepan on medium heat and add the apples. Saute for a few minutes, then add the coconut sugar and coconut milk.",
        "Allow to cook until a thick caramel is formed, stirring continuously until the apples have softened.",
        "Add the cinnamon and salt and stir to combine.",
        "Layer the chia pudding with the caramel apples in a dish (we use canning jars with lids) and serve or refrigerate for later."
      ]
    },
    {
      "category": "Desserts",
      "title": "Chocolate \"Cheesecake\"",
      "image": "images/chocolate_cheesecake.png",
      "notes": "Optional Strawberry Sauce topper: Combine 5 oz of thawed frozen strawberries with 1 Tbsp pure maple syrup and blend until smooth. Mix with 5 oz chopped strawberries for texture and spoon over each slice.",
      "ingredients": [
        "Crust:",
        "2 cups - Raw Pecans",
        "2 Tbsp - Coconut Oil, Melted",
        "1/4 cup - Cocoa Powder",
        "1/4 cup - Pure Maple Syrup",
        "1/8 tsp - Sea Salt",
        "Filling:",
        "2 cups - Raw Macadamia Nuts, Soaked for 1 Hour",
        "1 cup - Zucchini, Peeled and Diced",
        "1/2 cup - Cocoa Powder",
        "1/2 cup - Pure Maple Syrup",
        "1 Tbsp - Vanilla Extract",
        "1/4 tsp - Sea Salt",
        "1/4 cup - Coconut Oil, Melted"
      ],
      "instructions": [
        "Soak the macadamia nuts for 1 hour in water, then drain.",
        "Melt coconut oil in a glass dish in the oven until liquid.",
        "Prepare crust: Place pecans in food processor/blender and grind to a fine meal. Add rest of crust ingredients and process again until well combined.",
        "Press mixture into the bottom of a pie pan and place in the freezer while preparing the filling.",
        "Prepare filling: In a high powered food processor/blender, process the macadamia nuts into a fine meal.",
        "Add in zucchini, cocoa powder, maple syrup, vanilla and sea salt. Blend again until a smooth and creamy batter is formed.",
        "Add in coconut oil and blend to mix uniformly.",
        "Pour the filling into the frozen pie crust, place back in the freezer and allow to set.",
        "Remove from the tray and place in an airtight storage container.",
        "Store in the freezer until ready to eat. Serve directly from the freezer for best texture (becomes soft at room temp)."
      ]
    },
    {
      "category": "Desserts",
      "title": "Chocolate Almond Butter Swirl Brownies",
      "image": "images/chocolate_almond_butter_swirl_brownies.png",
      "notes": "",
      "ingredients": [
        "3/4 cup - Almond Flour",
        "1/2 cup - Cocoa Powder",
        "3/4 tsp - Baking Powder",
        "1/4 cup + 2 Tbsp - Melted Coconut Oil",
        "1/2 cup - Local Raw Honey",
        "1 Tbsp - Pure Vanilla Extract",
        "3 Eggs",
        "1/4 cup - Dark Chocolate Chips",
        "3 Tbsp - Almond Butter",
        "Unbleached Parchment Paper"
      ],
      "instructions": [
        "In a small bowl, combine the almond meal, cocoa powder and baking powder. In a separate bowl, combine the melted coconut oil and honey, and stir well.",
        "Add the vanilla to the wet ingredients. When the coconut oil has cooled, add the eggs.",
        "Combine the wet and dry mixtures, stirring well. Add the dark chocolate chips.",
        "Line your slow cooker with parchment paper and pour in the mixture on top of it. Drop the almond butter on top of the mixture, and using a knife, swirl it around.",
        "Cover and cook on LOW for 1 hour and 15 minutes."
      ]
    },
    {
      "category": "Desserts",
      "title": "Chocolate Cherry Cookies",
      "image": "images/chocolate_cherry_cookies.png",
      "notes": "",
      "ingredients": [
        "2 Egg Whites",
        "Pinch of Sea Salt",
        "1 tsp - Pure Vanilla Extract",
        "1/8 tsp - Pure Almond Extract",
        "2 Tbsp - Coconut Flour",
        "1/4 cup - Almond Flour",
        "1/4 cup - Cocoa Powder",
        "1/3 cup - Pure Maple Syrup",
        "1/4 cup - Finely Shredded Unsweetened Coconut",
        "1/3 cup - Dried Cherries",
        "1/4 cup - Almonds, Chopped",
        "1/4 cup - Mini Dark Chocolate Chips"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "In a medium bowl, beat egg whites and sea salt until frothy. Add vanilla, almond extract, coconut flour, almond flour, cocoa powder and maple syrup. Mix briefly to incorporate.",
        "Stir in coconut, cherries, almonds and chocolate chips.",
        "Scoop rounded tablespoons of dough on an (unbleached) parchment paper lined baking sheet.",
        "Bake for 12-15 minutes or until cookies are firm to the touch.",
        "Remove from the oven and transfer parchment paper to a wire rack to cool. Store in an airtight container or freeze for later use."
      ]
    },
    {
      "category": "Desserts",
      "title": "Chocolate Chunk Cookies",
      "image": "images/chocolate_chunk_cookies.png",
      "notes": "Makes 8-10 cookies",
      "ingredients": [
        "1/4 cup - Almond Flour",
        "1/4 cup - Coconut Flour",
        "1/2 cup - Arrowroot Flour",
        "1/4 cup - Coconut Sugar",
        "1/8 tsp - Sea Salt",
        "1/8 tsp - Baking Soda",
        "3 Tbsp - Avocado Oil",
        "1 tsp - Pure Vanilla Extract",
        "3 Tbsp - Almond or Coconut Milk",
        "1/4 cup - Dark Chocolate Chips"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Line a baking sheet with parchment paper.",
        "Combine dry ingredients in a small bowl (except chocolate chips).",
        "Whisk together wet ingredients in a medium bowl.",
        "Add the dry ingredients to the wet ingredients and mix together. Add chocolate chips and mix well.",
        "Drop a tablespoonful of batter at a time onto the cookie sheet, and lightly press the center down on each cookie.",
        "Bake for 11 minutes. Remove from the oven and let cool 2-3 minutes before transferring them to a wire rack. They will become firm after a few minutes."
      ]
    },
    {
      "category": "Desserts",
      "title": "Chocolate Dipped Strawberry Macaroons",
      "image": "images/chocolate_dipped_strawberry_macaroons.png",
      "notes": "",
      "ingredients": [
        "1 bag (1.2 oz) - Freeze Dried Strawberries",
        "5 Egg Whites",
        "1/8 tsp - Sea Salt",
        "1/4 cup - Local Raw Honey",
        "2 tsp - Pure Vanilla Extract",
        "2 cups - Finely Shredded Coconut, Unsweetened",
        "3 Tbsp - Coconut Flour",
        "3/4 cup - Dark Chocolate, Chopped",
        "1 tsp - Palm Shortening"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "In a food processor or high speed blender, puree half the bag of freeze dried strawberries until it becomes a fine powder. Coarsely chop the other half of the bag of strawberries.",
        "In a medium sized bowl, beat the egg white with the sea salt until stiff peaks form.",
        "Gently fold in strawberry powder, chopped strawberries and remaining ingredients into the egg whites until just combined.",
        "Scoop the dough into golf ball sized balls and place them on parchment lined baking sheets.",
        "Bake for 13-15 min or until bottoms turn golden brown. Place parchment paper on a wire rack and let cool completely.",
        "Meanwhile, melt the dark chocolate and palm shortening in a double boiler over simmering water, stir until smooth. Dip the bottom of each cookie into melted chocolate and place on parchment paper until chocolate hardens.",
        "Drizzle leftover chocolate over tops of cookies. Store in an airtight container in the fridge or freeze until needed."
      ]
    },
    {
      "category": "Desserts",
      "title": "Chocolate Fudge",
      "image": "images/chocolate_fudge.png",
      "notes": "",
      "ingredients": [
        "1 cup - Coconut Milk",
        "1 1/2 Tbsp - Cacao Butter, Chopped",
        "1/2 cup - Pure Maple Syrup",
        "2 tsp - Brewed Decaf Coffee",
        "1/2 tsp - Pure Vanilla Extract",
        "1/2 tsp - Sea Salt",
        "12 oz - Unsweetened Chocolate, Chopped",
        "2 Tbsp - Pecans, Chopped"
      ],
      "instructions": [
        "Place the coconut milk in a saucepan over medium heat for 5 minutes. Stir in the cacao butter, maple syrup, coffee and vanilla and cook for 20 more minutes. Stir in the salt.",
        "Place the chopped chocolate in a large glass bowl. Pour the coconut mixture over it, and stir slowly until melted and smooth. Let sit at room temperature for 40 minutes.",
        "Line an 8” x 8” glass baking dish with parchment paper. Pour the chocolate mixture into the baking dish and spread to flatten. Sprinkle with chopped pecans. Cover and place in the refrigerator to chill for 2 hours.",
        "When ready to serve, remove from the fridge and let sit at room temperature for 15 minutes."
      ]
    },
    {
      "category": "Desserts",
      "title": "Cinnamon Pecans",
      "image": "images/cinnamon_pecans.png",
      "notes": "",
      "ingredients": [
        "1/4 tsp - Sea Salt",
        "1/2 tsp - Ground Cinnamon",
        "1/4 tsp - Arrowroot Starch",
        "2 Tbsp - Pure Maple Syrup",
        "2 cups - Raw Pecans"
      ],
      "instructions": [
        "Preheat the oven to 250 degrees.",
        "In a small bowl, mix together sea salt, cinnamon and arrowroot starch and set aside.",
        "Measure maple syrup into a medium sized bowl. Add pecans to the maple syrup and toss to coat. Sprinkle spice mixture over pecans and stir to coat evenly.",
        "Spread the pecans in a single layer on a parchment lined baking sheet and bake for 30 min.",
        "Then turn the oven off and leave them in the oven for another 30 min. Remove and let cool.",
        "Store in an airtight container or freeze for future use."
      ]
    },
    {
      "category": "Desserts",
      "title": "Fresh Fruit Jello Bites",
      "image": "images/fresh_fruit_jello_bites.png",
      "notes": "",
      "ingredients": [
        "Organic Coconut Oil",
        "3/4 cup - Cold Water",
        "4 Tbsp - Grass Fed Beef Gelatin",
        "1 1/2 cups - Unsweetened Apple Juice",
        "2 cups of Fruit of your Choice (cherries, strawberries, etc), pureed in blender"
      ],
      "instructions": [
        "Lightly grease a mini muffin pan with coconut oil.",
        "Put the water in a small bowl. Pour the gelatin into the water and let stand for 1 minute.",
        "Heat the apple juice in a medium saucepan over medium high heat. When the juice simmers, add the gelatin mixture and stir until completely dissolved.",
        "Remove from heat and combine with pureed fruit. Pour into the muffin cups and refrigerate for 3 or more hours to firmly set.",
        "To serve, run a knife around the outside edge of muffin cups and coax out the jello bites."
      ]
    },
    {
      "category": "Desserts",
      "title": "Ginger Orange Pecans",
      "image": "images/ginger_orange_pecans.png",
      "notes": "",
      "ingredients": [
        "1/4 tsp - Sea Salt",
        "1/2 tsp - Ground Ginger",
        "1/4 tsp - Arrowroot Starch",
        "2 Tbsp - Pure Maple Syrup",
        "2 cups - Raw Pecans",
        "2 tsp - Orange Zest"
      ],
      "instructions": [
        "Preheat the oven to 250 degrees.",
        "In a small bowl, mix together sea salt, ginger and arrowroot starch and set aside.",
        "Measure maple syrup into a medium sized bowl and set aside.",
        "Zest the skin of approximately 2 oranges and set aside.",
        "Add pecans to the maple syrup and toss to coat. Sprinkle spice mixture and orange zest over pecans and stir to coat evenly.",
        "Spread the pecans in a single layer on a parchment lined baking sheet and bake for 30 min.",
        "Then turn the oven off and leave the nuts in the oven for another 30 min.",
        "Remove and let cool. Store in an airtight container or freeze for future use."
      ]
    },
    {
      "category": "Desserts",
      "title": "Homemade Jello",
      "image": "images/homemade_jello.png",
      "notes": "",
      "ingredients": [
        "4 Cups - Juice (Organic Grape Juice is a favorite)",
        "4 Tbsp - Grass Fed Beef Gelatin",
        "1 Tbsp - Raw Honey (optional)"
      ],
      "instructions": [
        "Add 1 cup of the juice to a bowl and sprinkle with 4 Tbsp. gelatin. Whisk together to combine and allow to sit for 5 minutes to thicken.",
        "Pour remaining juice into a saucepan and heat until almost boiling.",
        "Remove from heat and stir in honey until dissolved (optional). Add the gelatin mixture and stir until dissolved.",
        "Pour into an 8” x 8” glass baking dish or into individual sized jars.",
        "Cover and refrigerate for at least 4 hours or until set."
      ]
    },
    {
      "category": "Desserts",
      "title": "Lemon Blueberry Cookies",
      "image": "images/lemon_blueberry_cookies.png",
      "notes": "To make the recipe egg free, substitute with the following: Place 1 1/4 tsp of unflavored grass fed gelatin in a small bowl. Add 3 Tbsp of hot water and blend together immediately until frothy (about 30 seconds). Add to the recipe right away and mix in.",
      "ingredients": [
        "Dry Ingredients:",
        "1 1/2 cups - Almond Flour",
        "1 Tbsp - Coconut Flour",
        "2 Tbsp - Arrowroot Starch",
        "1/2 tsp - Baking Soda",
        "Pinch of Sea Salt",
        "Wet Ingredients:",
        "1/3 cup - Pure Maple Syrup",
        "1 tsp - Pure Vanilla Extract",
        "1 Egg",
        "1 Tbsp - Lemon Juice",
        "2 Tbsp - Coconut Oil, Melted",
        "Add-Ins:",
        "1 tsp - Lemon Zest",
        "1/2 cup - Freeze Dried Blueberries"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Put coconut oil in a glass jar and place in the oven to melt.",
        "In a medium sized bowl, combine all dry ingredients. Add the maple syrup, vanilla extract, egg and lemon juice and blend. Slowly add coconut oil and blend well. Stir in lemon zest and blueberries. Let the dough rest for 5 minutes.",
        "Stir once more and scoop into 1 inch balls. Place balls on a parchment lined cookie sheet. Bake 10-12 minutes or until centers are done. Move parchment paper to a wire rack to cool completely."
      ]
    },
    {
      "category": "Desserts",
      "title": "Lemon Coconut Loaf",
      "image": "images/lemon_coconut_loaf.png",
      "notes": "Makes 2 mini loaves.",
      "ingredients": [
        "Dry Ingredients:",
        "1 cup - Almond Flour",
        "1/4 cup - Coconut Flour",
        "3 Tbsp - Arrowroot Starch",
        "1 tsp - Baking Powder",
        "1/4 tsp - Baking Soda",
        "1/4 tsp - Sea Salt",
        "Wet Ingredients:",
        "3 Eggs",
        "1 tsp - Pure Vanilla Extract",
        "1/4 cup - Pure Maple Syrup",
        "1/2 cup - Coconut Milk",
        "1/4 cup - Coconut Oil, Melted",
        "2 Tbsp - Lemon Juice",
        "Add-Ins:",
        "2 tsp - Lemon Zest",
        "1/3 cup - Shredded Coconut",
        "2 Tbsp - Shredded Coconut, for topping"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "In a medium sized bowl, combine dry ingredients. Add all wet ingredients and mix well.",
        "Stir in lemon zest and ⅓ cup shredded coconut.",
        "Grease 2 mini loaf pans with coconut oil and divide the batter evenly between the two pans. Sprinkle shredded coconut over the tops.",
        "Bake for 35-40 min. or until loaves are golden brown and the centers spring back when pressed.",
        "Remove pans from the oven and let cool on a wire rack for 15 min.",
        "Turn the loaves out onto the wire rack to finish cooling completely.",
        "Slice and serve, or freeze in airtight containers for future use."
      ]
    },
    {
      "category": "Desserts",
      "title": "Maca Chocolate Pie",
      "image": "images/maca_chocolate_pie.png",
      "notes": "",
      "ingredients": [
        "Crust:",
        "3/4 cup - Raw Almonds",
        "1/2 cup - Ground Flaxseed",
        "1 Tbsp - Coconut Oil, Melted",
        "1 Tbsp - Raw Honey",
        "Sea Salt",
        "Filling:",
        "1/2 cup - Macadamia Nuts, Soaked for 1 hour",
        "3/4 cup - Cocoa Powder",
        "1/2 cup - Coconut Oil, Melted",
        "2 Tbsp - Raw Honey",
        "1/4 cup - Water",
        "1 Tbsp - Maca Powder",
        "Sea Salt",
        "Toppings:",
        "Coconut Flakes",
        "Chopped Nuts"
      ],
      "instructions": [
        "Melt coconut oil in a glass dish in the oven.",
        "Rub a small amount of coconut oil in the bottom of the pie pan.",
        "Add all the crust ingredients into a blender. Then put the mixture in the pie plate and press evenly to the bottom and place in the freezer while preparing the filling.",
        "Place all the filling ingredients in the blender and process until smooth. Add water if needed. Filling should be the consistency of thick pudding.",
        "Take the crust out of the freezer and pour in the filling. Spread out evenly over the crust.",
        "Place back in the freezer for 2 hours. Then cover with plastic wrap and keep in the freezer until 15 minutes before ready to serve."
      ]
    },
    {
      "category": "Desserts",
      "title": "Maple Butter Cups",
      "image": "images/maple_butter_cups.png",
      "notes": "",
      "ingredients": [
        "2 Cups - Dark Chocolate Chips",
        "2 Tbsp - Coconut Oil",
        "1 Jar of Maple Butter"
      ],
      "instructions": [
        "Line a mini muffin tin with paper cup liners (makes 24).",
        "Combine 1 cup of the chocolate chips and 1 Tbsp. coconut oil on the stove in a double boiler and melt until smooth.",
        "Pour a small amount of the chocolate mixture into each cup, just enough to cover the bottom.",
        "Place in the freezer for 10 minutes.",
        "Take out of the freezer. Scoop a small dab of maple butter in the center of each cup.",
        "Melt the other 1 cup of chocolate chips and 1 Tbsp. coconut oil in the double boiler.",
        "Pour over the top of the cups, covering the maple butter.",
        "Return to the freezer for 10 more minutes.",
        "Store in the fridge or freezer."
      ]
    },
    {
      "category": "Desserts",
      "title": "No-Cook Chocolate Pudding",
      "image": "images/chocolate_pudding.png",
      "notes": "",
      "ingredients": [
        "1 (13.5oz) can - Full Fat Coconut Milk",
        "1/2 cup - Hot Water",
        "4.5 oz - Dates, Pitted",
        "1/3 cup - Cocoa or Carob Powder",
        "1/4 cup - Chia Seeds",
        "1 Tbsp - Coconut Oil, Melted",
        "2 tsp - Pure Vanilla Extract",
        "1/4 tsp - Sea Salt"
      ],
      "instructions": [
        "Place all ingredients in a high speed blender and blend until smooth (about 45 seconds).",
        "Pour into serving size dishes, cover, and refrigerate for at least 6 hours."
      ]
    },
    {
      "category": "Desserts",
      "title": "Orange Cream Popsicles",
      "image": "images/orange_cream_popsicles.png",
      "notes": "Contributed by T. Franco",
      "ingredients": [
        "1 cup - Fresh Squeezed Orange Juice",
        "1 cup - Coconut Milk",
        "2 Tbsp - Pure Maple Syrup",
        "1/2 tsp - Pure Vanilla Extract"
      ],
      "instructions": [
        "Mix well and pour into popsicle mold.",
        "Freeze and enjoy!"
      ]
    },
    {
      "category": "Desserts",
      "title": "Oreo Cookies",
      "image": "images/oreo_cookies.png",
      "notes": "",
      "ingredients": [
        "Cookie:",
        "1/4 cup - Coconut Flour",
        "1/4 cup - Cocoa Powder",
        "6 Tbsp - Palm Shortening",
        "1/4 cup - Pure Maple Syrup",
        "1/2 tsp - Vanilla Extract",
        "Pinch of Sea Salt",
        "Filling:",
        "1/2 cup - Palm Shortening",
        "1/4 cup - Coconut Sugar",
        "1/2 tsp - Vanilla Extract"
      ],
      "instructions": [
        "Preheat the oven to 325 degrees.",
        "Mix all cookie ingredients in a bowl and stir together well.",
        "Line a baking sheet with parchment paper. Form small balls of cookie dough about 1 tsp. in size and flatten down with the palm of your hand.",
        "Bake for 10 minutes. After cookies are done, let them sit and do not touch until fully cool.",
        "Put the coconut sugar into a high speed blender on high until a powder forms. Combine all the filling ingredients in a small bowl. Spread between layers of cookies. Store in the fridge for up to a week."
      ]
    },
    {
      "category": "Desserts",
      "title": "Pie Crust",
      "image": "images/pie_crust.png",
      "notes": "",
      "ingredients": [
        "2 cups - Raw Pecans",
        "2 Tbsp - Coconut Oil, Melted",
        "1/4 cup - Cocoa Powder",
        "1/4 cup - Pure Maple Syrup",
        "1/8 tsp - Sea Salt"
      ],
      "instructions": [
        "Melt coconut oil in a glass dish in the oven until liquid.",
        "Place pecans in a food processor/blender and grind to a fine meal.",
        "Add rest of crust ingredients and process again until well combined.",
        "Press mixture into the bottom of a pie pan and place in the freezer until ready to use."
      ]
    },
    {
      "category": "Desserts",
      "title": "Pumpkin Pie Chia Pudding",
      "image": "images/pumpkin_pie_chia_pudding.png",
      "notes": "Recipe by Avocado Skillet (Contributed by Laura F.)",
      "ingredients": [
        "3 Tbsp - Chia Seeds",
        "3 Tbsp - Pumpkin Puree",
        "1/2 tsp - Pumpkin Spice",
        "1/4 tsp - Vanilla",
        "1 Tbsp - Pure Maple Syrup",
        "3/4 cup - Coconut Milk"
      ],
      "instructions": [
        "Mix all the ingredients in a mason jar until fully combined.",
        "Refrigerate for 1 hour or overnight."
      ]
    },
    {
      "category": "Desserts",
      "title": "Pumpkin Pie Custard",
      "image": "images/pumpkin_pie_custard.png",
      "notes": "",
      "ingredients": [
        "Dry Ingredients:",
        "1 tsp - Ground Cinnamon",
        "1/4 tsp - Ground Ginger",
        "1/4 tsp - Ground Nutmeg",
        "Pinch of Sea Salt",
        "Wet Ingredients:",
        "1 cup - Pumpkin (or Winter Squash) Puree",
        "2 Eggs, Beaten",
        "1/4 cup & 1 Tbsp - Pure Maple Syrup",
        "1 tsp - Pure Vanilla Extract",
        "1 cup - Full Fat Coconut Milk"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Boil a pot of water (enough to fill the baking pan as directed below).",
        "In a small mixing bowl, combine the dry ingredients. In a separate medium sized mixing bowl, combine the wet ingredients. Whisk with a mixer. Add dry ingredients and mix again until combined.",
        "Pour the custard into small ramekins (oven-safe or glass dishes). Place the ramekins in a 9x13 glass casserole dish and add enough boiling water to the dish to bring the water up halfway to the top of the ramekins. Carefully place the casserole dish in the oven.",
        "Bake for 50 minutes. Serve warm or chilled."
      ]
    },
    {
      "category": "Desserts",
      "title": "Raspberry Sorbet",
      "image": "images/raspberry_sorbet.png",
      "notes": "",
      "ingredients": [
        "1 10oz Bag Frozen Raspberries",
        "1 10oz Bag Frozen Strawberries (you can use any combo of frozen fruits)",
        "1 1/2 cups - 100% Apple Juice",
        "1/4 cup - Pure Maple Syrup",
        "1 tsp - Pure Vanilla Extract"
      ],
      "instructions": [
        "In a blender, pulse berries and apple juice until almost smooth.",
        "Add maple syrup and vanilla. Continue to puree until a smooth texture is achieved.",
        "Scoop out into single serve bowls with lids.",
        "Store in the freezer. (Thaw for 10 min before serving)."
      ]
    },
    {
      "category": "Desserts",
      "title": "Raw Almond Lime Bites",
      "image": "images/raw_almond_lime_bites.png",
      "notes": "",
      "ingredients": [
        "1 1/4 cups + 1 Tbsp - Almond Flour",
        "1 cup - Unsweetened Shredded Coconut",
        "1 tsp - Vanilla",
        "1/2 cup - Coconut Milk",
        "1 Tbsp - Lime Juice",
        "2 Tbsp - Lime Zest(2-3 limes)",
        "1/8 tsp - Sea Salt",
        "1/4 cup - Coconut Sugar",
        "1/4 cup - Coconut Butter (aka Manna)",
        "1/4 cup - Coconut Oil",
        "3/4 cup - Coconut Sugar",
        "1 1/2 Tbsp - Lime Juice",
        "1 Tbsp - Lime Zest (1-2 Limes)",
        "2 Tbsp - Chopped Pistachios"
      ],
      "instructions": [
        "Add almond flour, shredded coconut, vanilla, coconut milk, lime juice and zest, salt and coconut sugar in the blender.",
        "In a small pot on low heat, add coconut butter and coconut oil and melt. Once melted, add to the blender and blend for 45 seconds or until combined into a sticky dough. You may need to scrape down the sides as you go. Transfer the blender to the fridge and chill for 10 minutes.",
        "In a small bowl, combine coconut sugar, lime juice and lime zest for the glaze. If it is too runny, add coconut or almond flour in small quantities until it reaches spreading consistency.",
        "Chop the pistachios and set aside.",
        "Line a cookie sheet with parchment paper. Using damp hands, separate the dough from the blender into golf ball sized pieces and place on the cookie sheet, flatten slightly.",
        "Transfer the cookie sheet to the fridge and chill for 10 more minutes.",
        "Remove from the fridge and cover with glaze. Then sprinkle with pistachios. Place in the freezer for 10 minutes to firm up.",
        "Store in the fridge or freezer."
      ]
    },
    {
      "category": "Desserts",
      "title": "Sweet Potato Brownies",
      "image": "images/sweet_potato_brownies.png",
      "notes": "",
      "ingredients": [
        "1 Medium Sweet Potato",
        "1 cup - Almond Butter",
        "1/4 cup - Cocoa Powder",
        "1 tsp - Pure Vanilla Extract",
        "1/4 cup - Pure Maple Syrup"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Cook the sweet potato for 1 hour, then puree it with a mixer in a medium bowl.",
        "Add almond butter, cocoa powder, vanilla and maple syrup. Mix until well combined.",
        "Pour into a glass 8x8 pan. (Optional: top with almonds and/or dark chocolate chips).",
        "Place in the oven and bake for 23 minutes."
      ]
    },
    {
      "category": "Desserts",
      "title": "Tigernut Cookies",
      "image": "images/tigernut_cookies.png",
      "notes": "",
      "ingredients": [
        "2 cups - Tigernut Flour",
        "1/4 cup - Pure Maple Syrup",
        "1/2 cup - Water",
        "1/2 cup - Coconut Butter, Melted",
        "2 tsp - Pure Vanilla Extract",
        "Pinch of Sea Salt",
        "Optional: Mini Dark Chocolate Chips"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Melt the coconut butter in a glass dish in the oven.",
        "Combine all ingredients in a medium bowl and mix.",
        "Roll into balls and place on a parchment paper lined cookie sheet. Press to flatten.",
        "Bake for 15 minutes. Let cool before serving."
      ]
    },
    {
      "category": "Desserts",
      "title": "Grain and Dairy-Free Tiramisu",
      "image": "images/tiramisu.png",
      "notes": "",
      "ingredients": [
        "Ladyfinger Cookies:",
        "1/2 cup - Palm Shortening",
        "1/4 cup - Coconut Sugar",
        "1/2 tsp - Vanilla Extract",
        "2/3 cup - Almond Flour",
        "2 Tbsp - Coconut Flour",
        "1/3 cup - Arrowroot or Tapioca Starch",
        "1/4 tsp - Baking Powder",
        "Tiramisu:",
        "1 cup - Strong Coffee or Espresso",
        "1 cup - Heavy Coconut Cream",
        "1/3 cup - Coconut Sugar",
        "1 tsp - Vanilla Extract",
        "1 cup - Plain Kite Hill Almond Cream Cheese",
        "Ladyfingers",
        "Cocoa Powder for dusting top"
      ],
      "instructions": [
        "Make Ladyfingers first (see Ladyfinger Ingredients above).",
        "Preheat the oven to 350 degrees. Line a cookie sheet with parchment paper.",
        "In a medium bowl, cream the palm shortening and coconut sugar together until well mixed. Add the vanilla, flours, arrowroot/tapioca and baking powder. Whisk together until just combined.",
        "Take about a tablespoon at a time and flatten down into round circles on the parchment paper, about an inch apart.",
        "Bake for 10 minutes. Allow to cool for 5 minutes before transferring the parchment paper with cookies to a wire rack to cool completely. Be careful, these will be very crumbly.",
        "Move on to Tiramisu recipe. Prepare the cup of coffee in a mug and set aside to cool to room temperature.",
        "Beat the coconut cream, coconut sugar and vanilla until thick and smooth.",
        "Add in the Kite Hill cream cheese and mix until smooth again.",
        "You can use an 8\"x8\" glass dish or individual sized serving dishes to layer ingredients as follows: Take one cookie at a time and dip it into the coffee for about 30 seconds. Place it in the bottom of the dish until the bottom of the dish is covered. Spread half of the creamed mixture on top of the cookies.",
        "Repeat the process with the second layer of ladyfingers and cream mixture. Dust the tops with cocoa powder.",
        "Cover and refrigerate 2-4 hours."
      ]
    },
    {
      "category": "Drinks",
      "title": "Almond Milk Nog",
      "image": "images/almond_milk_nog.png",
      "notes": "",
      "ingredients": [
        "2 1/2 cups - Almond or Coconut Milk",
        "2 Tbsp - Pure Maple Syrup",
        "1/4 tsp - Ground Nutmeg",
        "1/4 tsp - Pure Vanilla Extract",
        "Cinnamon to Sprinkle on Top"
      ],
      "instructions": ["Mix in a blender.", "Pour over ice. Enjoy!"]
    },
    {
      "category": "Drinks",
      "title": "Blueberry Breakfast Shake",
      "image": "images/blueberry_breakfast_shake.png",
      "notes": "",
      "ingredients": [
        "13 oz - Unsweetened Coconut Milk",
        "1/2 cup - Frozen Blueberries",
        "2 Medjool Dates, Pitted",
        "1 heaping Tbsp -  Vanilla Almond Butter",
        "2 cups - Leafy Greens",
        "Handful of ice cubes"
      ],
      "instructions": ["Blend on high speed until smooth."]
    },
    {
      "category": "Drinks",
      "title": "Citrus Vanilla Smoothie",
      "image": "images/citrus_vanilla_smoothie.png",
      "notes": "",
      "ingredients": [
        "2 Navel Oranges, Halved",
        "1 Banana",
        "1/2 cup - Frozen Mango",
        "1 cup - Vanilla Coconut Milk (Adjust More or Less to Desired Thickness)",
        "Opt: Protein Powder"
      ],
      "instructions": [
        "Add all ingredients (except protein powder) to the blender and blend until smooth.",
        "Add protein powder and pulse until just mixed through."
      ]
    },
    {
      "category": "Drinks",
      "title": "Coconut Chai Smoothie",
      "image": "images/coconut_chai_smoothie.png",
      "notes": "",
      "ingredients": [
        "2 Handfuls of Ice",
        "1 Banana",
        "Coconut Milk (cover the ice)",
        "4 Dates",
        "1 scoop - Almond Butter",
        "1 Tbsp - Protein Powder (optional)",
        "1 tsp - Pure Vanilla",
        "1/2 tsp - Cinnamon",
        "1/4 tsp - Pumpkin Pie Spice",
        "1/4 tsp - Ground Ginger"
      ],
      "instructions": [
        "Add all ingredients to the blender and blend until smooth."
      ]
    },
    {
      "category": "Drinks",
      "title": "Dr. Greg's Autumn Shake",
      "image": "images/autumn_shake.png",
      "notes": "",
      "ingredients": [
        "1 Banana",
        "1/2 cup - Ice",
        "1 cup - Cold Cooked Pumpkin (or Winter Squash)",
        "2 Tbsp - Almond Butter (or Handful of Walnuts)",
        "1 Tbsp - Pure Maple Syrup (or 3 Medjool Dates, Pitted)",
        "1 tsp - Vanilla Extract",
        "1 tsp - Cinnamon",
        "1/4 tsp - Ground Ginger",
        "1 cup - Unsweetened Coconut Milk"
      ],
      "instructions": [
        "Put ingredients in a blender.",
        "Blend on high until creamy and smooth. Add more coconut milk if needed."
      ]
    },
    {
      "category": "Drinks",
      "title": "Drew's Frozen Hot Chocolate",
      "image": "images/frozen_hot_chocolate.png",
      "notes": "",
      "ingredients": [
        "3 oz - Unsweetened  Dark Chocolate",
        "2 Tbsp - Hot Chocolate Powder Mix",
        "1 1/2 Tbsp - Pure Maple Syrup",
        "1/2 cup - Full Fat Coconut Cream",
        "1 cup - Almond or Coconut Milk",
        "Ice",
        "Optional: Coconut Whipped Cream and Dark Chocolate Chips"
      ],
      "instructions": [
        "Melt the dark chocolate in a double boiler.",
        "Mix all ingredients in the blender.",
        "Pour over ice. Delish!"
      ]
    },
    {
      "category": "Drinks",
      "title": "Maca Latte",
      "image": "images/maca_latte.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Maca Powder",
        "1 Tbsp - Coconut Milk",
        "1 tsp - Cinnamon",
        "1/2 Tbsp - Pure Maple Syrup",
        "1 Cup - Hot Filtered Water"
      ],
      "instructions": [
        "Add all ingredients to the blender and blend until smooth."
      ]
    },
    {
      "category": "Drinks",
      "title": "Mango Mint Smoothie",
      "image": "images/mango_mint_smoothie.png",
      "notes": "",
      "ingredients": [
        "1 Cup - Coconut or Almond Milk",
        "1 1/2 cup - Ice Cubes",
        "1/2 cup - Lightly Packed Fresh Mint Leaves",
        "1/4 cup - Lime Juice",
        "1 Large Ripe Mango, Roughly Chopped",
        "1 Banana"
      ],
      "instructions": [
        "Blend ingredients in a high powered blender until creamy and smooth."
      ]
    },
    {
      "category": "Drinks",
      "title": "Raspberry Peach Lemonade",
      "image": "images/raspberry_peach_lemonade.png",
      "notes": "",
      "ingredients": [
        "5 oz - Frozen Sliced Peaches",
        "6 oz - Fresh Raspberries",
        "1 Cup - Freshly Squeezed Lemon Juice",
        "6 Cups - Cold Water",
        "3 1/2 Tbsp - Raw Honey"
      ],
      "instructions": [
        "Combine 1 cup of water with the raspberries, peaches and honey in a saucepan placed over medium heat.",
        "Simmer, stirring occasionally, for about 5 minutes.",
        "Pour the mixture into a blender and blend until smooth.",
        "Strain the liquid through mesh to remove raspberry seeds. (If you have a Vitamix, there is no need to perform this step)",
        "Pour the mixture into a pitcher. Whisk in the lemon juice and remaining 5 cups of water.",
        "Refrigerate and serve chilled with ice."
      ]
    },
    {
      "category": "Drinks",
      "title": "Watermelon Limeade",
      "image": "images/watermelon_limeade.png",
      "notes": "This makes a great post-workout electrolyte drink (without all the added junk)!",
      "ingredients": [
        "1/2 cup - Water",
        "2 Cups Watermelon, Seeds Removed",
        "Juice from 1 Lime",
        "Pinch of Sea Salt",
        "Handful of Ice"
      ],
      "instructions": ["Mix in a blender.", "Enjoy!"]
    },
    {
      "category": "Entrées",
      "title": "Artichoke Chicken with Mushroom Sauce",
      "image": "images/artichoke",
      "notes": "",
      "ingredients": [
        "6 Tbsp - Coconut Oil",
        "3-4 lbs - Boneless Skinless Chicken Breasts",
        "1 tsp - Sea Salt",
        "1/4 tsp - Bleack Pepper",
        "1/2 tsp - Paprika",
        "1/2 lb - Mushrooms, Stems Removed",
        "1 1/2 cups - Chicken Broth",
        "3 Tbsp - Apple Cider Vinegar",
        "2 tsp - Raw Honey",
        "2 Tbsp - Coconut Flour",
        "2 cups - Marinated Artichoke Hearts, Drained",
        "2 Tbsp. Capers (Optional)",
        "1 Head Cauliflower, Chopped  (or 1 Package Frozen Chopped Cauliflower)"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Place 4 Tbsp. coconut oil into a stockpot and heat to medium on the stove. Rinse and dry all the chicken, then sprinkle with salt, pepper and paprika.",
        "Add the chicken to the pot and cook for 8 minutes, turning every 2 minutes to brown evenly on all sides.",
        "Remove the chicken and set aside in a large glass casserole dish. Add the remaining 2 Tbsp. of coconut oil to the pot, then add the mushrooms and saute for 5 minutes.",
        "Stir in the broth, vinegar, honey and coconut flour and simmer for 10 minutes.",
        "Pour the artichoke hearts into the dish with the chicken. Add capers and cauliflower. Spoon the sauce over the top. Cover and bake in the oven for 40 min. Remove and finish with a sprinkle of salt and paprika."
      ]
    },
    {
      "category": "Entrées",
      "title": "Asian Lettuce Rolls",
      "image": "images/asian_lettuce_rolls.png",
      "notes": "Recipe Contributed by Rachel G.",
      "ingredients": [
        "Sauce:",
        "3/4 cup - Primal Kitchen Brand Sesame Ginger Dressing",
        "1 heaping Tbsp - Almond Butter",
        "Rolls:",
        "1 lb - Ground Chicken Sausage",
        "2 packages - Miracle Rice (or 1 package of Cauliflower Rice)",
        "1 bunch - Fresh Mint Leaves",
        "1 bunch - Fresh Basil Leaves",
        "1 bunch - Fresh Cilantro Leaves",
        "1 Cucumber, Diced",
        "3 Green Onions, Chopped",
        "1-2 Avocados",
        "Cabbage or Romaine Lettuce Leaves for Wraps"
      ],
      "instructions": [
        "Put sauce ingredients in the blender and mix, then put in the fridge until ready to use.",
        "Wash the leaves you will be using as the wrap and set aside.",
        "Chop the herbs, cucumber, and green onions and place in separate bowls.",
        "Cook the miracle or cauliflower rice according to package directions. Set aside for later.",
        "Brown the meat, sprinkle with sea salt and set aside.",
        "Slice the avocado.",
        "Start with a piece of lettuce. Fill with meat, rice, herbs, cucumber, green onion and avocado. Top with sauce and roll it up."
      ]
    },
    {
      "category": "Entrées",
      "title": "Asian Lettuce Wraps",
      "image": "images/asian_lettuce_wraps.png",
      "notes": "",
      "ingredients": [
        "2 tsp - Coconut Oil",
        "1 lb - Grass Fed Ground Beef",
        "1/4 lb - Shiitake Mushrooms, Sliced",
        "1 cup - Carrots, Shredded",
        "1 8oz Can - Bamboo Shoots, Chopped into Small Strips",
        "2 tsp - Ground Ginger",
        "1 1/2 tsp - Minced Garlic",
        "1/4 cup - Coconut Aminos",
        "Black Pepper",
        "Butter Lettuce Leaves",
        "Avocado, Sliced (optional)"
      ],
      "instructions": [
        "Add coconut oil to the skillet over medium heat. Add the ground beef and saute until browned.",
        "Add the mushrooms, carrots, bamboo, ginger and garlic. Saute for another 5 minutes until carrots soften.",
        "Add the coconut aminos and pepper and mix. Reduce heat to simmer and cook for 5 more minutes. Remove from heat and scoop into butter lettuce leaves.",
        "Add avocado on top if desired."
      ]
    },
    {
      "category": "Entrées",
      "title": "Baked Coconut Chicken",
      "image": "images/baked_coconut_chicken.png",
      "notes": "",
      "ingredients": [
        "1/4 cup - Coconut Oil, Melted",
        "2 lbs - Chicken",
        "1/2 cup - Coconut Flakes",
        "1/4 cup - Almond Flour"
      ],
      "instructions": [
        "Coat the chicken with melted coconut oil and roll in a mixture of coconut flakes and almond meal.",
        "Bake at 350 degrees for about 28 min.",
        "Season with salt and pepper to taste. Serve with veggies."
      ]
    },
    {
      "category": "Entrées",
      "title": "Baked Salmon",
      "image": "images/baked_salmon.png",
      "notes": "",
      "ingredients": [
        "1 lb - Wild Caught Salmon",
        "1/4 cup - Pure Maple Syrup",
        "1/4 cup - Honey Mustard",
        "2 Tbsp - Apple Cider Vinegar",
        "1 tsp - Minced Garlic",
        "1/4 tsp - Sea Salt",
        "1/4 tsp - Black Pepper"
      ],
      "instructions": [
        "Place salmon in a glass dish and set aside.",
        "Whisk together the remaining ingredients in a small bowl.",
        "Pour 3/4 of the mixture over the salmon and let marinate for 30 minutes in the refrigerator.",
        "Transfer salmon to a parchment lined baking dish, skin side down. Bake for 17 minutes at 400 degrees or until flaky.",
        "Drizzle on the remaining sauce and return to the oven for 1 minute. Remove and serve."
      ]
    },
    {
      "category": "Entrées",
      "title": "Balsamic Roast Beef",
      "image": "images/balsamic_roast_beef.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp. Coconut Oil",
        "3 lb Boneless Chuck Roast",
        "3 Sweet Potatoes, peeled and cut into pieces",
        "1 Leek, Chopped",
        "2 Sprigs Fresh Rosemary",
        "2 Bay Leaves",
        "2 tsp - Minced Garlic",
        "1 Cup - Red Wine (Optional)",
        "1/3 cup - Balasmic Vinegar",
        "1 1/2 cups - Beef Broth",
        "Sea Salt and Black Pepper to Taste"
      ],
      "instructions": [
        "Season the roast with salt and pepper.",
        "Melt coconut oil in a large skillet over medium-high heat. Sear the roast for 2-3 minutes on each side.",
        "Place the meat in the slow cooker. Top it with the leek, garlic, red wine (opt.), balsamic vinegar, beef broth, rosemary and bay leaves.",
        "Cover the slow cooker and set it to low for 3 1/2 hours.",
        "After the 3 1/2 hours, add the sweet potatoes and continue to cook on low for another 4 hours.",
        "Remove and discard the bay leaves and rosemary sprigs.",
        "Pour the liquid from the slow cooker into a saucepan and bring to a slow boil over medium-high heat. Keep it boiling and let it reduce until you get the desired consistency for your sauce (about 15 minutes).",
        "Pour the sauce back into the slow cooker and serve with the meat and sweet potatoes."
      ]
    },
    {
      "category": "Entrées",
      "title": "Barbeque Apple Chicken",
      "image": "images/barbeque_apple_chicken.png",
      "notes": "",
      "ingredients": [
        "4-6 Boneless, Skinless Chicken breasts",
        "2 Apples, Peeled and Chopped",
        "1 Yellow Onion, Chopped",
        "1 Clove Garlic, Minced",
        "1 Bottle of Barbeque Sauce of your Choice (Our Favorite: Brownwood Farm's Cherry Barbeque Sauce)"
      ],
      "instructions": [
        "Place all the ingredients in the slow cooker and cover and cook on LOW for 4-5 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Basil Burgers",
      "image": "images/basil_burgers.png",
      "notes": "",
      "ingredients": [
        "1 lb - Grass Fed Ground Beef",
        "1 Onion, Chopped",
        "1/4 cup - Basil, Chopped",
        "Beef Roast Seasoning"
      ],
      "instructions": [
        "Mix all together and make into 4 patties.",
        "Bake or grill. We eat them without a bun!"
      ]
    },
    {
      "category": "Entrées",
      "title": "Beef Stew",
      "image": "images/beef_stew",
      "notes": "",
      "ingredients": [
        "2 lbs - Grass Fed Stew Meat, Cut into 1” Cubes",
        "2 Tbsp - Avocado Oil",
        "Sea Salt and Pepper to Taste",
        "2 cups - Organic Beef Broth",
        "1 Clove Garlic, Minced",
        "5 Carrots, Peeled and Sliced",
        "1 Large Onion, Chopped",
        "3 Stalks Celery, Sliced",
        "1 Sweet Potato, Cubed",
        "1 tsp - Dried Parsley",
        "2 tsp Adobo Seasoning",
        "1/8 Cup - Worcestershire Sauce"
      ],
      "instructions": [
        "Heat the avocado oil in a skillet. Add the meat and cook on medium/low heat until edges are browned.",
        "Place meat in a slow cooker. Add salt and pepper, and stir to coat.",
        "Add remaining ingredients and stir to mix. Cover and cook on LOW 8-10 hours (or HIGH 4-5 hours).",
        "Stir thoroughly before serving."
      ]
    },
    {
      "category": "Entrées",
      "title": "Beef Stroganoff",
      "image": "images/beef_stroganoff.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "16 Button Mushrooms, Stemmed and Sliced",
        "1 Large Onion",
        "2 lbs - Grass Fed Ground Beef",
        "1 cup - Chicken or Beef Broth",
        "1 tsp - Onion Powder",
        "1 tsp - Garlic Powder",
        "2 Tbsp - Apple Cider Vinegar",
        "1 tsp - Sea Salt",
        "1 tsp - Black Pepper",
        "2 Tbsp - Worcestershire Sauce",
        "1/2 cup - Coconut Milk",
        "2 Tbsp - Tapioca Starch or Arrowroot Powder",
        "1 Bag Cauliflower Rice, Cooked"
      ],
      "instructions": [
        "Saute the mushrooms, onions and beef in coconut oil in a skillet until almost cooked through. Transfer to crockpot.",
        "Add the rest of the ingredients (except cauliflower rice) to the crockpot and cook on low for 4 hours.",
        "Cook the cauliflower rice.",
        "Serve the beef mixture over top of the cauliflower."
      ]
    },
    {
      "category": "Entrées",
      "title": "Butternut Squash Lasagna",
      "image": "images/butternut_squash_lasagna.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "3 Carrots, Chopped",
        "1 Small Yellow Onion, Finely Chopped",
        "1 cup - Zucchini, Finely Chopped",
        "2 cups - Sliced Mushrooms",
        "1 lb - Grass Fed Ground Beef",
        "1 lb - Bulk Apple Chicken Sausage",
        "28 oz - Crushed Tomatoes",
        "1 can - Diced Tomatoes with Juice",
        "2 Cloves Garlic, Minced",
        "2 Tbsp - Dried Oregano",
        "1 Tbsp - Dried Basil",
        "1 Tbsp - Garlic Salt",
        "1 Butternut Squash"
      ],
      "instructions": [
        "Place coconut oil in the bottom of a large soup pot on medium heat. Add the carrots, onions, zucchini, and mushrooms and sauté until tender.",
        "While veggies are cooking, brown the beef and sausage on medium heat in a separate skillet until fully cooked. Add the beef/sausage mix to the veggies in the soup pot.",
        "Add the remaining ingredients except for butternut squash, mix well, and simmer for 30 min.",
        "While the sauce simmers, peel, halve, and scoop out the seeds of the butternut squash. Cut the cleaned squash lengthwise in ¼” to 1/2 “ thick strips (resembling thick lasagna noodles). It doesn't have to be perfect!",
        "In the slow cooker, ladle in a layer of the meat sauce, then evenly spread the squash slices on top. Continue to alternate until you have reached 4 layers or more.",
        "Cover and cook on LOW for 4-6 hrs."
      ]
    },
    {
      "category": "Entrées",
      "title": "Chicken Cilantro Lime Skillet",
      "image": "images/chicken_cilantro_lime_skillet.png",
      "notes": "",
      "ingredients": [
        "1 Medium Butternut Squash, Peeled and Cubed",
        "1 Small Head Cauliflower, Cut into Florets",
        "2 Tbsp - Coconut Oil",
        "2 Boneless, Skinless Chicken Breasts",
        "Sea Salt and Pepper to Taste",
        "1 Bunch Cilantro, Chopped",
        "Juice of 2 Large Limes",
        "1 Avocado",
        "Primal Kitchen's Cilantro Lime Dressing (optional)"
      ],
      "instructions": [
        "Cook the chicken in the oven at 350 degrees for about 18 minutes or until cooked through. Chop and set aside.",
        "While the chicken is cooking, put the butternut squash cubes into the blender and pulse until you get rice-size crumbles.",
        "Heat coconut oil in a large stock pot over medium heat. Add the squash and stir occasionally to cook.",
        "In the meantime, chop the cauliflower, add it to the blender and pulse until you get rice-sized crumbles. Then add to the squash and cook, stirring occasionally. When the cauliflower-squash rice is tender (about 10-15 minutes), add the cooked chicken and mix. Season with salt and pepper. Add cilantro and lime juice.",
        "Serve with optional dressing if desired."
      ]
    },
    {
      "category": "Entrées",
      "title": "Chicken Salad",
      "image": "images/chicken_salad.png",
      "notes": "",
      "ingredients": [
        "1 1/2 cups - Chopped, Cooked Organic Chicken or Turkey",
        "2 Stalks Chopped Celery or Fennel Bulb",
        "1/2 cup - Sliced Green Onions",
        "2 Hard Boiled Eggs, Chopped (Opt.)",
        "1 Handful of Grapes or Dried Cherries",
        "1/3 cup - Avocado Mayonnaise",
        "Romaine Lettuce",
        "Sea Salt and Pepper to Taste"
      ],
      "instructions": [
        "Combine ingredients in a bowl and mix well.",
        "Serve over a bed of lettuce."
      ]
    },
    {
      "category": "Entrées",
      "title": "Chicken Zucchini Noodle Dinner",
      "image": "images/chicken_zucchini_noodle_dinner.png",
      "notes": "",
      "ingredients": [
        "2 tsp - Dried Basil",
        "2 tsp - Minced Garlic",
        "1/2 tsp - Black Pepper",
        "1/4 tsp - Sea Salt",
        "1/2 cup - Olive Oil",
        "1/4 cup - Pine Nuts",
        "Chopped Green Onion",
        "6 Large Zucchini, Spiralized",
        "1 Tbsp - Coconut Oil",
        "2-3 Boneless, Skinless Chicken Breasts, Chopped into Bite Size Pieces"
      ],
      "instructions": [
        "Spiralize the zucchini and set aside.",
        "Cook the meat in a skillet on med/low until cooked through. While cooking the meat, saute the zucchini noodles in the coconut oil in a separate deep skillet or large stock pot, and cook until soft (about 8-10 minutes).",
        "In a small bowl, mix the basil, garlic, pepper, salt and olive oil.",
        "When everything is ready, Spoon zucchini noodles onto plates, then add chicken and drizzle olive oil mixture.",
        "Sprinkle pine nuts and green onion on top. Serve immediately."
      ]
    },
    {
      "category": "Entrées",
      "title": "Chipotle Chicken Stew",
      "image": "images/chipotle_chicken_stew.png",
      "notes": "",
      "ingredients": [
        "Marinade:",
        "2 Chipotle Peppers",
        "3 Garlic Cloves",
        "1/4 cup - Raw Honey",
        "1 Tbsp - Ground Mustard",
        "1 tsp - Chili Powder",
        "2 Tbsp - Apple Cider Vinegar",
        "1/2 tsp - Sea Salt",
        "1/2 tsp - Ground Pepper",
        "Stew:",
        "2 Chicken Breasts",
        "2 Tbsp - Coconut Oil",
        "1 Onion, Coursely Diced",
        "1 Turnip, Cut into 3/4\" Cubes",
        "1 Rutabaga, Cut into 3/4\" Cubes",
        "1 cup - Butternut Squash, Cut into 3/4\" Cubes",
        "3 cups - Chicken Broth",
        "2 tsp - Chicken Rub Spice",
        "1 Tbsp - Dried Basil",
        "1/2 tsp - Ancho Chili Pepper Seasoning"
      ],
      "instructions": [
        "Marinate the chicken breasts overnight.",
        "The next day, place the coconut oil, onion, turnip, rutabaga, and squash in the slow cooker.",
        "Cut the chicken and place it on top of the veggies (discard the marinade).",
        "Add the rest of the ingredients, cover, and cook on LOW for 4-6 hrs."
      ]
    },
    {
      "category": "Entrées",
      "title": "Chipotle Meatballs",
      "image": "images/chipotle_meatballs",
      "notes": "",
      "ingredients": [
        "Meatballs:",
        "1 lb - Grass Fed Ground Beef",
        "1 lb - Ground Chicken",
        "2 tsp - Sea Salt",
        "2 tsp - Oregano",
        "1/2 tsp - Chipotle Powder",
        "Cilantro for Garnish",
        "Sauce:",
        "1 Small Yellow Onion, Chopped",
        "3 Garlic Cloves, Minced",
        "2 cups - Tomato Sauce",
        "1 cup - Beef Broth",
        "1/4 tsp - Chipotle Powder",
        "2 Tbsp - Raw Honey",
        "1 tsp - Oregano",
        "Sea Salt and Pepper to taste"
      ],
      "instructions": [
        "In a medium sized mixing bowl, thoroughly mix together all of the meatball ingredients with your hands and set aside.",
        "Put the onion, garlic, tomato sauce and beef broth into the slow cooker and mix well. Add the honey and spices and whisk together.",
        "Form the meat mixture into balls, golf ball sized. Gently drop each meatball into the sauce in the slow cooker. Cover and cook on LOW for 6-7 hrs. Serve garnished with cilantro."
      ]
    },
    {
      "category": "Entrées",
      "title": "Chocolate Chili",
      "image": "images/chocolate_chili.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "1 Large Onion",
        "4 tsp - Minced Garlic",
        "2 lb - Grass Fed Ground Beef",
        "1 tsp - Dried Oregano",
        "1 1/2 Tbsp - Chili Powder",
        "1 1/2 Tbsp - Ground Cumin",
        "1 1/2 Tbsp - Unsweetened Cocoa Powder",
        "1 tsp - Ground Allspice",
        "1 tsp - Sea Salt",
        "2 cups - Beef Broth",
        "3/4 cup - Water"
      ],
      "instructions": [
        "Heat a large skillet on medium-high heat, then add coconut oil. When oil is melted, add onions and cook until translucent. Add garlic.",
        "Crumble the ground meat into the skillet and stir to combine. Continue to cook meat mixture, stirring often until it is cooked through.",
        "Add it to a large crockpot. Add the rest of the ingredients and mix well. Set the crockpot on low for 2.5 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Cinnamon Ginger Lamb",
      "image": "images/cinnamon_ginger_lamb.png",
      "notes": "",
      "ingredients": [
        "2 Whole Cinnamon Sticks",
        "2 lbs - Boneless Leg of Lamb",
        "1 Onion, Chopped",
        "4 Carrots, Chopped",
        "1 Tbsp - Cumin",
        "1 Tbsp - Coriander",
        "1 tsp - Cayenne Pepper",
        "2 Tbsp - Fresh Ginger, Minced",
        "1 tsp - Ground Ginger",
        "4 Garlic Cloves, Minced"
      ],
      "instructions": [
        "Place the cinnamon sticks on the bottom of the slow cooker.",
        "Place the lamb on top of the cinnamon sticks.",
        "Chop the onion and carrots and place them on top of the lamb.",
        "Add the garlic and ginger and remaining spices.",
        "Cover and cook on LOW for 8 hrs."
      ]
    },
    {
      "category": "Entrées",
      "title": "Citrus Red Onion Slaw with Grilled Chicken",
      "image": "images/citrus_red_onion_slaw_with_grilled_chicken.png",
      "notes": "",
      "ingredients": [
        "Salad:",
        "1 Head Green Cabbage, Thinly Sliced",
        "1/2 Small red Onion, Thinly Sliced",
        "2 Tbsp - Cilantro, Chopped",
        "1/2 cup - Celery, Chopped",
        "2 cups - Cooked Chicken, Cubed",
        "Sea Salt to Taste",
        "Black Pepper to Taste",
        "1/2 cup - Walnuts",
        "Dressing:",
        "1/2 cup - Orange Juice",
        "2 Tbsp - Lemon Juice",
        "2 Tbsp - Apple Cider Vinegar",
        "1/4 cup - Olive Oil",
        "1 tsp - Dijon Mustard",
        "2 tsp - Raw Honey",
        "1 1/2 tsp - Minced Garlic",
        "1/2 tsp - Sea Salt",
        "Black Pepper to Taste"
      ],
      "instructions": [
        "Combine salad ingredients in a large bowl.",
        "In a jar with a tight fitting lid, combine the dressing ingredients. Shake well and pour over salad. Toss to coat.",
        "Store in the refrigerator until ready to serve."
      ]
    },
    {
      "category": "Entrées",
      "title": "Coconut Macadamia Chicken",
      "image": "images/coconut_macadamia_chicken.png",
      "notes": "",
      "ingredients": [
        "1 cup - Macadamia Nuts",
        "1/4 cup - Unsweetened Shredded Coconut",
        "4 Chicken Breasts",
        "1/4 tsp - Sea Salt",
        "1/4 tsp - Black Pepper",
        "4 tsp - Avocado Mayonnaise",
        "1 Lime, Zest and Juice",
        "1/4 cup - Cilantro as Garnish (optional)"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "In a food processor/blender, combine macadamia nuts and shredded coconut.",
        "Place the chicken in a 9x13 baking dish and sprinkle with salt and pepper. Spread each chicken breast with 1 tsp. mayo. Spread nut mixture onto chicken, spreading equally.",
        "Bake for 40 minutes on the center rack. Serve with fresh lime zest and juice on top, and top with cilantro."
      ]
    },
    {
      "category": "Entrées",
      "title": "Fiesta Lime Chicken",
      "image": "images/fiesta_lime_chicken.png",
      "notes": "",
      "ingredients": [
        "1 Small Yellow Onion, Sliced",
        "3 Limes",
        "3-4 lbs - Chicken Breasts",
        "4 Tbsp - Taco Seasoning",
        "1/4 cup - Chicken Broth"
      ],
      "instructions": [
        "Thinly slice the onions into strips and place them in the slow cooker.",
        "Cut one lime in half and squeeze juice over the onions.",
        "Place the chicken on top of the onions and evenly sprinkle with half of the taco seasoning. Turn the chicken over and season the other side with remaining seasoning.",
        "Squeeze the remaining limes over the chicken and add the chicken broth.",
        "Cover and cook on HIGH for 3.5 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Fish with Mango Salsa",
      "image": "images/fish_with_mango_salsa.png",
      "notes": "This recipe goes really well with the Cilantro Cauliflower Rice!",
      "ingredients": [
        "Fish:",
        "Your Favorite Fish (commonly Halibut or Sole)",
        "Sea Salt and Pepper to Taste",
        "Salsa:",
        "1 Mango, Peeled and Diced",
        "1 Cucumber, Diced",
        "1 bunch - Cilantro, Chopped",
        "1/4 Small Red Onion",
        "1 1/2 tsp - Minced Garlic",
        "1/2 tsp - Sea Salt",
        "1 Tbsp - Olive Oil",
        "1 Lime, Juiced",
        "1 Avocado, Cubed"
      ],
      "instructions": [
        "Prepare the salsa except for the avocado, cover and place in the fridge.",
        "Wash and dry the fish. Place in a parchment lined baking dish, season with salt and pepper to taste, and bake until done. Remove from the oven.",
        "Remove salsa from the fridge and add the chopped avocado. Place the fish on plates and spoon the salsa over the top."
      ]
    },
    {
      "category": "Entrées",
      "title": "Green Goddess Chicken",
      "image": "images/green_goddess_chicken.png",
      "notes": "",
      "ingredients": [
        "1.5 lbs - Chicken Breast Tenders",
        "Marinade:",
        "2 tsp - Garlic Powder",
        "1/2 tsp - Dried Thyme",
        "1 tsp - Paprika",
        "1 tsp - Sea Salt",
        "1/2 tsp - Pepper",
        "1 1/2 tsp - Chili Powder",
        "Green Goddess Sauce:",
        "Half a Ripe Avocado",
        "1/2 cup - Full Fat Coconut Milk",
        "5 sprigs - Taragon",
        "1 Tbsp - Dijon Mustard",
        "1 Tbsp - White Wine Vinegar",
        "Remaining Ingredients:",
        "Lettuce",
        "Lemon",
        "Olive Oil"
      ],
      "instructions": [
        "Start the night before: Mix the marinade ingredients in a medium bowl. Dip chicken pieces in the bowl to cover both sides and lay flat in a 9”x13” glass casserole dish. Cover and place in the fridge overnight.",
        "Place the sauce ingredients in a blender or food processor and blend for 30 seconds until smooth. Scoop out into a small bowl and place in the fridge to chill while preparing the rest of the recipe.",
        "Drizzle chicken with olive oil. Cook the chicken in the oven at 350 degrees for about 18 minutes or until cooked through.",
        "While chicken is cooking, wash and prepare lettuce for salad. Place on plates. Add a few slices of the remaining half of avocado to the salads.",
        "Add a scoop of the green goddess sauce to the plate. Add chicken to the plates.",
        "Drizzle salad and chicken with olive oil and a squeeze of lemon.",
        "Dip the chicken in the green goddess sauce. Enjoy!"
      ]
    },
    {
      "category": "Entrées",
      "title": "Grilled Chicken and Antipasto Salad",
      "image": "images/grilled_chicken_and_antipasto_salad.png",
      "notes": "",
      "ingredients": [
        "Salad:",
        "1 cup - Kalamata Olives, Pitted",
        "2 cups - Artichoke Hearts, Squeezed",
        "8 oz - Uncured Turkey Lunch Meat, Chopped",
        "1 1/2 cups - Grilled Chicken, Diced",
        "3 Tbsp - Basil, Chopped (or 2 tsp Dried Basil)",
        "3 Tbsp - Parsley, Chopped (or 2 tsp Dried Parsley)",
        "Dressing:",
        "1/2 cup - Olive Oil (or Avocado Oil)",
        "2 Tbsp - Green Onions (or Chives), Chopped",
        "1 tsp - Minced Garlic",
        "1 1/2 tsp - Dijon Mustard",
        "1 1/4 tsp - Italian Seasoning",
        "1 tsp - Garlic Powder",
        "1 tsp - Raw Honey",
        "1/2 tsp - Sea Salt",
        "Black Pepper to Taste",
        "Red or Green Leaf Lettuce"
      ],
      "instructions": [
        "In a large bowl, combine salad ingredients and set aside.",
        "In a jar with a tight fitting lid, combine dressing ingredients and shake to mix well.",
        "Pour dressing over the salad, mix, and refrigerate until ready to eat. Stir again before serving. Serve over lettuce."
      ]
    },
    {
      "category": "Entrées",
      "title": "Hearty Pot Pie",
      "image": "images/hearty_pot_pie.png",
      "notes": "Serves 2-3. Double recipe for more servings. Thank you to Taylor for sharing this recipe!",
      "ingredients": [
        "Crust:",
        "1 1/2 cups - Almond Flour",
        "1/2 cup - Tapioca Flour",
        "1 tsp - Sea Salt",
        "1/2 tsp - Baking Powder",
        "2/3 cup - Palm Shortening",
        "6 Tbsp - Water",
        "Filling:",
        "1 lb - Chicken Breast, Skinless and Boneless, Chopped",
        "2 Carrots, Chopped",
        "1 Head of Broccoli, Chopped",
        "1/3 cup - Coconut Oil",
        "2 Leeks, Chopped",
        "1/4 cup - Tapioca Flour",
        "1/2 tsp - Sea Salt",
        "1/4 tsp - Pepper",
        "Pinch of Paprika",
        "1 3/4 cups - Chicken Broth",
        "1/3 cup - Coconut Milk (or Almond Milk)"
      ],
      "instructions": [
        "For the crust, use a fork to stir together the almond flour, tapioca flour, salt and baking powder.",
        "Cut in the palm shortening until the mixture is crumbly.",
        "Stir in the cold water. Place in the refrigerator while you prepare the filling.",
        "Preheat the oven to 375 degrees."
      ]
    },
    {
      "category": "Entrées",
      "title": "Lamb Stew",
      "image": "images/lamb_stew.png",
      "notes": "",
      "ingredients": [
        "1.5 lbs - Grass Fed Lamb Stew Meat, Cut into 1” Cubes",
        "3 Tbsp - Avocado Oil",
        "Sea Salt and Pepper",
        "3 cups - Broth",
        "2 tsp - Minced Garlic",
        "5 Carrots, Peeled and Sliced",
        "1 Large Onion or Leek, Chopped",
        "3 Medium Potatoes, Peeled and Cubed",
        "1/4 cup - Raisins",
        "1/4 tsp - Cinammon",
        "1/2 tsp - Allspice",
        "1 Bay Leaf",
        "1/4 tsp - Ground Turmeric",
        "1/4 tsp - Ground Cloves",
        "1/4 tsp - Ground Ginger",
        "1/8 tsp - Nutmeg",
        "1/8 Cup - Worcestershire Sauce"
      ],
      "instructions": [
        "Heat 2 Tbsp oil in a skillet on medium heat. Saute the onion/leek, carrots and potatoes for  4 minutes. Add garlic, salt and pepper and mix. Add to the crockpot.",
        "Add 1 Tbsp oil to the empty skillet and cook the meat on medium heat until edges are browned on all sides. Season with salt and pepper.",
        "Place meat in the slow cooker.",
        "Add remaining ingredients and stir to mix. Cover and cook on LOW  for 4-5 hours.",
        "Stir thoroughly before serving."
      ]
    },
    {
      "category": "Entrées",
      "title": "Lectin Free Chili",
      "image": "images/lectin_free_chili.png",
      "notes": "",
      "ingredients": [
        "1 tsp - Sea Salt",
        "2 lbs - Grass Fed Ground Beef",
        "1 tsp - Avocado Oil",
        "2 tsp - Minced Garlic",
        "1 Medium Onion or 3 Small Leeks, Chopped",
        "3 Stalks of Celery, Finely Diced",
        "2 Tbsp - Chili Powder",
        "2 tsp - Ground Cumin",
        "¼ tsp - Ground Cinnamon",
        "1 Pinch of Ground Cloves",
        "2 cups - Grass Fed Beef Broth",
        "3 oz - Pine Nuts",
        "1 Large Sweet Potato, Pureed",
        "1 tsp - Dried Adobo Seasoning",
        "2 tsp - Red Wine Vinegar",
        "2 tsp - Coconut Aminos",
        "2 tsp - Sea Salt",
        "Pepper to Taste",
        "Optional: Sliced Scallions for Garnish"
      ],
      "instructions": [
        "Bake the sweet potato for about an hour at 375 degrees and set aside. (this can be done the day before if desired).",
        "Cook the ground beef and 1 tsp. salt in a skillet until broken up in small pieces and about halfway cooked. Transfer to crockpot.",
        "Use the same skillet to heat avocado oil. Then add garlic, onion, and celery and cook for 5 minutes until soft. Add the chili powder, cumin, cinnamon and cloves and stir, cooking for 1 more minute. Pour in the broth, scraping the bottom of the pan and transfer to the crockpot.",
        "Add to the crockpot: pine nuts, sweet potato puree, adobo seasoning, wine vinegar, coconut aminos, 2 tsp. salt and pepper to taste.",
        "Cover and cook on low for 5 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Maple Roasted Chicken with Sweet Potatoes",
      "image": "images/maple_roasted_chicken_with_sweet_potatoes.png",
      "notes": "",
      "ingredients": [
        "4 Chicken Breasts",
        "1 Onion, Diced",
        "2 Sweet Potatoes, Peeled and Cut into 1\" Chunks",
        "2 Tbsp - Melted Coconut Oil",
        "1 tsp - Sea Salt",
        "1/4 tsp - Black Pepper",
        "3 Tbsp - Pure Maple Syrup"
      ],
      "instructions": [
        "Place all ingredients into the slow cooker.",
        "Cook on Low for 6 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Meatloaf",
      "image": "images/meatloaf.png",
      "notes": "",
      "ingredients": [
        "1 lb - Grass Fed Ground Beef",
        "1/2 cup - Crushed Almond Crackers (We use Simple Mills Sea Salt)",
        "1 Small Onion, Diced",
        "1 tsp - Sea Salt",
        "1/2 tsp - Chophouse Seasoning",
        "1/2 tsp - Oregano",
        "Top with Barbeque Sauce (Our Favorite- Brownwood Farm's Cherry Barbeque Sauce)"
      ],
      "instructions": [
        "Mix all ingredients together in a bowl. Shape into a loaf and place in a slow cooker.",
        "Top with sauce. Cook on low for 3.5-4 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Mild shredded Chicken",
      "image": "images/mild_shredded_chicken.png",
      "notes": "Super easy and quick!! Great to serve over the top of a salad or other greens.",
      "ingredients": [
        "Boneless, Skinless Chicken Breasts",
        "All Natural Barbeque Sauce (Our favorite is Brownwood Farms Cherry Barbeque Sauce)"
      ],
      "instructions": [
        "Place the chicken breasts in the slow cooker and pour the sauce over them.",
        "Cover and cook on low for 4 hours.",
        "When done, shred the chicken with a knife and fork and mix well."
      ]
    },
    {
      "category": "Entrées",
      "title": "Orange Pan Seared Scallops",
      "image": "images/orange_pan_seared_scallops.png",
      "notes": "",
      "ingredients": [
        "Scallops:",
        "1 lb - Scallops",
        "Sea Salt and Black Pepper to Taste",
        "Garlic Powder, a few pinches",
        "2 Tbsp - Coconut Oil",
        "Zest of 1 Orange",
        "Deglazing Liquid:",
        "2 Tbsp - Raw Honey",
        "3 Tbsp - Fresh-Squeezed Orange Juice",
        "1 Tbsp - Warm Water",
        "1 Tbsp - Coconut Oil"
      ],
      "instructions": [
        "Clean and dry scallops. Sprinkle both sides with salt, pepper and garlic powder.",
        "Melt the coconut oil in a skillet over medium heat. Place scallops into the hot pan and allow them to sear for 2-3 minutes. Turn to sear the other side until cooked all the way through.",
        "While the scallops are cooking, combine the deglazing ingredients in a bowl. After removing scallops from the pan, turn the heat to high and pour in the deglazing liquid.",
        "Use a whisk to remove the seared bits of scallops from the bottom of the pan to flavor the sauce. Reduce the remaining liquid over high heat for 2-3 minutes.",
        "Serve the scallops with sauce drizzled over the top and garnished with orange zest."
      ]
    },
    {
      "category": "Entrées",
      "title": "Pistachio Crusted Salmon",
      "image": "images/pistachio_crusted_salmon.png",
      "notes": "",
      "ingredients": [
        "4 Wild Caught Salmon Fillets",
        "1 cup - Pistachios, Roughly Chopped",
        "1/4 cup - Lemon Juice",
        "1 Tbsp - Honey Mustard",
        "2 Tbsp - Raw Honey",
        "1 tsp - Dried Dill",
        "Sea Salt and Black Pepper"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Line a glass dish with parchment paper and place salmon filets in one layer, skin down.",
        "In a bowl, combine the pistachio, lemon juice, mustard, honey, salt and pepper to taste.",
        "Spread mixture on top of salmon fillets, pressing lightly to make it stick.",
        "Place salmon in the oven and bake uncovered for 18-20 minutes or until cooked through.",
        "Let salmon cool 2-4 minutes before serving."
      ]
    },
    {
      "category": "Entrées",
      "title": "Ryan's Chipotle Bowl",
      "image": "images/ryans_chipotle_bowl.png",
      "notes": "",
      "ingredients": [
        "Cauliflower Rice or Miracle Rice",
        "1 lb - Grass Fed Ground Beef",
        "Taco Seasoning (see recipe)",
        "Lettuce",
        "1 can Pinto Beans (Eden Brand)",
        "Salsa",
        "Kite Hill Non-Dairy Sour Cream",
        "Guacamole",
        "Cilantro",
        "Green Onions, Chopped",
        "Chili Powder"
      ],
      "instructions": [
        "Cook the cauliflower/Miracle Rice in a pot on low heat.",
        "Brown the ground beef in a skillet. Add taco seasoning and mix well.",
        "Line it all up buffet style and create your bowl!"
      ]
    },
    {
      "category": "Entrées",
      "title": "Sesame Orange Chicken",
      "image": "images/sesame_orange_chicken.png",
      "notes": "",
      "ingredients": [
        "Crockpot:",
        "2 lbs - Chicken Breasts, Boneless and Skinless",
        "1/3 cup - Coconut Aminos",
        "1/3 cup - Pure Maple Syrup",
        "2 Tbsp - Fresh-Squeezed Orange Juice",
        "Orange Zest",
        "1 Tbsp - Avocado Oil",
        "2 tsp - Minced Garlic",
        "1/2 tsp - Ground Ginger",
        "3/4 tsp - Sea Salt",
        "1/4 tsp - Black Pepper",
        "Remaining Ingredients:",
        "1 Tbsp - Tapioca Flour",
        "Sesame Seeds",
        "Green Onions",
        "1 Bag of Cauliflower Rice"
      ],
      "instructions": [
        "Place chicken in the slow cooker. Place the remaining crockpot ingredients in a bowl, whisk together, and pour over the chicken. Flip the chicken over to fully coat. Cook the chicken on low for 4 hours.",
        "Remove the chicken from the sauce and chop it into bite size pieces. Transfer the sauce from the crockpot into a small saucepan. Return the chicken to the crockpot and cover to keep warm.",
        "Add tapioca flour to the sauce and simmer on the stovetop over medium heat until it becomes thickened. Pour back over the chicken in the crockpot.",
        "Heat the cauliflower rice in a pot until warm.",
        "Spoon the mixture onto plates on top of the cauliflower rice. Sprinkle with sesame seeds and top with chopped green onions."
      ]
    },
    {
      "category": "Entrées",
      "title": "Slow Cooked Ham",
      "image": "images/slow_cooked_ham.png",
      "notes": "",
      "ingredients": [
        "All Natural, Antibiotic-Free Turkey Ham",
        "Whole Cloves, or Ground Cloves",
        "1/8 cup - Plus 2 Tbsp. Pineapple Juice",
        "3 Tbsp - Orange Juice",
        "2 Tbsp - Pure Maple Syrup"
      ],
      "instructions": [
        "Decorate the outside of the ham by inserting as many whole cloves as you like into it (just push the smaller side in toward the center of the ham, so it is sticking out the top). Or, sprinkle ground cloves on the top.",
        "Place ham in the slow cooker. Pour both juices over the top and Drizzle the ham with the maple syrup. Cover and cook on LOW for 8 hours or until the internal temp. reaches 160 degrees. (If you are using a fully pre-cooked ham, cook on LOW for 2 hrs. and then set to warm until ready to eat)."
      ]
    },
    {
      "category": "Entrées",
      "title": "Slow Cooked Short Ribs",
      "image": "images/slow_cooked_short_ribs.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil",
        "4 lbs of Beef Short Ribs",
        "1 tsp - Sea Salt",
        "1 tsp - Pepper",
        "3 Cups - Beef Broth",
        "1/4 cup - Worchestershire Sauce",
        "1 tsp - Garlic Powder",
        "1 tsp - Onion Powder",
        "1 Sprig Fresh Rosemary"
      ],
      "instructions": [
        "Season the ribs on all sides with salt and pepper.",
        "Melt coconut oil in a large skillet over medium heat. Sear the ribs  on each of the 4 sides for about 60 seconds on each side. Set aside.",
        "Pour the beef broth, worcestershire sauce, garlic powder and onion powder into a slow cooker and stir together.",
        "Place the ribs into the liquid in the slow cooker. Spoon the liquid over the top of the ribs to saturate.",
        "Place the rosemary sprig on top of the meat and place the lid on the slow cooker.",
        "Cook on low for 6-8 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Slow Cooked Whole Chicken",
      "image": "images/slow_cooked_whole_chicken.png",
      "notes": "After we eat the chicken for dinner, we strain the liquid from the slow cooker into a stock pot, add a little extra water, throw in some veggies and a few spices and pick off the rest of the chicken meat from the bones left over (you can use the pieces of meat that no one likes to eat at dinner, like the back meat). It makes a very yummy soup that will last a couple days. This really makes the extra cost of a pasture raised bird worth it! While the soup (above) is cooking, we will take the remaining bones and put them back into the crockpot, cover completely with water and follow the bone broth recipe in the \"Soup & Sauces\" section of this cookbook! Simple, easy and healthy way to get the most out of a single bird!",
      "ingredients": [
        "1 Whole Free-Range Chicken",
        "Water",
        "Your Favorite Spices (Chophouse Seasoning, Sea Salt and/or Chicken Rub Spice)"
      ],
      "instructions": [
        "Add a few inches of water to the bottom of the slow cooker (this can be used after the chicken is cooked as a base to make veggie soup-see below). Rinse the chicken and place it into the slow cooker. Add spices.",
        "Cover and cook on HIGH for 4 hours or LOW for 6 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Steak and Root Vegetable Chili",
      "image": "images/steak_and_root_vegetable_chili.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "2 lb - Grass Fed Steak, Cubed",
        "2 Sweet Potatoes, Peeled and Cut into 1\" Cubes",
        "4 Carrots, Peeled and Cut",
        "1 Large Onion, Chopped",
        "1 Tbsp - Minced Garlic",
        "2 1/2 cups - Beef Broth",
        "1/2 Tbsp - Ground Cumin",
        "1 1/2 Tbsp - Chili Powder",
        "Optional: Chopped Green Onion for Garnish"
      ],
      "instructions": [
        "In a large skillet, heat oil over med-high heat. Add the meat and brown all sides for about 5 min.",
        "Add all the ingredients to the slow cooker. Stir well to combine.",
        "Cover and cook on low for 8 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Stuffed Acorn Squash",
      "image": "images/stuffed_acorn_squash.png",
      "notes": "",
      "ingredients": [
        "2 Small Acorn Squash",
        "1 lb - Italian Seasoned Bulk Chicken Sausage",
        "1 Onion, Diced",
        "2 cups - Mushrooms, Chopped",
        "2 cups - Spinach Leaves",
        "1 cup - Water"
      ],
      "instructions": [
        "Place 1 cup of water in the bottom of slow cooker. Cut the acorn squash in half, lengthwise, scoop out the seeds, and set aside.",
        "In a large skillet, brown the sausage over medium heat. Add the onions, mushrooms and spinach to the sausage, and cook for 1-2 minutes. Remove from heat.",
        "Stuff the cavity of the squash with as much of the mixture as you can (It is okay to overstuff them). Carefully place them in the slow cooker, and repeat for the remaining squash halves.",
        "Cover and cook on HIGH for 4 hours."
      ]
    },
    {
      "category": "Entrées",
      "title": "Jalapeno Sweet Potato Chowder",
      "image": "images/jalapeno_sweet_potato_chowder.png",
      "notes": "",
      "ingredients": [
        "2 Large Sweet Potatoes, Fully Cooked",
        "3 Boneless, Skinless Chicken Breasts, Cut to Stew Size Pieces",
        "1 Yellow Onion, Chopped",
        "2Carrots, Peeled and Chopped",
        "3 Celery Stalks, Chopped",
        "2 Tbsp - Coconut Oil, Melted",
        "2 cups - Chicken Broth",
        "2 Jalapeno Peppers, Finely Diced",
        "1/2 cup - Coconut Milk"
      ],
      "instructions": [
        "Cook the sweet potatoes the night before and store in the fridge.",
        "The next day, place the chicken in the slow cooker.",
        "Add the onions, carrots, celery, jalapeno peppers and coconut oil.",
        "Scoop out the sweet potato insides and place in a blender with one cup of the chicken broth. Puree until smooth and add to the slow cooker.",
        "Add the coconut milk and remaining chicken broth and stir well. Cover and cook on LOW for 4 hrs. Uncover and cook on LOW for another half hour. This will thicken the chowder."
      ]
    },
    {
      "category": "Entrées",
      "title": "Sweet Potato Nachos",
      "image": "images/sweet_potato_nachos.png",
      "notes": "If you are in a pinch for time, use Siete brand grain free chips instead of sweet potatoes.",
      "ingredients": [
        "5 Sweet Potatoes, Sliced Very Thin",
        "Sea Salt to Taste",
        "1 Tbsp - Coconut Oil",
        "1 tsp - Onion Powder",
        "2 tsp - Minced Garlic",
        "1/2 tsp - Ground Cumin",
        "1/2 tsp - Ground Coriander",
        "1/2 tsp - Ground Paprika",
        "1 lb - Grass Fed Ground Beef",
        "3 Avocados",
        "1 Lime",
        "1 Tbsp - Olive Oil",
        "Fresh Cilantro",
        "Black Olives, Sliced"
      ],
      "instructions": [
        "Slice sweet potatoes, drizzle with melted coconut oil and spread out on a parchment paper lined cookie sheet. Sprinkle with sea salt to taste.",
        "Bake at 350 degrees for 10-15 minutes. Set aside to cool.",
        "Saute ground beef with onion powder and minced garlic in 1 Tbsp. coconut oil until cooked through.",
        "Add cumin, coriander and paprika and sea salt. Remove from heat and cover to keep warm.",
        "Prepare guacamole by mixing mashed avocados, juice from 1 lime, olive oil and cilantro. Set aside.",
        "Set up a nacho assembly line with sweet potato chips, meat mix, guacamole and olives."
      ]
    },
    {
      "category": "Entrées",
      "title": "Thai Stir Fry",
      "image": "images/thai_stir_fry.png",
      "notes": "",
      "ingredients": [
        "5 Carrots",
        "5 Shiitake Mushrooms, De-stemmed and Sliced",
        "1/2 lb - Boneless, Skinless Chicken Breasts, Sliced into Bite Size Pieces",
        "2 Tbsp - Coconut Oil",
        "2 tsp - Minced Garlic",
        "2 cups - Broccoli, Cut into Small Chunks",
        "1/3 cup - Coconut Aminos",
        "Green Onions",
        "Miracle Rice or Cauliflower Rice"
      ],
      "instructions": [
        "Slice the chicken and set aside.",
        "Peel the carrots. Lay them on their side on a cutting board and use a peeler to slice them lengthwise into small strips (peel down to the core and then flip and peel the other side).",
        "Chop the broccoli.",
        "Cook the miracle rice or cauliflower rice according to package directions.",
        "Heat the oil in a large stock pot. Add the garlic and chicken and stir for about 5 minutes, until chicken is white on the outside. Add the rest of the ingredients and cook for 10 more minutes.",
        "Serve over the miracle (or cauliflower) rice. Top with green onions if desired and serve immediately."
      ]
    },
    {
      "category": "Entrées",
      "title": "Turkey Cauliflower Casserole",
      "image": "images/turkey_cauliflower_casserole.png",
      "notes": "This is a great way to use up leftover turkey after Thanksgiving, or you can substitute leftover chicken!",
      "ingredients": [
        "2 Cups - Leftover Cooked and Chopped Turkey or Chicken",
        "2 (12 oz) Bags Frozen Cauliflower Rice",
        "1 1/2 Tbsp - Coconut Oil",
        "2 tsp - Minced Garlic",
        "1 1/2 Tbsp - Arrowroot Flour",
        "1 Cup - Coconut Milk",
        "1/3 Cup - Avocado Oil Mayonnaise",
        "1 1/2 tsp - Sea Salt",
        "Pepper to Taste",
        "4 Slices of Turkey Bacon, Chopped",
        "1 tsp - Dried Parsley"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Place the meat and frozen riced cauliflower into a casserole dish and set aside.",
        "Heat the coconut oil in a saucepan on medium heat. Add garlic and cook for 30 seconds.",
        "Add the arrowroot flour and stir until golden.",
        "Add the coconut milk and bring to a low simmer, stirring until combined.",
        "Stir in the mayo, salt and pepper and mix well.",
        "Pour sauce mixture over the turkey and cauliflower in the casserole dish and stir to mix,",
        "Bake for 45 minutes.",
        "While it is cooking, cook the bacon and chop it into small pieces.",
        "When casserole is finished, remove from the oven and sprinkle with bacon and parsley."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Asparagus Bacon Soup",
      "image": "images/asparagus_bacon_soup.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "1 Onion or 2 Leeks, Chopped",
        "3 Garlic Cloves, chopped",
        "1 lb Asparagus, Woody Ends Trimmed",
        "1/2 lb Cauliflower, Chopped",
        "3 Cups - Chicken Broth",
        "2 Tbsp - Flat Leaf Parsley, Chopped",
        "Sea Salt and Pepper",
        "3 Slices Turkey Bacon"
      ],
      "instructions": [
        "Heat the coconut oil in a large stock pot over medium heat. Add the onion and cook for 5 minutes or until translucent, stirring occasionally.",
        "Stir in the garlic and cook for one minute until softened.",
        "Add the asparagus and cauliflower and stir for one minute, then pour in the chicken broth. Bring to a boil, reduce heat to low and simmer for 2 minutes.",
        "Continue to simmer the soup for 20 minutes or until the veggies are very tender.",
        "Add the parsley and blend until smooth.",
        "Season with salt and pepper.",
        "Preheat oven to 400 degrees.",
        "Cook the bacon in the oven for 15 minutes until golden and crisp.",
        "Remove from the oven and chop into bite size pieces. Set aside.",
        "Ladle the soup into a bowl and add bacon on top."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Beef and Veggie Soup",
      "image": "images/beef_and_veggie_soup.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "2 lb - Grass Fed Stew Meat",
        "1 Onion, Chopped",
        "4 Cloves Fresh Garlic, Sliced Thin",
        "6 cups - Chicken or Beef Broth",
        "3 Carrots, Peeled and Sliced",
        "1 cup - Green Beans, Chopped",
        "1 cup - Cauliflower, Chopped",
        "2 Tbsp - Fresh Basil Leaves, Finely Chopped",
        "1 tsp - Dried Parsley"
      ],
      "instructions": [
        "Melt the coconut oil in a large skillet over medium heat. Add the beef in a single layer and cook until browned, about 8 minutes. Transfer the beef to the slow cooker.",
        "Add the onions and garlic to the skillet and saute until softened, about 8 minutes. Transfer onions and garlic to a slow cooker, including any liquid in the skillet.",
        "Add the broth and carrots to the slow cooker, set to low, and cook for 6 hours.",
        "With 2 hours left of cook time, add the green beans, cauliflower, basil and parsley, and salt and pepper to taste.",
        "Store leftovers in the fridge."
      ]
    },
    {
      "category": "",
      "title": "",
      "image": "images/",
      "notes": "",
      "ingredients": [""],
      "instructions": [""]
    },
    {
      "category": "Soup & Sauces",
      "title": "Bone Broth",
      "image": "images/bone_broth.png",
      "notes": "Bone broth is extremely healthy and VERY easy to make. It contains beneficial building blocks for your body, like collagen, marrow, glycine, hyaluronic acid, chondroitin sulfate, calcium, magnesium and potassium. This is helpful in reducing inflammation and assisting in gut healing.",
      "ingredients": [
        "Soup Bones (from a healthy organic grass fed/pasture raised animal)",
        "2  Celery Stalks",
        "2  Carrots, Unpeeled",
        "Optional: Garlic Cloves",
        "Sea Salt",
        "2 Tbsp - Apple Cider Vinegar (this helps release the bone minerals)"
      ],
      "instructions": [
        "Place the bones in your slow cooker. Wash the veggies and add them to the slow cooker, no need to chop. Cover ingredients with a generous amount of water. Add apple cider vinegar. Cover and cook on high for 18 to 24 hours.",
        "Check water level periodically, more may need to be added. Strain the broth through a strainer and cool. Broth can be used for sipping, or adding to other recipes and soups.",
        "You can store extra broth in glass mason jars in the freezer for future single serve use. Just leave ½ inch headspace in the jar and allow to cool completely before placing in the freezer."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Broccoli Fennel Soup",
      "image": "images/broccoli_fennel_soup.png",
      "notes": "(Use the fennel bulb another day to make our Creamy Carrot Fennel Soup)",
      "ingredients": [
        "1 Large Head of Broccoli",
        "2 Small Leeks, Chopped",
        "2 tsp - Minced Garlic",
        "1 Tbsp - Coconut Oil",
        "Feathery Tops From 1 Bulb of Fennel, Chopped",
        "6 cups -  Chicken Broth",
        "1 tsp - Sea Salt",
        "Green Onions for Garnish"
      ],
      "instructions": [
        "Remove leaves and cut the tough outer layer of the broccoli stems. Chop the broccoli including the stems (discard any woody parts). Set aside.",
        "Saute leeks and garlic in coconut oil in a large stock pot for about 4 minutes or until transparent.",
        "Add the chopped broccoli, the fennel tops, broth and sea salt.",
        "Simmer until tender, about 20 minutes.",
        "Puree the mixture in a blender for 2 minutes or until smooth. (If you like your soup chunky, do not blend the entire batch- leave some in the pot and add the blended soup back in).",
        "Add blended mixture back into the stock pot and simmer on low for 10 more minutes.",
        "Garnish with green onions if desired."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Carrot Ginger Halibut Soup",
      "image": "images/carrot_ginger_halibut_soup.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil",
        "1 Large Onion, Chopped",
        "5 Carrots, Peeled and Sliced",
        "1 1/2 tsp - Ground Ginger (or 1 1/2 Tbsp - Fresh Ginger)",
        "2 cups - Chicken Broth",
        "1 cup - Water",
        "1 lb  - Halibut, Cut into 1” Chunks",
        "1/4 tsp - Pepper",
        "Sea Salt"
      ],
      "instructions": [
        "Melt coconut oil in a med-large saucepan over medium heat. Saute onion until translucent (~8 min).",
        "Add carrots, ginger, broth and water. Bring to a boil, reduce heat, and simmer for 20 minutes.",
        "Scoop out about one third of the carrots and onion through a slotted spoon to drain liquid off and transfer to a small bowl. Pour the remaining mixture into a blender, puree, and return to the saucepan. Put the carrots and onions you removed back into the saucepan.",
        "Add halibut and pepper and bring to a boil. Simmer uncovered for 6 more minutes.",
        "Add sea salt to taste and enjoy!"
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Creamy Carrot Fennel Soup",
      "image": "images/creamy_carrot_fennel_soup.png",
      "notes": "(Use the feathery fennel tops another day in our Broccoli Fennel Soup Recipe)",
      "ingredients": [
        "1 Tbsp - Extra Virgin Olive Oil",
        "2 Small Leeks, Chopped",
        "2 lbs Carrots, Chopped",
        "1 Large Fennel Bulb, Chopped",
        "6 Cups - Chicken Broth",
        "1 tsp - Dried Thyme",
        "1 Tbsp - Dried Parsley",
        "3/4 tsp - Sea Salt",
        "1/4 cup - Chopped Fresh Chives"
      ],
      "instructions": [
        "Heat the olive oil in a large stockpot over medium heat. Add the leeks and cook for 5 minutes.",
        "Stir in the Carrots, Fennel, Broth, Thyme,  Parsley and Salt. Cover and simmer for 35 minutes.",
        "Use an immersion blender or transfer into a blender to puree the soup.",
        "Return the soup to the pot and stir in the chives. Serve immediately or allow to cool and store in a glass jar in the fridge."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Creamy Cauliflower Leek Soup",
      "image": "images/creamy_cauliflower_leek_soup.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Extra Virgin Olive Oil",
        "1 lb Leeks, Cleaned and Chopped",
        "2 Stalks Celery, Diced",
        "2 tsp - Minced Garlic",
        "1 tsp - Dried Thyme",
        "Zest of 1 Lemon",
        "1 Large Head of Cauliflower, Chopped",
        "1 1/2 tsp - Ground Nutmeg",
        "1 tsp - Sea Salt",
        "1 tsp - Ground Black Pepper",
        "8 Cups - Chicken Broth",
        "1 Bay Leaf",
        "Chives, Chopped (for garnish)"
      ],
      "instructions": [
        "Heat the olive oil in a large stockpot over medium heat. Add the leeks, celery, garlic, thyme, lemon zest, cauliflower, nutmeg, salt and pepper and cook for 10 minutes or until leeks begin to wilt.",
        "Add the broth and bay leaf and simmer on low, covered, for 30 minutes.",
        "Transfer to a blender and puree until smooth.",
        "Return soup to the pot and simmer for another 10 minutes. Serve garnished with chives."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Creamy Chicken Chowder",
      "image": "images/creamy_chicken_chowder.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil",
        "2 Leeks, Chopped",
        "1 Large Potato or Rutabaga, Peeled and Chopped",
        "1 Head Broccoli, Chopped",
        "4 Carrots, Chopped",
        "1 tsp - Sea Salt",
        "1/2 tsp - Pepper",
        "1 tsp - Paprika",
        "4 Cups Broth",
        "1 (13.5 oz) Can Coconut Milk",
        "1 lb Boneless Chicken, Cut into Bite-Sized Cubes",
        "1/4 cup - Arrowroot Flour",
        "Sea Salt and Pepper to Taste"
      ],
      "instructions": [
        "In a large soup pot, heat the oil over low-medium heat. Add the leek and cook until soft.",
        "Add the vegetables and spices and  for another 6 minutes, stir regularly.",
        "Add the broth and coconut milk. Bring to a boil, then simmer for 20 minutes.",
        "Add the chicken and simmer for 5 more minutes.",
        "Add the arrowroot flour, turn heat up to high and stir until chowder thickens.",
        "Season with salt and pepper to taste."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Creamy Mushroom Soup",
      "image": "images/creamy_mushroom_soup.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "2-3 cups - Mushrooms, Chopped Small",
        "2  Leeks, Chopped",
        "2 tsp - Minced Garlic",
        "2 cups - Chicken or Vegetable Broth",
        "1/2 tsp - Dried Thyme",
        "1/2 tsp - Paprika",
        "1/4 tsp - Nutmeg",
        "1/2 tsp - Sea Salt",
        "1/4 tsp - Ground Black Pepper",
        "3/4 cup - Coconut Milk"
      ],
      "instructions": [
        "Melt the coconut oil in a large stockpot over medium heat. Add the garlic, leeks and mushrooms and cook until leeks are soft (about 8-10 minutes).",
        "Pour in the broth and add the thyme, paprika, nutmeg, salt and pepper. Cover and simmer for 15-20 minutes.",
        "Remove from heat and add coconut milk. Stir well. If you like your soup thicker, slowly stir in small amounts of tapioca starch until you reach desired consistency."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Crockpot Hamburger Soup",
      "image": "images/crockpot_hamburger_soup.png",
      "notes": "",
      "ingredients": [
        "1 lb - Grass Fed Ground Beef",
        "6 cups - Chicken or Beef Broth",
        "1 Large Sweet Potato",
        "3  Carrots",
        "1  Onion",
        "4 Stalks Celery",
        "1 Head of Broccoli",
        "1 Tbsp - Dried Parsley",
        "1/2 tsp - Dried Oregano",
        "1/4 tsp - Beef Roast Seasoning",
        "1/4 tsp - Chophouse Seasoning",
        "Sea Salt/Pepper to Taste"
      ],
      "instructions": [
        "Brown the ground beef in a skillet on medium-low heat, then add to the crockpot.",
        "Add all other ingredients and turn the crockpot on high for 5 hours."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Egg Roll Soup",
      "image": "images/egg_roll_soup.png",
      "notes": "",
      "ingredients": [
        "1 lb - Grass Fed Ground Beef",
        "1 Tbsp - Coconut Oil",
        "1  Onion, Diced",
        "4 cups (32 oz) - Chicken Broth",
        "1/2 head Cabbage, Chopped",
        "2 cups - Shredded Carrots",
        "1 tsp - Garlic Powder",
        "1 tsp - Onion Powder",
        "1 tsp - Sea Salt",
        "1 tsp - Ground Ginger",
        "1/2 cup - Coconut Aminos",
        "2 Tbsp - Tapioca Starch or Arrowroot Powder"
      ],
      "instructions": [
        "Brown the meat in the coconut oil in a skillet until almost browned. Transfer the meat to the slow cooker. Add the remaining ingredients except for the tapioca starch. Cook on low for 5 hours.",
        "Before serving, remove ¼ cup of the liquid from the crockpot, add tapioca starch to the liquid and mix well. Pour it back into the crockpot and stir well to thicken."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Lentil Stew",
      "image": "images/lentil_stew.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Avocado or Coconut  Oil",
        "1 Yellow Onion, Chopped",
        "2 Carrots, Peeled and Chopped",
        "2 Celery Stalks, Chopped",
        "2 tsp - Minced Garlic",
        "2 Cups - Dried Lentils",
        "1 tsp - Paprika",
        "1 tsp - Ground Cumin",
        "1 tsp - Dried Thyme",
        "1 tsp - Sea Salt",
        "Black Pepper to Taste",
        "6 Cups Chicken or Vegetable Broth",
        "2 Medium Potatoes or Sweet Potatoes"
      ],
      "instructions": [
        "Heat the oil in a stock pot over medium heat. Add the onion, carrot and celery and cook, stirring frequently, until soft (about 8 minutes).",
        "Stir in the garlic and cook for 1 minute more.",
        "Add the lentils, paprika, cumin, thyme, salt and pepper. Stir well to incorporate.",
        "Add the broth and potatoes and bring to a boil. Reduce the heat to simmer. Cover the pot and simmer for about 50 minutes."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Salmon Chwoder",
      "image": "images/salmon_chowder.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil",
        "1 Leek, Chopped",
        "2 Stalks Celery, Chopped",
        "2 tsp - Dried Dill",
        "1 tsp - Dried Thyme",
        "1 Turnip or Parsnip, Peeled and Chopped",
        "2 Carrots, Chopped",
        "4 Cups Broth",
        "1 (13.5 oz) Can Coconut Milk",
        "1 lb Salmon, Skin Removed and Cut into Cubes",
        "2 Tbsp - Arrowroot Flour",
        "Sea Salt and Pepper to Taste"
      ],
      "instructions": [
        "In a large soup pot, heat the oil over medium heat. Add the leek and cook until soft. Add the celery, dill and thyme. Toss to coat and heat for 1 minute.",
        "Add the turnip/parsnip and carrots and cook for another 5 minutes.",
        "Add the broth and coconut milk. Bring to a boil, then simmer for 15 minutes.",
        "Add the salmon and arrowroot and simmer for 5 more minutes.",
        "Season with salt and pepper."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Scallop Chowder",
      "image": "images/scallop_chowder.png",
      "notes": "",
      "ingredients": [
        "1 (13.5) oz can - Full-Fat Coconut Milk",
        "2 cups - Bone Broth (use homemade or Kettle and Fire brand Mushroom Chicken Flavor)",
        "1/2 lb - Mushrooms, Sliced (optional)",
        "1 Onion, Chopped",
        "1 Small Butternut Squash, Peeled, Pitted and Cubed",
        "1 tsp - Kelp Powder (optional)",
        "1/2 tsp - Sea Salt",
        "Pepper to Taste",
        "1 lb - Scallops, Chopped",
        "2 cups - Cauliflower, Chopped Small",
        "1 cup - Minced Fresh Cilantro"
      ],
      "instructions": [
        "Place coconut milk, broth, mushrooms, onion, squash, kelp powder and salt/pepper in a pot. Heat to a boil and then reduce heat to simmer for 10 minutes.",
        "Add scallops and cauliflower, bring back to a boil, and then simmer again another 10 minutes. Remove from heat and add cilantro. Let sit for 10 minutes. Serve hot."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Slow Cooker Chicken Tortilla Soup",
      "image": "images/slow_cooker_chicken_tortilla_soup.png",
      "notes": "",
      "ingredients": [
        "1 lb Chicken Breast, Trimmed",
        "5 cups Chicken Broth",
        "1 Medium Onion, Chopped",
        "1 Green Pepper, Chopped",
        "1 Serrano Pepper, Minced",
        "2 tsp - Minced Garlic",
        "1/4 tsp - Chili Powder",
        "1 1/2 tsp - Sea Salt, Divided in Half",
        "1 tsp - Ground Pepper, Divided in Half"
      ],
      "instructions": [
        "Add ingredients listed above with half of the salt and pepper into the crockpot.",
        "Cook on high for 4 hours.",
        "Prior to serving, remove the chicken breasts from the crockpot, shred and season with remaining salt and pepper, and place back in the crockpot.",
        "Stir."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Southern Sweet Potato Soup",
      "image": "images/southern_sweet_potato_soup.png",
      "notes": "",
      "ingredients": [
        "2 Large Sweet Potatoes, Peeled and Sliced",
        "3 1/2 cups - Organic Chicken Broth",
        "2 cups - Chopped Onion",
        "6 Celery Stalks, Chopped",
        "2 tsp - Minced Garlic",
        "1/2 cup - Water",
        "1/3 cup - Coconut Oil, Melted",
        "3 Tbsp - Creamy Almond Butter",
        "1/4 tsp - Ground Cinnamon",
        "1/2 cup - Almond or Coconut Milk",
        "1 tsp - Dried Thyme",
        "1 1/2 Tbsp - Raw Honey",
        "1/8 tsp - Ground Nutmeg"
      ],
      "instructions": [
        "Combine top grouping of ingredients in a 5 qt. or larger crockpot.",
        "Cover and cook on low for 7 hours or until potatoes are tender. Cool slightly.",
        "Scoop mixture into a blender (as much as will fit). Blend until smooth and add back into the crockpot. Repeat and return to the crockpot. Add almond milk, thyme, honey and nutmeg. Stir and enjoy!"
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Squash Soup",
      "image": "images/squash_soup.png",
      "notes": "You can substitute many other ingredients and spices in place of squash and pumpkin pie spice to make variations of this yummy delight! Sub pumpkin for squash. Use potatoes and dill. Use broccoli and thyme. Use cauliflower and curry.",
      "ingredients": [
        "1  Butternut Squash, Cut in Half and Baked for 1 Hour at 350 Degrees",
        "1 1/2 cups - Chicken Broth",
        "1 Tbsp - Organic Coconut Oil",
        "1 Tbsp - Coconut Flour",
        "1/2 tsp - Pumpkin Pie Spice",
        "1/4 tsp - Sea Salt",
        "Dash of Pepper",
        "1 cup - Almond or Coconut Milk"
      ],
      "instructions": [
        "Start by baking the squash.",
        "In a blender, combine cooked squash and the chicken broth. Cover and blend until smooth. Set aside.",
        "In a medium saucepan, melt the oil. Stir in flour, seasonings, salt and pepper. Add almond milk. Cook and stir until slightly thickened and bubbly. Cook 1 minute more.",
        "Stir in vegetable mixture and remaining broth. Stir well."
      ]
    },
    {
      "category": "Soup & Sauces",
      "title": "Veggie Soup",
      "image": "images/veggie_soup.png",
      "notes": "We always make this soup after cooking a whole chicken in the crockpot. We just strain the broth into a stockpot to use as the base for this soup. Bone broth (from a healthy chicken) has amazing health benefits!",
      "ingredients": [
        "Choose from the following and chop into bite-sized pieces:",
        "Mushrooms",
        "Leeks",
        "Sweet Potatoes",
        "Green Onion",
        "Cabbage",
        "Broccoli",
        "Onion",
        "Cauliflower",
        "Celery",
        "Carrots",
        "Rutabaga",
        "Garlic Scapes",
        "Rotisserie Chicken"
      ],
      "instructions": [
        "Choose some of the following: salt/pepper, chophouse seasoning, oregano, basil, parsley, turmeric, or your favorite spices!",
        "Add it all together in a large stock pot with a generous amount of chicken broth.",
        "Bring to a boil.",
        "Reduce heat and simmer for about an hour."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Applesauce",
      "image": "images/applesauce.png",
      "notes": "",
      "ingredients": [
        "16-18 Apples",
        "Desired spices: Cinnamon, Nutmeg, Allspice, Ginger"
      ],
      "instructions": [
        "Peel and core apples and cut into chunks. Place in a large pot on the stove with 1\" of water in the bottom of the pot.",
        "Cover and boil until soft",
        "Use a masher tool or mixer to blend apples. Add desired spices and mix.",
        "Freezes well in glass jars after they are cooled."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Asian Slaw",
      "image": "images/asian_slaw.png",
      "notes": "",
      "ingredients": [
        "Slaw:",
        "1 pound - Rainbow Slaw (can buy pre-packaged in produce section - any mix is fine)",
        "1 1/2 cups - Almonds or Macadamia Nuts, crushed",
        "1/4 cup - Sesame Seeds",
        "1 cup - Green Onion, chopped",
        "1 cup - Fresh Cilantro Leaves, chopped",
        "4 Mandarin Oranges, peeled and chopped",
        "Dressing:",
        "1/4 cup - Olive Oil",
        "2 Tbsp - Coconut Aminos",
        "2 Tbsp - White Wine Vinegar",
        "1 Tbsp - Raw Honey",
        "1 tsp - Ground Ginger",
        "Sea Salt",
        "Black Pepper"
      ],
      "instructions": [
        "Combine all slaw ingredients in a large bowl, mix and set aside.",
        "Combine all dressing ingredients in a medium bowl and mix well. Drizzle over the slaw mixture. Toss well to coat.",
        "Refrigerate before serving."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Asparagus & Mushroom Salad",
      "image": "images/asparagus_and_mushroom_salad.png",
      "notes": "",
      "ingredients": [
        "5 1/2 oz - Asparagus Spears",
        "1 Tbsp - Honey Mustard",
        "1/4 cup - Orange Juice",
        "2 Tbsp - Lemon Juice",
        "1 Tbsp - Lime Juice",
        "1 Tbsp - Orange Zest",
        "2 tsp - Lemon Zest",
        "2 tsp - Lime Zest",
        "2 tsp - Minced Garlic",
        "1/4 cup - Local Raw Honey",
        "14 oz - Mushrooms, Halved",
        "5 1/2 oz - Spinach or Arugula"
      ],
      "instructions": [
        "Trim ends of asparagus and cut in half on diagonal. Place in a saucepan of boiling water and cook for 1 minute. Drain and plunge into cold water. Set aside.",
        "In a separate saucepan, place mustard, juices, zests, garlic and honey. Season with pepper. Bring to a boil, then reduce heat and add the mushrooms. Toss for 2 minutes. Cool. Remove the mushrooms from the sauce with a slotted spoon.",
        "Return the sauce to the heat, bring to a boil, then reduce heat and simmer 3-5 minutes until reduced and syrupy. Cool slightly.",
        "Toss the mushrooms, spinach, and drained asparagus together. Serve drizzled with sauce."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Avocado Citrus Salad",
      "image": "images/avocado_citrus_salad.png",
      "notes": "",
      "ingredients": [
        "1 cup - Cucumber, sliced finely",
        "1/4 cup - Red Onion, sliced finely",
        "1 Large Grapefruit, sectioned (reserve juice)",
        "1 Tbsp - Olive Oil",
        "2 tsp - Local Raw Honey",
        "4 1/2 tsp - Jalapeno Pappers, seeded and minced",
        "1/4 tsp - Sea Salt",
        "2 Avocados, halved, pitted, peeled, and sliced",
        "Chopped Lettuce Leaves"
      ],
      "instructions": [
        "Combine cucumber and onion in a medium bowl.",
        "In a small bowl, combine 3 Tbsp grapefruit juice, oil, honey, peppers and salt until well blended. Pour mixture over cucumber mix and toss.",
        "Add grapefruit and avocado and gently toss again.",
        "Divide lettuce onto plates and top with an equal portion of mixture."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Baked Sweet Potatoes",
      "image": "images/baked_sweet_potatoes.png",
      "notes": "",
      "ingredients": [
        "2 Large Sweet Potatoes",
        "1 tsp - Coconut Oil, melted",
        "1/4 tsp - Onion Powder",
        "1/4 tsp - Garlic Powder",
        "1/2 tsp - Ground Cinnamon",
        "Sea Salt and Black Pepper to taste"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Peel the sweet potatoes and chop into 1 inch pieces. In a medium sized bowl, toss the sweet potato pieces with the coconut oil to coat them evenly.",
        "In a small mixing bowl, combine the rest of the ingredients. Mix and add to the sweet potatoes. Toss to spread the spices evenly.",
        "Place the potatoes evenly on a baking sheet and bake for about 30 minutes or until potatoes are fork tender."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Balsamic Brussel Sprouts",
      "image": "images/balsamic_brussel_sprouts.png",
      "notes": "",
      "ingredients": [
        "1 Stalk or Bag of Fresh Brussel Sprouts, washed and halved",
        "4-5 Tbsp - Avocado Oil",
        "1/3 Cup Balsamic Vinegar"
      ],
      "instructions": [
        "Heat oil in a large skillet on low/medium heat.",
        "Add brussel sprouts.",
        "Cook for about 12 minutes, stirring frequently. Add more oil if it begins to stick to the pan.",
        "Add balsamic vinegar and stir for 1 more minute.",
        "Remove from heat and serve warm."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Braised Cabbage and Apples",
      "image": "images/braised_cabbage_and_apples.png",
      "notes": "",
      "ingredients": [
        "1 tsp - Coconut Oil",
        "1 Large Leek, chopped",
        "1 tsp - Minced Garlic",
        "1 tsp - Dried Thyme",
        "Sea Salt",
        "Black Pepper",
        "3 Apples (skin on), cored and sliced into thin wedges",
        "1/2 cup - Dried Cherries",
        "1 1/2 cup - Vegetable or Chicken Broth",
        "1 Head of Cabbage, loosely chopped"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Heat coconut oil oven medium-low heat. Add leeks and saute 3-5 minutes until softened. Stir in garlic, thyme, salt and pepper to taste and saute for 1 more minute.",
        "Add the apples, cherries and broth and stir to combine. Transfer to a large rectangle baking dish. Fold in the cabbage, cover the dish and place in the oven for 40 minutes."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Broccoli Salad",
      "image": "images/broccoli_salad.png",
      "notes": "",
      "ingredients": [
        "3-4 Bunches Broccoli",
        "3/4 lb - Uncured Turkey Bacon (12oz)",
        "1/2 cup - Chopped Almonds",
        "1/2 cup - Green Onion, chopped",
        "Dressing:",
        "1/2 cup - Avocado Mayonnaise",
        "1/3 cup - Local Raw Honey",
        "2 tbsp - Apple Cider Vinegar"
      ],
      "instructions": [
        "Mix dressing, pour over cooked bacon and broccoli.",
        "Add other ingredients and mix well."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Brussel Sprout Pecan Salad",
      "image": "images/brussel_sprout_pecan_salad.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil",
        "1 pound - Brussel Sprouts",
        "1/2 cup - Raisins",
        "1/2 cup - Pecans, crushed",
        "Optional: Cooked Turkey Bacon, chopped finely",
        "Balsamic Vinegar"
      ],
      "instructions": [
        "In a skillet, melt coconut oil and saute sprouts until slightly browned and tender.",
        "Cool the sprouts and mix in raisins and pecans (and bacon if desired).",
        "Top with Balsamic vinegar and salt to taste."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Butternut Squash Casserole",
      "image": "images/butternut_squash_casserole.png",
      "notes": "",
      "ingredients": [
        "1 Butternut Squash, peeled, halved, seeded and thinly sliced",
        "1 Onion, chopped",
        "1/3 cup - Organic Apple Juice",
        "2 Tbsp - Coconut Oil",
        "2 Tbsp - Local Raw Honey",
        "1/4 cup - Shelled Pistachios, crushed",
        "1/4 tsp - Cumin Powder",
        "1/4 tsp - Turmeric Powder"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Melt coconut oil in a glass dish in the oven. Place squash in a casserole dish and cover with onions. Sprinkle spices on top.",
        "In a small bowl, whisk together juice, honey, coconut oil and pistachios. Pour over squash and bake until tender, about 1 hour."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Candied Carrots",
      "image": "images/candied_carrots.png",
      "notes": "",
      "ingredients": [
        "8 Large Carrots, peeled and chopped",
        "4 Dates, pitted and chopped",
        "2 Tbsp - Coconut Oil",
        "Sea Salt to taste"
      ],
      "instructions": [
        "Steam the carrots and dates for 7-8 minutes. Remove from heat.",
        "Add coconut oil and salt. Enjoy!"
      ]
    },
    {
      "category": "Appetizers",
      "title": "Cauliflower Salad",
      "image": "images/cauliflower_salad.png",
      "notes": "",
      "ingredients": [
        "1 Head Cauliflower, cut into bite sized pieces and steamed until tender",
        "2 Turnips, peeled, chopped and steamed until tender",
        "2 Stalks Celery, chopped small",
        "1 Small Red Onion, minced",
        "1 tsp - Dried Dill",
        "1 tsp - Dried Parsley",
        "2 Tbsp - Apple Cider Vinegar",
        "1 1/2 cups - Avocado Mayo or Unsweetened Plain Coconut Milk Yogurt",
        "1 Tbsp - Dijon Mustard",
        "1 tsp - Celery Seeds",
        "1/2 tsp - Black Pepper",
        "1/2 tsp - Sea Salt",
        "Juice of Half a Lemon"
      ],
      "instructions": [
        "Steam the cauliflower and turnips together in the same pot and cool.",
        "In a large bowl, toss together the cauliflower, turnips, celery, onion, dill and parsley. Set aside.",
        "In another bowl, whisk together vinegar, mayo/yogurt, mustard, celery seeds, pepper, salt and lemon juice. Mix well.",
        "Pour the mixture over the veggies and mix until evenly coated. Chill for a couple hours."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Celery Wagons",
      "image": "images/celery_wagons.png",
      "notes": "",
      "ingredients": [
        "1 Stalk Celery",
        "1 Carrot, peeled and slices",
        "Almond Butter",
        "Fruit \"People\" of Choice",
        "Toothpicks"
      ],
      "instructions": [
        "Wash celery and cut into 2-3\" pieces.",
        "Stick a toothpick through each end of the celery piece and slide a carrot onto each end for the wheels. Spread almond butter onto the celery.",
        "Add your drivers and drive it into your mouth!!"
      ]
    },
    {
      "category": "Appetizers",
      "title": "Cilantro Cauliflower Rice",
      "image": "images/cilantro_cauliflower_rice.png",
      "notes": "",
      "ingredients": [
        "1 Head Cauliflower or 1 Bag Frozen Riced Cauliflower",
        "1 Tbsp - Coconut Oil",
        "Sea Salt and Black Pepper to taste",
        "1/4 cup - Fresh Cilantro, finely chopped"
      ],
      "instructions": [
        "Shred the cauliflower with a grater.",
        "In a large skillet over medium heat, melt the coconut oil and place the shredded cauliflower into the skillet. Add salt and pepper to taste.",
        "Saute for about 10 minutes, stirring gently to be sure it cooks through. Remove cauliflower from heat, add cilantro and mix well."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Collard Greens",
      "image": "images/collard_greens.png",
      "notes": "",
      "ingredients": [
        "2 Bunches Collard Greens",
        "1 Small Onion",
        "3 Garlic Cloves",
        "4 Full Pieces Uncured Turkey Bacon",
        "2 cups - Organic Chicken Broth",
        "3 Tbsp - Coconut Oil",
        "Sea Salt and Pepper to taste"
      ],
      "instructions": [
        "Cook bacon and set aside. Chop in small pieces when cool.",
        "Wash greens and chop them into small pieces. Chop the onion and garlic into fine pieces.",
        "Add coconut oil to a large skillet and heat to melt it. Add onion, garlic and bacon and cook on medium/low until the onion is soft.",
        "Add chicken broth, collard greens, and salt and pepper and cover. Simmer for 1 hour and 30 minutes."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Cracked Pepper and Chive Crackers",
      "image": "images/cracked_pepper_and_chive_crackers.png",
      "notes": "",
      "ingredients": [
        "1/2 cup - Almond Flour",
        "1/4 cup - Coconut Flour",
        "1/2 tsp - Onion Powder",
        "1/4 tsp - Sea Salt",
        "1/4 tsp - Coarsely Ground Black Pepper",
        "1 Egg",
        "1 Tbsp - Coconut Oil, melted",
        "3 Tbsp - Chopped Fresh Chives"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "In a medium bowl, whisk together almond flour, coconut flour, granulated onion, sea salt and pepper. Add the egg and mix well. Add the coconut oil and chives. Blend again until well incorporated. Place a piece of parchment paper on a baking sheet. Squeeze the dough into a ball in your hands. Place it on the parchment paper and press it down until it is a flat square, reshaping the edges as it cracks. Sprinkle the tops with additional pepper and press it down into the dough with your hands. Using a sharp knife, cut the dough into bite sized square pieces.",
        "Bake the crackers for 9 minutes. Remove from the oven and carefully pull the crackers apart with a spatula. Bake for another 3-5 minutes until the centers are cooked and the edges are golden. Remove and lift parchment paper onto a wire rack to cool. Store in an airtight container. These are great with guacamole!"
      ]
    },
    {
      "category": "Appetizers",
      "title": "Creamy Cauliflower",
      "image": "images/creamy_cauliflower.png",
      "notes": "",
      "ingredients": [
        "1 Large Head Cauliflower",
        "1 cup - Macadamia Nuts",
        "1 cup - Full Fat Coconut Milk",
        "1 tsp - Sea Salt",
        "1/4 tsp - Paprika",
        "Black Pepper to taste",
        "1 Tbsp - Honey Mustard",
        "Juice of Half a Lemon"
      ],
      "instructions": [
        "Preheat oven to 425 degrees. Grease an 8\"x8\" glass baking dish with coconut or avocado oil.",
        "Steam the cauliflower for 6 minutes. Set aside.",
        "While cauliflower is steaming, prepare the sauce. Add all ingredients except the cauliflower into a high speed blender and process until smooth and creamy.",
        "Toss the cauliflower with half the sauce and pour into the baking dish. Top with remaining sauce.",
        "Bake in the oven for 20-25 minutes or until the top is browned."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Creamy Cauliflower Hummus",
      "image": "images/creamy_cauliflower_hummus.png",
      "notes": "",
      "ingredients": [
        "4 cups - Cauliflower, steamed",
        "2 Tbsp - Sesame Tahini",
        "1/4 cup + 1 Tbsp - Extra Virgin Olive Oil",
        "1 Lemon, juice and zest for garnish",
        "Pinch of Cumin",
        "Sea Salt and Black Pepper to taste",
        "Pinch of Paprika to garnish"
      ],
      "instructions": [
        "Steam the cauliflower.",
        "Zest the lemon and set aside.",
        "In a blender, combine cauliflower, olive oil, lemon juice and cumin until smooth. Scoop out the hummus from the blender and garnish with lemon zest and paprika. Serve with your choice of fresh sliced veggies and olives."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Creamy Coleslaw",
      "image": "images/creamy_coleslaw.png",
      "notes": "",
      "ingredients": [
        "Dressing:",
        "1/2 cup - Avocado Mayonnaise",
        "1 Tbsp - Vinegar",
        "2 tsp - Raw Honey",
        "1/2 tsp - Celery Seed",
        "1/4 tsp - Sea Salt",
        "Veggies:",
        "3 cups - Green Cabbage, shredded",
        "1 cup - Red or Green Cabbage shredded",
        "2 Medium Carrots, grated",
        "1/4 cup - Green Onions, thinly sliced"
      ],
      "instructions": [
        "Combine veggies in a large bowl. In a separate bowl, prepare dressing.",
        "Pour dressing over veggies and toss lightly to coat.",
        "Cover and chill for 2-24 hours."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Cucumber Avocado Salad",
      "image": "images/cucumber_avocado_salad.png",
      "notes": "",
      "ingredients": [
        "2 cups - Cucumber, chopped",
        "1 Avocado, diced",
        "1 tsp - Sea Salt",
        "2 Tbsp - Flax or Omega Fish Oil",
        "1 1/2 Tbsp - Lime Juice",
        "1 tsp - Dried Basil"
      ],
      "instructions": [
        "In a mixing bowl, combine all ingredients and mix well."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Cumin Roasted Carrot Fries",
      "image": "images/cumin_roasted_carrot_fries.png",
      "notes": "",
      "ingredients": [
        "10 Fresh Carrots",
        "1/2 Tbsp - Ground Cumin",
        "1/4 tsp - Ground Cinnamon",
        "1/4 tsp - Dried Parsley",
        "1/4 tsp - Sea Salt",
        "1/4 tsp - Ground Black Pepper",
        "1 1/2 Tbsp - Coconut Oil"
      ],
      "instructions": [
        "Preheat the oven to 400 degrees. Melt the coconut oil in a glass dish in the oven until liquid.",
        "Wash and peel the carrots and cut them lengthwise into thin strips. Toss them into a large bowl.",
        "Mix the cumin, cinnamon, parsley, salt and pepper in a small bowl. Add the melted coconut oil and mix well.",
        "Pour the seasoning over the chopped carrots and toss to mix well until carrots are evenly covered.",
        "Cover a baking sheet with parchment paper. Spread the carrots onto the parchment paper in a single layer and bake for 20 minutes."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Curried Cauliflower",
      "image": "images/curried_cauliflower.png",
      "notes": "",
      "ingredients": [
        "1 Head of Cauliflower, cut into large florets",
        "1/2 cup - Almond Butter",
        "2 Tbsp - Coconut Oil, melted",
        "2 Tbsp - Curry Powder",
        "1/4 tsp - Sea Salt",
        "1/2 cup - Almonds, roughly chopped"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Whisk together the almond butter, coconut oil, curry powder and salt.",
        "Toss the cauliflower and chopped almonds in the curry mixture.",
        "Spread out the cauliflower in a single layer on a parchment paper lined cookie sheet. Bake for 10 min. or until golden brown and just tender when pierced. Flip halfway through if necessary.",
        "Serve immediately."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Dill Carrots",
      "image": "images/dill_carrots.png",
      "notes": "",
      "ingredients": [
        "4 Cups - Chopped Carrots",
        "2 Tbsp - Coconut Oil",
        "1 Tbsp - Snipped Fresh Dill OR 1/2 tsp Dried Dill",
        "1 Tbsp - Lemon Juice",
        "1/4 tsp - Sea Salt",
        "1/8 tsp - Black Pepper"
      ],
      "instructions": [
        "In a medium saucepan, cook carrots covered in a small amount of boiling water (or steam) for 10 minutes or until crisp-tender.",
        "Drain.",
        "Stir in oil, dill, lemon juice, salt, and pepper.",
        "Toss lightly to coat."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Fried Cauliflower",
      "image": "images/friend_cauliflower.png",
      "notes": "",
      "ingredients": [
        "1 Head of Cauliflower",
        "1 Cup - Coconut Oil",
        "1/2 Cup - Almond Flour",
        "1/2 Cup - Arrowroot or Tapioca Flour",
        "2 Cups - Coconut Milk",
        "Sea Salt to taste",
        "Pepper to taste"
      ],
      "instructions": [
        "Chop cauliflower into bite size pieces.",
        "Mix flours together in a medium sized bowl and set aside.",
        "Melt coconut oil in a large skillet.",
        "Pour coconut milk into a large bowl. Add chopped cauliflower to coconut milk and mix until coated.",
        "In batches, transfer cauliflower into the bowl of flour and mix until covered.",
        "Heat oil in skillet to medium. When hot, transfer flour-coated cauliflower into skillet one layer thick and fry it, flipping it regularly, until golden brown.",
        "Use a slated spoon to remove cauliflower pieces from the skillet and set on a plate lined with paper towel.",
        "Repeat with the remaining cauliflower.",
        "Season with salt and pepper to taste."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Garlic Rosemary Dinner Rolls",
      "image": "images/garlic_rosemary_dinner_rolls.png",
      "notes": "",
      "ingredients": [
        "1/2 Cup - Almond Flour",
        "3/4 Cup + 2 Tbsp - Tapioca Flour",
        "5 Tbsp - Coconut Flour (divided 3 Tbsp + 2 Tbsp)",
        "1 Tsp - Garlic Powder",
        "1 Tsp - Dried Chives",
        "3/4 Tsp - Dried Rosemary",
        "3/4 Tsp - Sea Salt",
        "1 Tsp - Baking Powder",
        "1/2 Tsp - Baking Soda",
        "1/3 Cup - Coconut Oil, melted",
        "1/3 Cup - Warm Water (not hot)",
        "1 Tbsp - Apple Cider Vinegar",
        "1 Egg, Room Temperature"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees and line a cookie sheet with parchment paper.",
        "Combine dry ingredients in a large bowl with just 3 Tbsp of the coconut flour.",
        "Melt the coconut oil. Set about 1 Tbsp aside for later.",
        "In a separate bowl, combine the rest of the melted coconut oil, water and vinegar.",
        "Stir the wet mixture into the dry mixture and combine.",
        "Whisk the egg and add to the mixture. Then stir in the last 2 Tbsp of coconut flour one at a time, allowing the dough to set after each one.",
        "Wet your hands with warm water. Shape the dough into about 8 balls and place spaced apart on the baking sheet. Lightly brush the tops of each roll with melted coconut oil.",
        "Bake for 25 minutes or until golden brown. Serve Warm."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Grain Free Stuffing",
      "image": "images/grain_free_stuffing.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "1 Medium Onion, diced",
        "3 Stalks Celery, diced",
        "1 Apple, Cored and diced",
        "4 Large Dates, chopped",
        "2 Tsp - Dried Parsley",
        "4 Tsp - Adobo Seasoning",
        "1/2 Tsp - Sea Salt",
        "1/2 Tsp - Black Pepper",
        "2 Cups Almond Flour",
        "3 Eggs, Whisked"
      ],
      "instructions": [
        "Preheat oven to 350 degrees.",
        "Heat the coconut oil in an oven safe skillet over medium heat.",
        "Add the onion, celery, apple, dates, parsley, adobo seasoning, salt and pepper and saute until soft, about 8 minutes.",
        "Remove from heat. Stir in almond flour and mix well. Then stir in eggs and mix well.",
        "Bake for 35-40 minutes, or until browned on top."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Guacamole",
      "image": "images/guacamole.png",
      "notes": "Goes great with the recipe for 'Cracked Pepper and Chive Crackers",
      "ingredients": [
        "4 Avocados",
        "Juice from 2 Limes",
        "1/2 White Onion, diced",
        "Garlic Salt to taste",
        "Cilantro, chopped"
      ],
      "instructions": ["Mix together and enjoy."]
    },
    {
      "category": "Appetizers",
      "title": "Kohlrabi Bosc Pear Salad",
      "image": "images/kohlrabi_bosc_pear_salad.png",
      "notes": "",
      "ingredients": [
        "1/2 cup - Shelled Pistachios, chopped",
        "2 Kohlrabi, peeled and grated",
        "1 Bosc Pear, cored and grated",
        "1/2 tsp - Lemon Zest",
        "1 Tbsp - Lemon Juice",
        "1 Tbsp - White Balsamic Vinegar Sea Salt",
        "Sea Salt",
        "1 Tbsp - Avocado Oil or Olive Oil",
        "1/2 cup - Mint Leaves, optional"
      ],
      "instructions": [
        "In a small bowl, toss the pistachios with the oil and set aside. Toss the rest of the ingredients in a bowl.",
        "Add the nuts and enjoy!"
      ]
    },
    {
      "category": "Appetizers",
      "title": "Oven Roasted Veggies",
      "image": "images/oven_roasted_veggies.png",
      "notes": "",
      "ingredients": [
        "3 Medium Sweet Potatoes, peeled and cut into 1 inch pieces",
        "2 Medium Carrots, halved lengthwise and cut into pieces",
        "2 Beets, cut into 1\" pieces",
        "1 Medium Onion, sliced",
        "Optional: Rutabaga, Parsnips or Winter Squash (skinned and cubed)",
        "1/4 cup - Coconut Oil, melted",
        "1 tsp - Basil and/or Oregano (or mixed)",
        "1 Tbsp - Lemon Juice",
        "3 tsp - Minced Garlic",
        "1 tsp - Sea Salt",
        "1/2 tsp - Black Pepper"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "In an oiled 9x13 baking dish, combine potatoes, carrots, beets, onion and other optional ingredients.",
        "In a separate bowl, combine oil, herb, lemon juice, garlic, salt and pepper. Drizzle over veggies, toss to coat.",
        "Bake covered for 45 min, stirring once.",
        "Increase oven temperature to 450 degrees. Bake uncovered about 20 minutes or until veggies are tender and brown on edges, stirring occasionally."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Potato Salad",
      "image": "images/potato_salad.png",
      "notes": "",
      "ingredients": [
        "4 Hard Boiled Eggs (no yolks)",
        "3 pounds - Organic Gold Potatoes",
        "2 Tbsp - Apple Cider Vinegar",
        "1 1/4 cup - Avocado Mayonnaise",
        "1 tsp - Celery Salt",
        "1 tsp - Dijon Mustard",
        "1/3 cup - Relish",
        "2 Stalks Celery, chopped",
        "1/2 Red Onion, chopped",
        "Sea Salt/Pepper",
        "Paprika"
      ],
      "instructions": [
        "Boil eggs for 12 minutes, rinse and set aside to cool.",
        "Peel, chop and boil potatoes in a large stock pot until tender (about 8-10 min). Drain and return to the pot. Drizzle with vinegar and set aside to cool for 25 minutes.",
        "In a medium bowl, whisk together mayo, celery salt, mustard and relish. Add to potatoes and mix well.",
        "Then add in celery, onion and hard boiled eggs (chopped). Toss until combined. Season with salt and pepper, and top with a sprinkle of paprika.",
        "Refrigerate for at least 2 hours and serve cold."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Roasted Carrots and Fennel",
      "image": "images/roasted_carrots_and_fennel.png",
      "notes": "",
      "ingredients": [
        "3 Medium Fennel Bulbs, stalks discarded, chopped into 1.2 inch thick wedges",
        "6 Carrots, peeled and cut lengthwise into 3\" pieces",
        "6 Cloves Garlic, peeled",
        "1/2 tsp - Dried Thyme",
        "1/2 tsp - Dried Rosemary",
        "2 Tbsp - Fresh Squeezed Orange Juice",
        "1 1/2 Tbsp - Balsamic Vinegar",
        "2 Tbsp - Avocado Oil",
        "1 1/2 tsp - Sea Salt",
        "Black Pepper to taste"
      ],
      "instructions": [
        "Preheat the oven to 425 degrees.",
        "In a large bowl, toss all ingredients together. Spread in a single layer in a roasting pan.",
        "Bake for about 20 minutes."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Roasted Leek Spinach Salad with Poached Eggs",
      "image": "images/roasted_leek_spinach_salad_with_poached_eggs.png",
      "notes": "",
      "ingredients": [
        "4 Medium Leeks, cut into 1 in. chunks",
        "3 Tbsp - Coconut Oil, divided",
        "2 Tbsp - Lemon Juice",
        "4 tsp - Honey Mustard",
        "6 Large Eggs",
        "8 cups - Fresh Spinach",
        "2 cups sliced Mushrooms"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Toss leeks with 2 Tbsp coconut oil in a glass dish. Season with salt and pepper if desired. Roast in the oven for 45 minutes or until golden, stirring several times.",
        "Meanwhile, whisk together lemon juice, mustard and remaining 1 Tbsp coconut oil in a small bowl.",
        "Fill a large skillet with 2 inches of water and bring to a boil. Add eggs and reduce heat to med-low. Poach eggs for 5-7 minutes, spooning simmering water over eggs.",
        "Toss spinach with mushrooms, roasted leeks, and dressing in a large bowl.",
        "Divide salad among 6 plates and top each with one poached egg."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Roasted Squash, Parsnips and Leeks",
      "image": "images/roasted_squash_parsnips_and_leeks.png",
      "notes": "",
      "ingredients": [
        "1 Butternut Squash, peeled and diced",
        "6 Parsnips, peeled and sliced",
        "1 Leek, sliced",
        "1 tsp - Cumin",
        "1 tsp - Coriander",
        "1/4 tsp - Cinnamon",
        "1/4 tsp - Ground Ginger",
        "1/2 tsp - Sea Salt",
        "1/2 tsp - Black Pepper",
        "2 Tbsp - Melted Coconut Oil, or Avocado Oil"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Line a baking sheet with parchment paper.",
        "In a large bowl, combine all ingredients and mix well.",
        "Spread out the mixture on the baking sheet and roast for 45 minutes."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Sesame Asparagus",
      "image": "images/sesame_asparagus.png",
      "notes": "",
      "ingredients": [
        "3/4 lb - Asparagus Spears, washed",
        "1 Tbsp - Coconut Oil",
        "1 Tbsp - Sesame Seeds",
        "(Opt.) 1 cup - Sliced Fresh Mushrooms",
        "1 tsp - Lemon Juice",
        "1/4 tsp - Olive Oil"
      ],
      "instructions": [
        "Snap off and discard woody bases from fresh asparagus.",
        "Cut asparagus into 1 in. pieces",
        "Steam asparagus in a small amount of boiling water for 4-6 minutes or until crisp-tender. Drain.",
        "In the same pan, melt coconut oil and add sesame seed. Cook and stir over medium heat until seed is toasted.",
        "Add mushrooms. Cook and stir for about 4 minutes or until tender.",
        "Add lemon juice and olive oil.",
        "Add aspargus back in, toss to coat."
      ]
    },
    {
      "category": "Appetizers",
      "title": "Sweet Potato Salad with Apple and Avocado",
      "image": "images/sweet_potato_salad_with_apple_and_avocado.png",
      "notes": "",
      "ingredients": [
        "3 Sweet Potatoes, peeled and cut into 1/2 cubes",
        "1/4 cup - Pine Nuts",
        "1 Medium Apple, diced",
        "1/2 Small Onion, finely chopped",
        "1/4 cup - Chopped Fresh Cilantro",
        "1/4 cup - Lime Juice",
        "2 Tbsp - Olive Oil",
        "1/2 Avocado, finely diced"
      ],
      "instructions": [
        "Place sweet potatoes in large saucepan. Cover with water and bring to a boil. Cook until potatoes are tender. Drain and rinse under cold water to cool.",
        "Drain well.",
        "Combine apple, onion, cilantro and lime juice in a large bowl.",
        "Stir in sweet potatoes, oil and pine nuts.",
        "Stir in avocado just before serving. Season with salt and pepper if desired."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Almond Butter Balls",
      "image": "images/almond_butter_balls.png",
      "notes": "",
      "ingredients": [
        "1/4 cup - Coconut Flour",
        "3/4 cup - Protein Powder",
        "1 1/2 cups - Almond Butter",
        "Optional:",
        "1 Tbsp - Local Raw Honey",
        "Raisins",
        "Dried Cherries",
        "Chopped Nuts",
        "Chocolate Chips"
      ],
      "instructions": [
        "Mix all ingredients together in a bowl until combined.",
        "Pack into tight bite-size balls.",
        "Refrigerate or freeze immediately"
      ]
    },
    {
      "category": "Breakfast",
      "title": "Almond Paleo Pancakes",
      "image": "images/almond_paleo_pancakes.png",
      "notes": "",
      "ingredients": [
        "2 Large Eggs",
        "1/3 cup - Unsweetened Applesauce",
        "1/4 cup - Almond Flour",
        "1/2 tsp - Baking Powder",
        "1/4 tsp - Pure Vanilla Extract",
        "1/2 Tbsp - 100% Pure Maple Syrup"
      ],
      "instructions": [
        "Whisk 2 eggs in a small bowl. Add applesauce, maple syrup and vanilla.",
        "Next, add almond flour and baking powder. Mix until combined.",
        "Grease skillet with coconut oil and heat to medium. Once it is fully heated, spoon about 3 tablespoons of batter for each pancake.",
        "Let cook for about 3-4 minutes on each side. Flip quickly with a spatula.",
        "Serve warm."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Apple Bread",
      "image": "images/apple_bread.png",
      "notes": "",
      "ingredients": [
        "1 cup - Unsweetened Applesauce",
        "4 eggs, at room temperature",
        "1/2 cup - Coconut Oil, melted & cooled",
        "1 tsp - Vanilla Extract",
        "2 Tbsp - Pure Maple Syrup",
        "1/2 cup - Coconut Flour",
        "1/4 cup - Arrowroot Starch",
        "2 tsp - Baking Soda",
        "1 tsp - Cinnamon",
        "1/2 tsp - Nutmeg",
        "1/2 tsp - Sea Salt",
        "1 cup - Finely Chopped Apple",
        "Topping:",
        "1/3 cup - Chopped Pecans or Walnuts",
        "1 tsp - Coconut Oil",
        "1/2 tsp Cinnamon"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Line a loaf pan with parchment paper so the ends hang over the sides.",
        "Combine applesauce, eggs, coconut oil, maple syrup and vanilla in a blender and pulse a few times to combine. Scrape down the side and blend for 30 seconds until smooth.",
        "Add coconut flour, arrowroot starch, baking soda, cinnamon, nutmeg and sea salt and blend again for 30 seconds. Stir in chopped apple with the batter.",
        "Transfer batter to loaf pan and smooth into an even layer.",
        "Combine ingredients for the topping in a small bowl and stir together to coat. Distribute over top of the batter in the loaf pan.",
        "Bake for 50 minutes, until a toothpick inserted in the center comes out clean.",
        "Let cool for 30 min. before removing from the pan by lifting it up using the parchment paper. Slice and serve warm, store in the fridge up to a week or freeze."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Apple Cinnamon Waffles",
      "image": "images/apple_cinnamon_waffles.png",
      "notes": "Makes about 15 waffles",
      "ingredients": [
        "Dry Ingredients",
        "3 cups - Almond Flour",
        "1/2 cup - Tapioca Starch",
        "2 Tbsp - Coconut Flour",
        "1 1/2 tsp - Ground Cinnamon",
        "Pinch of Sea Salt",
        "2 Tbsp - Baking Powder",
        "Wet Ingredients:",
        "4 Eggs, Yolks and Whites Separate",
        "3 tsp - Pure Vanilla Extract",
        "2 Apples, peeled and grated",
        "1 cup - Coconut Milk",
        "4 Tbsp - Coconut Oil, melted",
        "Toppings: Fresh Fruit, Pure Maple Syrup"
      ],
      "instructions": [
        "Melt coconut oil.",
        "Combine together the dry ingredients.",
        "In a separate bowl, combine together the egg yolks, vanilla, coconut milk, apple and melted coconut oil. Mix in with the dry ingredients.",
        "With a mixer, whip the egg whites until frothy.",
        "Fold the egg whites into the batter gently, just enough to mix.",
        "Preheat waffle iron. Follow directions for waffle iron to cook."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Apple Egg Muffins",
      "image": "images/apple_egg_muffins.png",
      "notes": "",
      "ingredients": [
        "3 large Green Apples, chopped into 1/2 in. pieces",
        "3 Tbsp - Warm Water",
        "2 tsp - Cinnamon, divided",
        "9 Eggs",
        "1 1/2 Tbsp - Coconut Oil, melted",
        "3 Tbsp - Coconut Milk",
        "1 1/2 Tbsp - Coconut Flour",
        "1/4 tsp - Baking Soda",
        "Pinch of Sea Salt"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "In a medium skillet, saute apples, water and 1 1/2 tsp. cinnamon until the apples are the consistency of chunky applesauce. Allow the mixture to cool before combining with the egg mixture.",
        "In a medium sized bowl, whisk the eggs, coconut oil, coconut milk, coconut flour, 1/2 tsp. cinnamon, baking soda and salt until well combined. Add the cooled apple mixture, reserving 1/4 cup for a garnish.",
        "Spoon mixture into lined muffin tins. Spoon 1 tsp of apples on top of each muffin. Bake for 40 minutes."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Banana Pancakes",
      "image": "images/banana_pancakes.png",
      "notes": "",
      "ingredients": [
        "2 Bananas",
        "4 Organic Eggs",
        "2 tsp - Pure Vanilla",
        "3 Tbsp - Melted Coconut Oil OR Avocado Oil",
        "1/8 tsp - Sea Salt",
        "1/2 tsp - Baking Soda",
        "2/3 cup - Almond Flour",
        "1/4 cup - Coconut Flour"
      ],
      "instructions": [
        "Place all ingredients in a blender and process for 2-3 minutes until smooth.",
        "Grease a griddle with coconut or avocado oil and heat to medium.",
        "Pour 1/2 cup of batter on griddle to form pancakes.",
        "Cook for 4-5 min. on one side, then flip and cook for 1-2 min. more."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Blueberry Almond Crumb Muffins",
      "image": "images/blueberry_almond_crumb_muffins.png",
      "notes": "",
      "ingredients": [
        "Coconut Oil (to grease muffin pan)",
        "2 cups - Almond Flour, divided",
        "1/2 cup - Coconut Flour",
        "1/2 tsp - Sea Salt",
        "6 Eggs",
        "2/3 cup - Raw Honey",
        "3/4 tsp - Pure Vanilla Extract",
        "3/4 tsp - Pure Almond Extract",
        "1 cup - Blueberries",
        "1 Tbsp - Melted Coconut Oil"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Grease muffin pan with coconut oil.",
        "Set aside 2 tbsp of almond flour. In a mixing bowl, combine remaining almond flour, coconut flour and salt.",
        "In a separate bowl, whisk together eggs, honey, vanilla, and almond extract. Then add to dry ingredients and mix thoroughly.",
        "Fold in blueberries, then pour batter into muffin cups. Pat the tops down into rounded heaps and use a brush to dab with melted coconut oil. Sprinkle with remaining almond flour.",
        "Bake for 30-40 min. The top should be springy, yet firm when ready. (For mini-muffins, bake for 26 min.)"
      ]
    },
    {
      "category": "Breakfast",
      "title": "Breakfast Bowl",
      "image": "images/breakfast_bowl.png",
      "notes": "",
      "ingredients": [
        "2 Fried Eggs",
        "1 Avocado",
        "2 Tbsp - Coconut Oil",
        "1/2 Small Red Onion, finely chopped",
        "4 cups - Cauliflower Rice",
        "Sea Salt and Pepper to taste",
        "Pico De Gallo:",
        "1/2 Small Red Onion, chopped",
        "1/2 cup - Chopped Fresh Cilantro",
        "1 Jalapeno, chopped",
        "Juice of 1 lime",
        "Salt and Pepper to taste"
      ],
      "instructions": [
        "Put 1/2 the red onion in a skillet with the coconut oil and cook until soft. Add cauliflower rice and cook until tender. Season with salt and pepper and set aside.",
        "To make pico de gallo, combine all the ingredients and mix well. Set aside.",
        "Fry the eggs in a skillet.",
        "Serve cauliflower rice in a bowl, topped with fried egg, pico de gallo and a sliced avocado."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Breakfast Hash",
      "image": "images/breakfast_hash.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil",
        "1 Onion, diced",
        "2 tsp - Minced Garlic",
        "1 Small Sweet Potato, peeled and diced",
        "1 tsp - Thyme",
        "1 tsp - Basil",
        "1 lb - Chicken Breakfast Sausage",
        "Eggs"
      ],
      "instructions": [
        "Preheat the oven to 375 degrees.",
        "Dice the sweet potato and place in the oven to bake for about 40 minutes or until soft (while you prepare the rest of the recipe).",
        "In a large skillet, melt the coconut oil. Add the onion and saute for 3 minutes. Add the garlic and spices and saute for 5 minutes. Add the sausage and cook until done. Remove from heat and set aside.",
        "Prepare the eggs to your liking (poached, over easy, scrambled, etc).",
        "Prepare plates. Start with a scoop of the meat mixture. Top with sweet potatoes. Add the eggs on top."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Breakfast Muffins",
      "image": "images/breakfast_muffins.png",
      "notes": "",
      "ingredients": [
        "1/2 cup - Almond Flour",
        "1/3 cup - Coconut Flour",
        "1 tsp - Cinnamon",
        "1/2 tsp - Baking Soda",
        "1/8 tsp - Ground Cloves",
        "1/4 tsp - Ground Ginger",
        "Pinch of Sea Salt",
        "6 Eggs",
        "2 tsp - Pure Vanilla Extract",
        "1/3 cup - Pure Maple Syrup",
        "1 cup - Finely Shredded Carrots",
        "1 cup - Finely Shredded Zucchini",
        "1/2 cup - Finely Shredded Unsweetened Coconut",
        "1/4 cup - Chopped Raw Walnuts",
        "1/3 cup - Dried Cherries",
        "1/4 cup - Raw Chopped Almonds"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. In a small bowl, mix together the dry ingredients. In a medium bowl, whisk eggs until light and frothy. Add vanilla and maple syrup and whisk to combine.",
        "Add the dry ingredients to the egg mixture and blend well. Stir in the carrots, zucchini, coconut, walnuts, dried cherries and pumpkin seeds until incorporated. Line a 12 cup muffin tin with paper liners, and divide the batter among them. Bake the muffins for 25-30 minutes or until they are browned and the centers spring back to the touch. Let cool for 10 minutes, then remove muffins and let cool completely on a wire rack.",
        "Store in an airtight container in the fridge, or freeze for later user. These are great for on-the-go!"
      ]
    },
    {
      "category": "Breakfast",
      "title": "Breakfast Quiche",
      "image": "images/breakfast_quiche.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "1/2 Yellow Onion, diced",
        "6-8 oz - Bulk Breakfast Chicken Sausage",
        "10 Eggs",
        "1/2 tsp - Sea Salt",
        "Black Pepper to taste",
        "1/2 tsp - Italian Seasoning"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "In a large skillet, melt coconut oil. Add onion and saute until softened. Add sausage to the skillet and cook until done all the way through, breaking up the pieces. Remove from heat.",
        "Grease an 8\"x8\" glass baking dish. Sprinkle the sausage mixture over the bottom of the dish.",
        "In a medium bowl, whisk together eggs, sea salt, pepper and Italian seasoning. Pour egg mixture over sausage mixture in the baking dish. Sprinkle some salt and pepper on top.",
        "Bake for 25-30 min or until lightly browned on top and the center is set. Let cool completely on a wire rack. Slice and eat!",
        "These can be frozen. Just put a piece of parchment paper between each layer and seal in an airtight container. When ready to eat, thaw in the fridge overnight and reheat in the oven at 325 degrees for about 20 min."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Breakfast Skillet",
      "image": "images/breakfast_skillet.png",
      "notes": "",
      "ingredients": [
        "1 Package of Organic Chicken Sausages, sliced OR 1 Pound Bulk Chicken Sausage",
        "2 Tbsp - Coconut Oil",
        "1 Small Onion, diced",
        "2 cups - Butternut Squash, diced",
        "1 cup - Apple, diced",
        "2 cups - Kale, chopped finely",
        "1/2 tsp - Sea Salt",
        "Eggs (optional)"
      ],
      "instructions": [
        "Place 1 Tbsp of coconut oil in a skillet, add sausage, and stir until cooked through.",
        "Remove meat from skillet and set aside. Return skillet to heat and add 1 Tbsp coconut oil.",
        "Saute the onion for 3 minutes. Then add the squash, apple, kale and salt and continue cooking for another 10 minutes, until squash is tender.",
        "Return the sausage to the pan and cook for another minute to heat through.",
        "Serve with fried eggs (optional) on top if desired."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Breakfast Veggie Stir Fry",
      "image": "images/breakfast_veggie_stir_fry.png",
      "notes": "",
      "ingredients": [
        "4 Tbsp - Coconut Oil",
        "1 Celery Root, skinned and chopped",
        "1 Medium Sweet Potato, peeled and chopped",
        "1/2 Pound Asparagus, chopped",
        "Fresh Basil, chopped",
        "1 Tsp - Sea Salt",
        "1 1/2 Tsp - Italian Seasoning",
        "Optional: Garnish with Chives"
      ],
      "instructions": [
        "Melt the coconut oil in a large skillet on med-low heat.",
        "Add celery root and sweet potato and cook, stirring regularly, for 12 minutes.",
        "Add asparagus, salt and seasoning and cook for another 10 minutes.",
        "Add basil and cook for another 4 minutes.",
        "Remove from heat. Garnish with chives and serve."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Chai Streusel Muffins",
      "image": "images/chai_streusel_muffins.png",
      "notes": "",
      "ingredients": [
        "Muffins:",
        "1 1/2 Cups - Almond Flour",
        "1/3 Cup - Coconut Sugar",
        "1 Tsp - Baking Soda",
        "1/2 Tsp - Sea Salt",
        "3 Eggs, room temperature",
        "1/4 Cup - Avocado Oil",
        "1 Tbsp - Apple Cider Vinegar",
        "Streusel:",
        "1/4 Cup - Almond Flour",
        "2 Tbsp - Coconut Sugar",
        "2 Tsp - Ground Ginger",
        "1 1/2 Tsp - Ground Cinnamon",
        "1 Tsp - Ground Cardamom",
        "1 Tsp - Ground Allspice",
        "1 Tsp - Nutmeg",
        "2 Tbsp - Coconut Oil"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "For the muffins: In a large mixing bowl, add almond flour, coconut sugar, baking soda and salt. Set aside.",
        "In a separate bowl, add eggs, avocado oil and apple cider vinegar. Mix until eggs are beaten.",
        "Slowly add the dry ingredients to the wet ingredients and stir until a batter forms.",
        "For the Streusel: Place all of the dry ingredients into a bowl and mix, then add the coconut oil. Using a fork, press ingredients together until small crumbs form.",
        "Line a muffin tin with muffin liners and drop 2 Tbsp of batter into each liner. Sprinkle 2 teaspoons of the streusel on top of the batter.",
        "Bake for 20-22 minutes, remove from the oven and let cool."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Cherry Pistachio Scones",
      "image": "images/cherry_pistacho_scones.png",
      "notes": "",
      "ingredients": [
        "Dry Ingredients:",
        "1 cup - SHelled Pistachios, coarsely chopped",
        "3/4 cup - Almond Flour",
        "3 Tbsp - Coconut Flour",
        "1/4 cup - Arrowroot Starch",
        "1/4 tsp - Sea Salt",
        "Wet Ingredients:",
        "2 Eggs",
        "1/3 cup - Pure Maple Syrup",
        "1 tsp - Pure Vanilla Extract",
        "1/8 tsp - Pure Almond Extract",
        "2 Tbsp - Coconut Oil, melted",
        "TODO: Add-In:",
        "1 cup - Dried Cherries"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Place coconut oil in a glass dish in the oven to melt.",
        "Line a baking sheet with parchment paper.",
        "In a medium sized bowl, combine all dry ingredients.",
        "Add the eggs, maple syrup, vanilla extract and almond extract and blend. Slowly add the coconut oil and mix well.",
        "Stir in the dried cherries. Cover and refrigerate dough for 1 hour.",
        "Scoop the dough onto the baking sheet. Dust your hands with arrowroot starch and shape the dough into a 2\" thick disc. Bake for 20 minutes.",
        "Remove the baking sheet from the oven and carefully cut the dough into 8 triangle wedges, gently sliding them apart with the knife.",
        "Bake for an additional 8-10 minutes or until golden brown and firm to the touch.",
        "Place the parchment paper on a wire rack to cool completely.",
        "Store in an airtight container or freeze for later user."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Chocolate Sweet Potato Waffles",
      "image": "images/chocolate_sweet_potato_waffles.png",
      "notes": "These can be frozen and put directly into the toaster to reheat when ready to eat!",
      "ingredients": [
        "Dry Ingredients:",
        "1 cup - Almond Flour",
        "1/4 cup - Coconut Flour",
        "3 Tbsp - Arrowroot Starch",
        "1/4 cup - Cocoa Powder",
        "1/2 tsp - Baking Powder",
        "1 1/2 tsp - Ground Cinnamon",
        "Wet Ingredients:",
        "4 eggs",
        "1/2 cup - Mashed Sweet Potato",
        "2 tsp - Pure Vanilla Extract",
        "4 Tbsp - 100% Pure Maple Syrup",
        "1/2 cup - Coconut Milk"
      ],
      "instructions": [
        "In a medium bowl, combine dry ingredients.",
        "Add wet ingredients and blend. If the batter is too thick, add more coconut milk.",
        "Preheat waffle iron. Pour batter into waffle iron and cook."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Coconut Hot Cereal",
      "image": "images/coconut_hot_cereal.png",
      "notes": "",
      "ingredients": [
        "2 cups - Coconut Milk",
        "1 tsp - Cinnamon",
        "1 tsp - Vanilla Extract",
        "1/2 cup - Shredded Coconut Flakes",
        "1/4 cup - Coconut Flour (or Green Banana Flour)",
        "1 Tbsp - Arrowroot Starch (or Tapioca Starch)",
        "1 tsp - Raw Honey (or Maple Syrup)",
        "Frozen Berries/Banana"
      ],
      "instructions": [
        "Bring coconut milk, cinnamon, and vanilla to a boil in a saucepan. Once boiling, add coconut flakes and simmer for 10 minutes.",
        "Remove from heat. Add coconut flour, arrowroot/tapioca starch, and honey/maple syrup. Sprinkle in berries and top with a sliced banana."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Dr. Becky's Protein Bars",
      "image": "images/dr._becky's_protein_bars.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil, Melted",
        "1/2 cup - Unsweetened Applesauce",
        "1/2 tsp - Pure Vanilla",
        "1/8 tsp - Sea Salt",
        "1/3 cup - Green Banana Flour",
        "3 scoops Grass Fed Beef Vanilla Protein Powder",
        "1 cup - Shredded Coconut",
        "1/2 cup - Dark Chocolate Chips (or mix together 1/3 cup Carob Powder with 1/3 cup Melted Coconut Oil)"
      ],
      "instructions": [
        "Melt coconut oil. In a medium bowl, mix together coconut oil, applesauce, vanilla and sea salt until smooth.",
        "Add banana flour and protein powder and mix well. Then add shredded coconut and mix again. Mixture will be thick.",
        "Spread mixture into a glass 8\" by 8\" dish lined with parchment paper and press into a flat even layer. Refrigerate for 20 minutes.",
        "Melt chocolate chips in a double boiler. Remove glass dish from the fridge and pour the chocolate over the top. Spread until even. Place back in the fridge for 2 to 4 hours. Remove and cut into bars.",
        "Refrigerate until ready to eat or freeze for later use."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Frittata",
      "image": "images/frittata.png",
      "notes": "",
      "ingredients": [
        "8 Organic Eggs (eliminate a couple yolks)",
        "1 Tbsp - Organic Coconut Oil",
        "1/8 tsp - Pepper",
        "Chopped Veggies of Choice",
        "1/4 cup - Chopped Onion",
        "1 tsp - Minced Garlic"
      ],
      "instructions": [
        "Beat eggs and pepper, set aside.",
        "In a 10 in. cast iron or ceramic skillet, cook onion and garlic in oil until tender. Stir in veggies.",
        "Pour egg mixture into skillet over veggies.",
        "Cook on the stove over medium heat. As mixture sets, run a spatula around edges and lift up, letting egg mixture flow underneath to cook. Continue cooking and lifting edges until the egg mixture is almost set (surface will be moist).",
        "Place the skillet under a broiler 4-5 inches from the heat. Broil for 1-2 minutes or until the top is just set.",
        "Remove, cool and cut into wedges. (Can be cooked in the oven instead at 350 degrees for 15 minutes or until a knife comes out clean). Enjoy!"
      ]
    },
    {
      "category": "Breakfast",
      "title": "Fruit Pudding",
      "image": "images/fruit_pudding.png",
      "notes": "",
      "ingredients": [
        "1 cup - Full Fat Coconut Milk",
        "1 cup - Any Berries or a combo (Raspberries, Strawberries, Blackberries, Blueberries",
        "1 Avocado, pitted and chopped",
        "1 1/2 tsp - Cinnamon"
      ],
      "instructions": [
        "Add all ingredients to a high speed blender and blend for 1 minute.",
        "Pour into individual serving sized bowls, cover and refrigerate."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Grain-Free Granola",
      "image": "images/grain-free_granola.png",
      "notes": "This Recipe is Great in a Pinch!",
      "ingredients": [
        "Dried Banana Chips",
        "Dried Cherries",
        "Raisins",
        "Freeze-Dried Blueberries",
        "Flax Seeds",
        "Almonds, chopped",
        "Pecans, crushed (can use leftover Pecans from 'Baked Pecan' recipe for more flavor)",
        "Unsweetened Coconut Flakes",
        "(You can use any combination of Nuts/Seeds and Dried Fruit",
        "Almond or Coconut Milk"
      ],
      "instructions": [
        "Crush the above mixture to a crumbled texture with a meat tenderizer. Store in an airtight container.",
        "When ready to eat, sprinkle with cinnamon and serve in a bowl covered with almond or coconut milk.",
        "If desired, drizzle a small bit of 100% pure maple syrup on top."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Grain-Free Granola Bars",
      "image": "images/grain-free_granola_bars.png",
      "notes": "",
      "ingredients": [
        "1/4 cup - Coconut Oil",
        "1/4 cup - Pure Maple Syrup",
        "2 Tbsp - Raw Honey",
        "1/4 cup - Almond Butter",
        "1 tsp - Pure Vanilla Extract",
        "1/3 cup - Flax Seeds",
        "1/2 cup - Chopped Almonds",
        "1/3 cup - Chopped Pecans",
        "1 Tbsp - Sesame Seeds",
        "1/3 cup - Mini Dark Chocolate Chips",
        "1/3 cup - Raisins or Dried Cherries",
        "1/4 cup - Coconut Flakes"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Line an 8\"x8\" square baking pan with parchment paper.",
        "In a small saucepan over low heat, combine coconut oil, maple syrup, raw honey, almond butter and vanilla. Stir occasionally until ingredients have melted and mixed. Set aside to cool.",
        "In a medium sized bowl, combine the rest of the ingredients. Pour the saucepan mixture over the seed mixture and stir to combine. Spoon mixture into the 8\"x8\" pan and use a spoon to spread it out evenly, pressing down firmly to compress it.",
        "Bake the bars for 30-35 minutes until bubbly and golden. Remove from the oven and let cool for 1 hour.",
        "Cut into bars. Place bars in an airtight container and store in the fridge (keeps up to a week), or wrap individually and freeze for future use."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Green Egg Muffins",
      "image": "images/green_egg_muffins.png",
      "notes": "",
      "ingredients": [
        "1 box - Organic Applegate Farms Chicken Sausage",
        "1 large Fistful of Spinach or Kale",
        "5 Organic Eggs",
        "2 Tbsp - Avocado Oil",
        "2 Cloves Garlic, peeled",
        "2 Tbsp - Italian Seasoning (or your other favorite seasoning)",
        "1/2 tsp - Sea Salt",
        "1/2 tsp - Black Pepper"
      ],
      "instructions": [
        "Heat oven to 350 degrees. Bake the sausages in the oven until warm. Line a muffin tin with paper liners.",
        "Place all ingredients except the sausage in a blender and blend for 1 minute until well mixed.",
        "Pour mixture into muffin cups with room to add sausage pieces.",
        "Chop the sausage up into small bits and spread evenly into muffin cups.",
        "For regular size muffins, bake for 30-35 min. For mini muffins, bake for 28 min. Remove from the oven and let cool."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Hashbrown, Sausage & Egg Muffins",
      "image": "images/hashbrown,_sausage_and_egg_muffins.png",
      "notes": "",
      "ingredients": [
        "1 1/2 Tbsp - Coconut Oil, melted",
        "1 1/2 lb - Sweet Potatoes, peeled and shredded",
        "1/4 tsp plus 1/8 tsp - Sea Salt, divided",
        "1/4 tsp plus 1/8 tsp - Black Pepper, divided",
        "3 oz - Cooked Chicken Sausage, diced",
        "3 Scallions, chopped",
        "3 Large Eggs"
      ],
      "instructions": [
        "Preheat the oven to 400 degrees. Brush a 12 count muffin pan with coconut oil, thoroughly coating the base of each muffin cup.",
        "Transfer potatoes to a colander and press firmly to extract as much water as possible. Squeeze between double layers of paper towels until sweet potatoes feel very dry. Transfer to a large bowl, add 1/4 tsp. each of salt and pepper and stir to combine.",
        "Add about 1/3 cup potatoes to each muffin cup. Press sweet potatoes into the base and up the sides of each muffin cup, creating little \"nests.\" (Note: Potatoes should come slightly over top of muffin cups, as they will shrink during baking).",
        "Bake until the edges of the potatoes are golden brown, about 20 min, turning the pan halfway through. Reduce oven temp. to 350 degrees.",
        "Lightly spread coconut oil around the top edges of each muffin cup. Sprinkle sausage and scallions evenly over the 12 muffin cups.",
        "In a medium bowl, whisk eggs and remaining 1/8 tsp. each salt and pepper. Pour into \"nest,\" dividing evenly.",
        "Bake until egg is set, 12-15 min. Cool in pan for 10 min. before serving."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Lemon Chia Seed Muffins",
      "image": "images/lemon_chia_seed_muffins.png",
      "notes": "",
      "ingredients": [
        "1 Cup - Almond Flour",
        "1/2 Cup - Coconut Flour",
        "1/4 Cup - Tigernut Flour",
        "1/4 Cup - Arrowroot Flour",
        "1 Tbsp - Chia Seeds",
        "1 tsp - Baking Soda",
        "1/2 tsp - Aluminum Free Baking Powder",
        "1/2 tsp - Sea Salt",
        "2 Ripe Bananas",
        "1/3 Cup - Pure Maple Syrup",
        "2 tsp - Vanilla Extract",
        "1/3 Cup - Avocado Oil",
        "Zest and Juice from 1 Large Lemon"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees. Line muffin pan with 12 muffin liners.",
        "In a medium bowl, combine flours, chia seeds, baking soda, baking powder, and sea salt.",
        "In another bowl, mash the bananas until smooth. Add the rest of the ingredients and whisk to combine.",
        "Pour the dry ingredients into the wet ingredients and incorporate. Scoop mix into muffin pans. Bake for 23 minutes.",
        "Allow to cool before serving."
      ]
    },
    {
      "category": "Breakfast",
      "title": "No-Bake Coconut Balls",
      "image": "images/no-bake_coconut_balls.png",
      "notes": "",
      "ingredients": [
        "3 Tbsp - Green Banana Flour",
        "3 Tbsp - Coconut Oil",
        "1 1/2 Tbsp- Cocoa Powder or Carob Powder",
        "3 Tbsp - Nut or Seed Butter",
        "1 Tbsp - Local Raw Honey",
        "Shredded Coconut"
      ],
      "instructions": [
        "In a small bowl, mix all ingredients except shredded coconut. Roll into small balls with your hands and then roll in the shredded coconut to coat. Place in a glass dish and refrigerate until ready to eat."
      ]
    },
    {
      "category": "Breakfast",
      "title": "No-Bake Protein Bars",
      "image": "images/no-bake_protein_bars.png",
      "notes": "",
      "ingredients": [
        "1 1/4 cup - Almond Flour",
        "4 scoops - Grass Fed Beef Protein Powder",
        "1 Tbsp - Raw Honey",
        "2 Tbsp - Flax Seeds",
        "1/4 cup - Almond Butter",
        "1/4 cup - Warm Water",
        "1/4 cup - Mini Dark Chocolate Chips"
      ],
      "instructions": [
        "Mix together ingredients. If needed, add more water, 1 tbsp. at a time until dough comes together. It should be very stiff and tacky.",
        "Line a square baking dish with unbleached parchment paper. Place the dough in the dish and press it flat. Place it in the fridge for 20 minutes.",
        "Remove from the fridge and use parchment paper to lift it out of the dish onto a cutting board. Slice the dough into desired bars.",
        "These freeze well and are great to grab on the go!"
      ]
    },
    {
      "category": "Breakfast",
      "title": "Orange Cherry Muffins",
      "image": "images/orange_cherry_muffins.png",
      "notes": "Substitute 1/2 a banana and 1/4 cup Applesauce instead of the two eggs.",
      "ingredients": [
        "2 Eggs at room temperature",
        "1/4 cup - Fresh Squeezed Orange Juice",
        "2 1/2 cups - Almond Flour",
        "1/2 cup - Raw Honey or Maple Syrup",
        "1/2 cup - Palm Shortening",
        "1 Tbsp - Coconut Flour",
        "2 tsp - Pure Vanilla Extract",
        "1 tsp - Orange Zest",
        "3/4 tsp - Baking Soda",
        "1/2 tsp - Nutmeg",
        "1/4 tsp - Sea Salt",
        "3/4 cup - Dried Cherries"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Place a glass dish filled with 2 cups of water on the bottom rack of the oven and place the other rack in the center of the oven.",
        "Zest the orange and place into a high-speed blender. Slice the remaining orange in half and squeeze 1/4 cup of the juice into the blender. Add the rest of the ingredients except the cherries into the blender. Blend for 30 seconds. Scrape down the sides and blend again until smooth.",
        "Stir in the cherries by hand. Line 12 muffin cups with paper liners. Spoon the batter into the cups, filling 2/3 of the way full. Bake for 24 minutes."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Pumpkin Tigernut Muffins",
      "image": "images/pumpkin_tigernut_muffins.png",
      "notes": "",
      "ingredients": [
        "Topping:",
        "1/4 cup - Tigernut Flour",
        "2 Tbsp - Coconut Sugar",
        "1/2 tsp - Pumpkin Pie Spice",
        "2 Tbsp - Palm Shortening, chilled",
        "Muffins:",
        "3 Eggs",
        "1 cup - Pumpkin or Winter Squash Puree",
        "1/3 cup - Full Fat Coconut Milk",
        "1/3 cup - Coconut Sugar",
        "1 Tbsp - Pure Maple Syrup",
        "1 tsp - Pure Vanilla Extract",
        "1 3/4 cup - Tigernut Flour",
        "1/4 cup - Arrowroot Flour",
        "1 tsp - Baking Soda",
        "1 Tbsp - Pumpkin Pie Spice"
      ],
      "instructions": [
        "Scoop palm shortening into a small bowl and place in the fridge to chill ahead of time.",
        "Combine the rest of the topping ingredients in a medium bowl. Cut in the chilled palm shortening but do not overmix- it should be crumbly. Store in the fridge until ready to use.",
        "Preheat the oven to 350 degrees and line a muffin pan with 12 paper liners.",
        "In a large bowl, whisk together eggs, pumpkin, coconut milk, coconut sugar, maple syrup and vanilla with a mixer until very smooth.",
        "In a separate bowl, combine the tigernut flour, arrowroot, baking soda and pumpkin pie spiece. Slowly add to wet ingredients and beat with a mixer until smooth.",
        "Pour batter into the muffin cups, dividing evenly. Spoon the topping mixture onto the top of each muffin and then bake for 20-25 minutes.",
        "Let cool for 10 minutes and then remove muffins from tin to cool completely.",
        "Store in the fridge or freezer."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Sausage & Celery Root Skillet",
      "image": "images/sausage_and_celery_root_skillet.png",
      "notes": "",
      "ingredients": [
        "1 lb - Ground Chicken Sausage",
        "1/2 Tbsp - Coconut Oil",
        "1 Celery Root, peeled and chopped",
        "1 Apple, diced",
        "1 tsp - Minced Garlic",
        "1/4 cup - Diced Mushrooms"
      ],
      "instructions": [
        "Chop celery root and add to a large skillet with coconut oil.",
        "Cook on low-med for about 10 minutes.",
        "Add chopped apples and cook for 7 more minutes. Then add mushrooms, garlic and sausage and cook until meat is cooked through.",
        "Simple one-skillet easy and delicious breakfast!"
      ]
    },
    {
      "category": "Breakfast",
      "title": "Slow Cooked Almond Apple Cereal",
      "image": "images/slow_cooked_almond_apple_cereal.png",
      "notes": "You can start this in the slow cooker before you go to bed and wake up to a ready-to-eat breakfast!",
      "ingredients": [
        "3 Apples, peeled and shredded",
        "3 cups - Almond Flour",
        "3 cups - Water",
        "1 Tbsp - Ground Cinnamon",
        "Raw Honey or Maple Syrup"
      ],
      "instructions": [
        "Peel and shred the apples and place them in the slow cooker.",
        "Add remaining ingredients and stir well.",
        "Cover and cook on LOW for 6 hours. Sweeten with honey or pure maple syrup to taste."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Slow Cooked Banana Bread",
      "image": "images/slow_cooked_banana_bread.png",
      "notes": "",
      "ingredients": [
        "4 Ripe Bananas",
        "1/4 cup plus 2 Tbsp - Coconut Oil, melted",
        "1/2 cup - Raw Honey",
        "1 Tbsp - Pure Vanilla Extract",
        "3 Tbsp - Coconut Milk",
        "3 Eggs",
        "2 cups - Almond Flour",
        "1 tsp - Baking Soda",
        "Unbleached Parchment Paper"
      ],
      "instructions": [
        "In a large mixing bowl, mash the bananas with a fork. Add the coconut oil, stir in the honey, vanilla, coconut milk and eggs, and mix well.",
        "Add the flour and baking soda (the mixture will be thin, like pancake batter).",
        "Line your slow cooker with unbleached parchment paper. Pour the banana mixture into the slow cooker, on top of the parchment paper and cook on LOW for 2 hours.",
        "When the bread is done, remove it by lifting out the parchment paper and placing it on a cutting board to cool, or leave it in the slow cooker on warm and enjoy it all day!"
      ]
    },
    {
      "category": "Breakfast",
      "title": "Sweet Potato Sausage Hash",
      "image": "images/sweet_potato_sausage_hash.png",
      "notes": "You can start this in the slow cooker before you go to bed and wake up to a ready-to-eat breakfast!",
      "ingredients": [
        "3 Medium Sweet Potatoes, peeled and grated",
        "1 Yellow Onion, diced",
        "1 Jalapeno Pepper, diced",
        "1 Box Applegate Farm Chicken and Sage Sausage, chopped",
        "Optional: Garnish with Avocado"
      ],
      "instructions": [
        "Peel the sweet potatoes, shred them with a grater, and place them in the slow cooker.",
        "Add the rest of the ingredients and stir together.",
        "Cover and cook on LOW for 6-8 hours."
      ]
    },
    {
      "category": "Breakfast",
      "title": "Grain Free Zucchini Bread",
      "image": "images/grain_free_zucchini_bread.png",
      "notes": "",
      "ingredients": [
        "1 cup - Almond Flour",
        "1/2 cup - Tapioca or Arrowroot Flour",
        "2 tsp - Ground Cinnamon",
        "1 tsp - Baking Soda",
        "1/2 tsp - Sea Salt",
        "1/2 tsp - Ground Nutmeg",
        "3 Eggs, beaten",
        "1/4 cup - Local Raw Honey",
        "1 Ripe Banana",
        "1 cup - Shredded, Unpeeled Zucchini"
      ],
      "instructions": [
        "Preheat the oven to 350 degrees.",
        "Combine dry ingredients in a small bowl.",
        "Add eggs to a large mixing bowl and beat with a mixer. Add other wet ingredients and beat until fully combined and frothy.",
        "Slowly add the dry ingredients while mixing until all is incorporated.",
        "Spoon batter into 2 mini loaf pans or into a lined muffin tin and bake for 35 min."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Balsamic Roast Beef",
      "image": "images/balsamic_roast_beef.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp. Coconut Oil",
        "3 Pound Boneless Chuck Roast",
        "3 Sweet Potatoes, peeled and cut into pieces",
        "1 Leek, Chopped",
        "2 Sprigs Fresh Rosemary",
        "2 Bay Leaves",
        "2 tsp - Minced Garlic",
        "1 Cup - Red Wine (Optional)",
        "1/3 cup - Balasmic Vinegar",
        "1 1/2 cups - Beef Broth",
        "Sea Salt and Black Pepper to Taste"
      ],
      "instructions": [
        "Season the roast with salt and pepper.",
        "Melt coconut oil in a large skillet over medium-high heat. Sear the roast for 2-3 minutes on each side.",
        "Place the meat in the slow cooker. Top it with the leek, garlic, red wine (opt.), balsamic vinegar, beef broth, rosemary and bay leaves.",
        "Cover the slow cooker and set it to low for 3 1/2 hours.",
        "After the 3 1/2 hours, add the sweet potatoes and continue to cook on low for another 4 hours.",
        "Remove and discard the bay leaves and rosemary sprigs.",
        "Pour the liquid from the slow cooker into a saucepan and bring to a slow boil over medium-high heat. Keep it boiling and let it reduce until you get the desired consistency for your sauce (about 15 minutes).",
        "Pour the sauce back into the slow cooker and serve with the meat and sweet potatoes."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Barbeque Apple Chicken",
      "image": "images/barbeque_apple_chicken.png",
      "notes": "",
      "ingredients": [
        "4-6 Boneless, Skinless Chicken breasts",
        "2 Apples, Peeled and Chopped",
        "1 Yellow Onion, Chopped",
        "1 Clove Garlic, Minced",
        "1 Bottle of Barbeque Sauce of your Choice (Our Favorite: Brownwood Farm's Cherry Barbeque Sauce)"
      ],
      "instructions": [
        "Place all the ingredients in the slow cooker and cover and cook on LOW for 4-5 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Beef and Veggie Soup",
      "image": "images/beef_and_veggie_soup.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "2 lb - Grass Fed Stew Meat",
        "1 Onion, Chopped",
        "4 Cloves Fresh Garlic, Sliced Thin",
        "6 cups - Chicken or Beef Broth",
        "3 Carrots, Peeled and Sliced",
        "1 cup - Green Beans, Chopped",
        "1 cup - Cauliflower, Chopped",
        "2 Tbsp - Fresh Basil Leaves, Finely Chopped",
        "1 tsp - Dried Parsley"
      ],
      "instructions": [
        "Melt the coconut oil in a large skillet over medium heat. Add the beef in a single layer and cook until browned, about 8 minutes. Transfer the beef to the slow cooker.",
        "Add the onions and garlic to the skillet and saute until softened, about 8 minutes. Transfer onions and garlic to a slow cooker, including any liquid in the skillet.",
        "Add the broth and carrots to the slow cooker, set to low, and cook for 6 hours.",
        "With 2 hours left of cook time, add the green beans, cauliflower, basil and parsley, and salt and pepper to taste.",
        "Store leftovers in the fridge."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Beef Stew",
      "image": "images/beef_stew",
      "notes": "",
      "ingredients": [
        "2 lbs - Grass Fed Stew Meat, Cut into 1” Cubes",
        "2 Tbsp - Avocado Oil",
        "Sea Salt and Pepper to Taste",
        "2 cups - Organic Beef Broth",
        "1 Clove Garlic, Minced",
        "5 Carrots, Peeled and Sliced",
        "1 Large Onion, Chopped",
        "3 Stalks Celery, Sliced",
        "1 Sweet Potato, Cubed",
        "1 tsp - Dried Parsley",
        "2 tsp - Adobo Seasoning",
        "1/8 Cup - Worcestershire Sauce"
      ],
      "instructions": [
        "Heat the avocado oil in a skillet. Add the meat and cook on medium/low heat until edges are browned.",
        "Place meat in a slow cooker. Add salt and pepper, and stir to coat.",
        "Add remaining ingredients and stir to mix. Cover and cook on LOW 8-10 hours (or HIGH 4-5 hours).",
        "Stir thoroughly before serving."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Beef Stroganoff",
      "image": "images/beef_stroganoff.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "16 Button Mushrooms, Stemmed and Sliced",
        "1 Large Onion",
        "2 pounds - Grass Fed Ground Beef",
        "1 cup - Chicken or Beef Broth",
        "1 tsp - Onion Powder",
        "1 tsp - Garlic Powder",
        "2 Tbsp - Apple Cider Vinegar",
        "1 tsp - Sea Salt",
        "1 tsp - Black Pepper",
        "2 Tbsp - Worcestershire Sauce",
        "1/2 cup - Coconut Milk",
        "2 Tbsp - Tapioca Starch or Arrowroot Powder",
        "1 Bag Cauliflower Rice, Cooked"
      ],
      "instructions": [
        "Saute the mushrooms, onions and beef in coconut oil in a skillet until almost cooked through. Transfer to crockpot.",
        "Add the rest of the ingredients (except cauliflower rice) to the crockpot and cook on low for 4 hours.",
        "Cook the cauliflower rice.",
        "Serve the beef mixture over top of the cauliflower."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Bone Broth",
      "image": "images/bone_broth.png",
      "notes": "Bone broth is extremely healthy and VERY easy to make. It contains beneficial building blocks for your body, like collagen, marrow, glycine, hyaluronic acid, chondroitin sulfate, calcium, magnesium and potassium. This is helpful in reducing inflammation and assisting in gut healing.",
      "ingredients": [
        "Soup Bones (from a healthy organic grass fed/pasture raised animal)",
        "2  Celery Stalks",
        "2  Carrots, Unpeeled",
        "Optional: Garlic Cloves",
        "Sea Salt",
        "2 Tbsp - Apple Cider Vinegar (this helps release the bone minerals)"
      ],
      "instructions": [
        "Place the bones in your slow cooker. Wash the veggies and add them to the slow cooker, no need to chop. Cover ingredients with a generous amount of water. Add apple cider vinegar. Cover and cook on high for 18 to 24 hours.",
        "Check water level periodically, more may need to be added. Strain the broth through a strainer and cool. Broth can be used for sipping, or adding to other recipes and soups.",
        "You can store extra broth in glass mason jars in the freezer for future single serve use. Just leave ½ inch headspace in the jar and allow to cool completely before placing in the freezer."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Butternut Squash Lasagna",
      "image": "images/butternut_squash_lasagna.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "3 Carrots, Chopped",
        "1 Small Yellow Onion, Finely Chopped",
        "1 cup - Zucchini, Finely Chopped",
        "2 cups - Sliced Mushrooms",
        "1 lb - Grass Fed Ground Beef",
        "1 pound - Bulk Apple Chicken Sausage",
        "28 oz - Crushed Tomatoes",
        "1 can - Diced Tomatoes with Juice",
        "2 Cloves Garlic, Minced",
        "2 Tbsp - Dried Oregano",
        "1 Tbsp - Dried Basil",
        "1 Tbsp - Garlic Salt",
        "1 Butternut Squash"
      ],
      "instructions": [
        "Place coconut oil in the bottom of a large soup pot on medium heat. Add the carrots, onions, zucchini, and mushrooms and sauté until tender.",
        "While veggies are cooking, brown the beef and sausage on medium heat in a separate skillet until fully cooked. Add the beef/sausage mix to the veggies in the soup pot.",
        "Add the remaining ingredients except for butternut squash, mix well, and simmer for 30 min.",
        "While the sauce simmers, peel, halve, and scoop out the seeds of the butternut squash. Cut the cleaned squash lengthwise in ¼” to 1/2 “ thick strips (resembling thick lasagna noodles). It doesn't have to be perfect!",
        "In the slow cooker, ladle in a layer of the meat sauce, then evenly spread the squash slices on top. Continue to alternate until you have reached 4 layers or more.",
        "Cover and cook on LOW for 4-6 hrs."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Chipotle Chicken Stew",
      "image": "images/chipotle_chicken_stew.png",
      "notes": "",
      "ingredients": ["TODO: diff categories of ingredients"],
      "instructions": [
        "Marinate the chicken breasts overnight.",
        "The next day, place the coconut oil, onion, turnip, rutabaga, and squash in the slow cooker.",
        "Cut the chicken and place it on top of the veggies (discard the marinade).",
        "Add the rest of the ingredients, cover, and cook on LOW for 4-6 hrs."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Chipotle Meatballs",
      "image": "images/chipotle_meatballs",
      "notes": "",
      "ingredients": ["TODO: diff categories of ingredients"],
      "instructions": [
        "In a medium sized mixing bowl, thoroughly mix together all of the meatball ingredients with your hands and set aside.",
        "Put the onion, garlic, tomato sauce and beef broth into the slow cooker and mix well. Add the honey and spices and whisk together.",
        "Form the meat mixture into balls, golf ball sized. Gently drop each meatball into the sauce in the slow cooker. Cover and cook on LOW for 6-7 hrs. Serve garnished with cilantro."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Chocolate Almond Butter Swirl Brownies",
      "image": "images/chocolate_almond_butter_swirl_brownies.png",
      "notes": "",
      "ingredients": [
        "3/4 cup - Almond Flour",
        "1/2 cup - Cocoa Powder",
        "3/4 tsp - Baking Powder",
        "1/4 cup + 2 Tbsp - Melted Coconut Oil",
        "1/2 cup - Local Raw Honey",
        "1 Tbsp - Pure Vanilla Extract",
        "3 Eggs",
        "1/4 cup - Dark Chocolate Chips",
        "3 Tbsp - Almond Butter",
        "Unbleached Parchment Paper"
      ],
      "instructions": [
        "In a small bowl, combine the almond meal, cocoa powder and baking powder. In a separate bowl, combine the melted coconut oil and honey, and stir well.",
        "Add the vanilla to the wet ingredients. When the coconut oil has cooled, add the eggs.",
        "Combine the wet and dry mixtures, stirring well. Add the dark chocolate chips.",
        "Line your slow cooker with parchment paper and pour in the mixture on top of it. Drop the almond butter on top of the mixture, and using a knife, swirl it around.",
        "Cover and cook on LOW for 1 hour and 15 minutes."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Chocolate Chili",
      "image": "images/chocolate_chili.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "1 Large Onion",
        "4 tsp - Minced Garlic",
        "2 lb - Grass Fed Ground Beef",
        "1 tsp - Dried Oregano",
        "1 1/2 Tbsp - Chili Powder",
        "1 1/2 Tbsp - Ground Cumin",
        "1 1/2 Tbsp - Unsweetened Cocoa Powder",
        "1 tsp - Ground Allspice",
        "1 tsp - Sea Salt",
        "2 cups - Beef Broth",
        "3/4 cup - Water"
      ],
      "instructions": [
        "Heat a large skillet on medium-high heat, then add coconut oil. When oil is melted, add onions and cook until translucent. Add garlic.",
        "Crumble the ground meat into the skillet and stir to combine. Continue to cook meat mixture, stirring often until it is cooked through.",
        "Add it to a large crockpot. Add the rest of the ingredients and mix well. Set the crockpot on low for 2.5 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Cinnamon Ginger Lamb",
      "image": "images/cinnamon_ginger_lamb.png",
      "notes": "",
      "ingredients": [
        "2 Whole Cinnamon Sticks",
        "2 pounds - Boneless Leg of Lamb",
        "1 Onion, Chopped",
        "4 Carrots, Chopped",
        "1 Tbsp - Cumin",
        "1 Tbsp - Coriander",
        "1 tsp - Cayenne Pepper",
        "2 Tbsp - Fresh Ginger, Minced",
        "1 tsp - Ground Ginger",
        "4 Garlic Cloves, Minced"
      ],
      "instructions": [
        "Place the cinnamon sticks on the bottom of the slow cooker.",
        "Place the lamb on top of the cinnamon sticks.",
        "Chop the onion and carrots and place them on top of the lamb.",
        "Add the garlic and ginger and remaining spices.",
        "Cover and cook on LOW for 8 hrs."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Crockpot Hamburger Soup",
      "image": "images/crockpot_hamburger_soup.png",
      "notes": "",
      "ingredients": [
        "1 lb - Grass Fed Ground Beef",
        "6 cups - Chicken or Beef Broth",
        "1 Large Sweet Potato",
        "3  Carrots",
        "1  Onion",
        "4 Stalks Celery",
        "1 Head of Broccoli",
        "1 Tbsp - Dried Parsley",
        "1/2 tsp - Dried Oregano",
        "1/4 tsp - Beef Roast Seasoning",
        "1/4 tsp - Chophouse Seasoning",
        "Sea Salt/Pepper to Taste"
      ],
      "instructions": [
        "Brown the ground beef in a skillet on medium-low heat, then add to the crockpot.",
        "Add all other ingredients and turn the crockpot on high for 5 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Egg Roll Soup",
      "image": "images/egg_roll_soup.png",
      "notes": "",
      "ingredients": [
        "1 pound - Grass Fed Ground Beef",
        "1 Tbsp - Coconut Oil",
        "1  Onion, Diced",
        "4 cups (32 oz) - Chicken Broth",
        "1/2 head Cabbage, Chopped",
        "2 cups - Shredded Carrots",
        "1 tsp - Garlic Powder",
        "1 tsp - Onion Powder",
        "1 tsp - Sea Salt",
        "1 tsp - Ground Ginger",
        "1/2 cup - Coconut Aminos",
        "2 Tbsp - Tapioca Starch or Arrowroot Powder"
      ],
      "instructions": [
        "Brown the meat in the coconut oil in a skillet until almost browned. Transfer the meat to the slow cooker. Add the remaining ingredients except for the tapioca starch. Cook on low for 5 hours.",
        "Before serving, remove ¼ cup of the liquid from the crockpot, add tapioca starch to the liquid and mix well. Pour it back into the crockpot and stir well to thicken."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Fiesta Lime Chicken",
      "image": "images/fiesta_lime_chicken.png",
      "notes": "",
      "ingredients": [
        "1 Small Yellow Onion, Sliced",
        "3 Limes",
        "3-4 lbs Chicken Breasts",
        "4 Tbsp - Taco Seasoning",
        "1/4 cup - Chicken Broth"
      ],
      "instructions": [
        "Thinly slice the onions into strips and place them in the slow cooker.",
        "Cut one lime in half and squeeze juice over the onions.",
        "Place the chicken on top of the onions and evenly sprinkle with half of the taco seasoning. Turn the chicken over and season the other side with remaining seasoning.",
        "Squeeze the remaining limes over the chicken and add the chicken broth.",
        "Cover and cook on HIGH for 3.5 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Lectin Free Chili",
      "image": "images/lectin_free_chili.png",
      "notes": "",
      "ingredients": [
        "1 tsp - Sea Salt",
        "2 pounds - Grass Fed Ground Beef",
        "1 tsp - Avocado Oil",
        "2 tsp - Minced Garlic",
        "1 Medium Onion or 3 Small Leeks, Chopped",
        "3 Stalks of Celery, Finely Diced",
        "2 Tbsp - Chili Powder",
        "2 tsp - Ground Cumin",
        "¼ tsp - Ground Cinnamon",
        "1 Pinch of Ground Cloves",
        "2 cups - Grass Fed Beef Broth",
        "3 oz - Pine Nuts",
        "1 Large Sweet Potato, Pureed",
        "1 tsp - Dried Adobo Seasoning",
        "2 tsp - Red Wine Vinegar",
        "2 tsp - Coconut Aminos",
        "2 tsp - Sea Salt",
        "Pepper to Taste",
        "Optional: Sliced Scallions for Garnish"
      ],
      "instructions": [
        "Bake the sweet potato for about an hour at 375 degrees and set aside. (this can be done the day before if desired).",
        "Cook the ground beef and 1 tsp. salt in a skillet until broken up in small pieces and about halfway cooked. Transfer to crockpot.",
        "Use the same skillet to heat avocado oil. Then add garlic, onion, and celery and cook for 5 minutes until soft. Add the chili powder, cumin, cinnamon and cloves and stir, cooking for 1 more minute. Pour in the broth, scraping the bottom of the pan and transfer to the crockpot.",
        "Add to the crockpot: pine nuts, sweet potato puree, adobo seasoning, wine vinegar, coconut aminos, 2 tsp. salt and pepper to taste.",
        "Cover and cook on low for 5 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Maple Roasted Chicken with Sweet Potatoes",
      "image": "images/maple_roasted_chicken_with_sweet_potatoes.png",
      "notes": "",
      "ingredients": [
        "4 Chicken Breasts",
        "1 Onion, Diced",
        "2 Sweet Potatoes, Peeled and Cut into 1\" Chunks",
        "2 Tbsp - Melted Coconut Oil",
        "1 tsp - Sea Salt",
        "1/4 tsp - Black Pepper",
        "3 Tbsp - Pure Maple Syrup"
      ],
      "instructions": [
        "Place all ingredients into the slow cooker.",
        "Cook on Low for 6 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Meatloaf",
      "image": "images/meatloaf.png",
      "notes": "",
      "ingredients": [
        "1 lb - Grass Fed Ground Beef",
        "1/2 cup - Crushed Almond Crackers (We use Simple Mills Sea Salt)",
        "1 Small Onion, Diced",
        "1 tsp - Sea Salt",
        "1/2 tsp - Chophouse Seasoning",
        "1/2 tsp - Oregano",
        "Top with Barbeque Sauce (Our Favorite- Brownwood Farm's Cherry Barbeque Sauce)"
      ],
      "instructions": [
        "Mix all ingredients together in a bowl. Shape into a loaf and place in a slow cooker.",
        "Top with sauce. Cook on low for 3.5-4 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Mild shredded Chicken",
      "image": "images/mild_shredded_chicken.png",
      "notes": "Super easy and quick!! Great to serve over the top of a salad or other greens.",
      "ingredients": [
        "Boneless, Skinless Chicken Breasts",
        "All Natural Barbeque Sauce (Our favorite is Brownwood Farms Cherry Barbeque Sauce)"
      ],
      "instructions": [
        "Place the chicken breasts in the slow cooker and pour the sauce over them.",
        "Cover and cook on low for 4 hours.",
        "When done, shred the chicken with a knife and fork and mix well."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Sesame Orange Chicken",
      "image": "images/sesame_orange_chicken.png",
      "notes": "",
      "ingredients": ["TODO: diff categories of ingredients"],
      "instructions": [
        "Place chicken in the slow cooker. Place the remaining crockpot ingredients in a bowl, whisk together, and pour over the chicken. Flip the chicken over to fully coat. Cook the chicken on low for 4 hours.",
        "Remove the chicken from the sauce and chop it into bite size pieces. Transfer the sauce from the crockpot into a small saucepan. Return the chicken to the crockpot and cover to keep warm.",
        "Add tapioca flour to the sauce and simmer on the stovetop over medium heat until it becomes thickened. Pour back over the chicken in the crockpot.",
        "Heat the cauliflower rice in a pot until warm.",
        "Spoon the mixture onto plates on top of the cauliflower rice. Sprinkle with sesame seeds and top with chopped green onions."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Slow Cooked Almond Apple Cereal",
      "image": "images/slow_cooked_almond_apple_cereal.png",
      "notes": "You can start this in the slow cooker before you go to bed and wake up to a ready-to-eat breakfast!",
      "ingredients": [
        "3 Apples, peeled and shredded",
        "3 cups - Almond Flour",
        "3 cups - Water",
        "1 Tbsp - Ground Cinnamon",
        "Raw Honey or Maple Syrup"
      ],
      "instructions": [
        "Peel and shred the apples and place them in the slow cooker.",
        "Add remaining ingredients and stir well.",
        "Cover and cook on LOW for 6 hours. Sweeten with honey or pure maple syrup to taste."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Slow Cooked Banana Bread",
      "image": "images/slow_cooked_banana_bread.png",
      "notes": "",
      "ingredients": [
        "4 Ripe Bananas",
        "1/4 cup plus 2 Tbsp - Coconut Oil, melted",
        "1/2 cup - Raw Honey",
        "1 Tbsp - Pure Vanilla Extract",
        "3 Tbsp - Coconut Milk",
        "3 Eggs",
        "2 cups - Almond Flour",
        "1 tsp - Baking Soda",
        "Unbleached Parchment Paper"
      ],
      "instructions": [
        "In a large mixing bowl, mash the bananas with a fork. Add the coconut oil, stir in the honey, vanilla, coconut milk and eggs, and mix well.",
        "Add the flour and baking soda (the mixture will be thin, like pancake batter).",
        "Line your slow cooker with unbleached parchment paper. Pour the banana mixture into the slow cooker, on top of the parchment paper and cook on LOW for 2 hours.",
        "When the bread is done, remove it by lifting out the parchment paper and placing it on a cutting board to cool, or leave it in the slow cooker on warm and enjoy it all day!"
      ]
    },
    {
      "category": "Crockpot",
      "title": "Slow Cooked Ham",
      "image": "images/slow_cooked_ham.png",
      "notes": "",
      "ingredients": [
        "All Natural, Antibiotic-Free Turkey Ham",
        "Whole Cloves, or Ground Cloves",
        "1/8 cup - Plus 2 Tbsp. Pineapple Juice",
        "3 Tbsp - Orange Juice",
        "2 Tbsp - Pure Maple Syrup"
      ],
      "instructions": [
        "Decorate the outside of the ham by inserting as many whole cloves as you like into it (just push the smaller side in toward the center of the ham, so it is sticking out the top). Or, sprinkle ground cloves on the top.",
        "Place ham in the slow cooker. Pour both juices over the top and Drizzle the ham with the maple syrup. Cover and cook on LOW for 8 hours or until the internal temp. reaches 160 degrees. (If you are using a fully pre-cooked ham, cook on LOW for 2 hrs. and then set to warm until ready to eat)."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Slow Cooked Short Ribs",
      "image": "images/slow_cooked_short_ribs.png",
      "notes": "",
      "ingredients": [
        "1 Tbsp - Coconut Oil",
        "4 Pounds of Beef Short Ribs",
        "1 tsp - Sea Salt",
        "1 tsp - Pepper",
        "3 Cups - Beef Broth",
        "1/4 cup - Worchestershire Sauce",
        "1 tsp - Garlic Powder",
        "1 tsp - Onion Powder",
        "1 Sprig Fresh Rosemary"
      ],
      "instructions": [
        "Season the ribs on all sides with salt and pepper.",
        "Melt coconut oil in a large skillet over medium heat. Sear the ribs  on each of the 4 sides for about 60 seconds on each side. Set aside.",
        "Pour the beef broth, worcestershire sauce, garlic powder and onion powder into a slow cooker and stir together.",
        "Place the ribs into the liquid in the slow cooker. Spoon the liquid over the top of the ribs to saturate.",
        "Place the rosemary sprig on top of the meat and place the lid on the slow cooker.",
        "Cook on low for 6-8 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Slow Cooked Whole Chicken",
      "image": "images/slow_cooked_whole_chicken.png",
      "notes": "After we eat the chicken for dinner, we strain the liquid from the slow cooker into a stock pot, add a little extra water, throw in some veggies and a few spices and pick off the rest of the chicken meat from the bones left over (you can use the pieces of meat that no one likes to eat at dinner, like the back meat). It makes a very yummy soup that will last a couple days. This really makes the extra cost of a pasture raised bird worth it! While the soup (above) is cooking, we will take the remaining bones and put them back into the crockpot, cover completely with water and follow the bone broth recipe in the “Soups and Sauces” section of this cookbook! Simple, easy and healthy way to get the most out of a single bird!",
      "ingredients": [
        "1 Whole Free-Range Chicken",
        "Water",
        "Your Favorite Spices (Chophouse Seasoning, Sea Salt and/or Chicken Rub Spice)"
      ],
      "instructions": [
        "Add a few inches of water to the bottom of the slow cooker (this can be used after the chicken is cooked as a base to make veggie soup-see below). Rinse the chicken and place it into the slow cooker. Add spices.",
        "Cover and cook on HIGH for 4 hours or LOW for 6 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Slow Cooker Chicken Tortilla Soup",
      "image": "images/slow_cooker_chicken_tortilla_soup.png",
      "notes": "",
      "ingredients": [
        "1 lb Chicken Breast, Trimmed",
        "5 cups Chicken Broth",
        "1 Medium Onion, Chopped",
        "1 Green Pepper, Chopped",
        "1 Serrano Pepper, Minced",
        "2 tsp - Minced Garlic",
        "1/4 tsp - Chili Powder",
        "1 1/2 tsp - Sea Salt, Divided in Half",
        "1 tsp - Ground Pepper, Divided in Half"
      ],
      "instructions": [
        "Add ingredients listed above with half of the salt and pepper into the crockpot.",
        "Cook on high for 4 hours.",
        "Prior to serving, remove the chicken breasts from the crockpot, shred and season with remaining salt and pepper, and place back in the crockpot.",
        "Stir."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Southern Sweet Potato Soup",
      "image": "images/southern_sweet_potato_soup.png",
      "notes": "",
      "ingredients": [
        "2 Large Sweet Potatoes, Peeled and Sliced",
        "3 1/2 cups - Organic Chicken Broth",
        "2 cups - Chopped Onion",
        "6 Celery Stalks, Chopped",
        "2 tsp - Minced Garlic",
        "1/2 cup - Water",
        "1/3 cup - Coconut Oil, Melted",
        "3 Tbsp - Creamy Almond Butter",
        "1/4 tsp - Ground Cinnamon",
        "1/2 cup - Almond or Coconut Milk",
        "1 tsp - Dried Thyme",
        "1 1/2 Tbsp - Raw Honey",
        "1/8 tsp - Ground Nutmeg"
      ],
      "instructions": [
        "Combine top grouping of ingredients in a 5 qt. or larger crockpot.",
        "Cover and cook on low for 7 hours or until potatoes are tender. Cool slightly.",
        "Scoop mixture into a blender (as much as will fit). Blend until smooth and add back into the crockpot. Repeat and return to the crockpot. Add almond milk, thyme, honey and nutmeg. Stir and enjoy!"
      ]
    },
    {
      "category": "Crockpot",
      "title": "Steak and Root Vegetable Chili",
      "image": "images/steak_and_root_vegetable_chili.png",
      "notes": "",
      "ingredients": [
        "2 Tbsp - Coconut Oil",
        "2 lb - Grass Fed Steak, Cubed",
        "2 Sweet Potatoes, Peeled and Cut into 1\" Cubes",
        "4 Carrots, Peeled and Cut",
        "1 Large Onion, Chopped",
        "1 Tbsp - Minced Garlic",
        "2 1/2 cups - Beef Broth",
        "1/2 Tbsp - Ground Cumin",
        "1 1/2 Tbsp - Chili Powder",
        "Optional: Chopped Green Onion for Garnish"
      ],
      "instructions": [
        "In a large skillet, heat oil over med-high heat. Add the meat and brown all sides for about 5 min.",
        "Add all the ingredients to the slow cooker. Stir well to combine.",
        "Cover and cook on low for 8 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Stuffed Acorn Squash",
      "image": "images/stuffed_acorn_squash.png",
      "notes": "",
      "ingredients": [
        "2  Small Acorn Squash",
        "1 lb - Italian Seasoned Bulk Chicken Sausage",
        "1  Onion, Diced",
        "2 cups - Mushrooms, Chopped",
        "2 cups - Spinach Leaves",
        "1 cup - Water"
      ],
      "instructions": [
        "Place 1 cup of water in the bottom of slow cooker. Cut the acorn squash in half, lengthwise, scoop out the seeds, and set aside.",
        "In a large skillet, brown the sausage over medium heat. Add the onions, mushrooms and spinach to the sausage, and cook for 1-2 minutes. Remove from heat.",
        "Stuff the cavity of the squash with as much of the mixture as you can (It is okay to overstuff them). Carefully place them in the slow cooker, and repeat for the remaining squash halves.",
        "Cover and cook on HIGH for 4 hours."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Jalapeno Sweet Potato Chowder",
      "image": "images/jalapeno_sweet_potato_chowder.png",
      "notes": "",
      "ingredients": [
        "2 Large Sweet Potatoes, Fully Cooked",
        "3 Boneless, Skinless Chicken Breasts, Cut to Stew Size Pieces",
        "1 Yellow Onion, Chopped",
        "2 Carrots, Peeled and Chopped",
        "3 Celery Stalks, Chopped",
        "2 Tbsp - Coconut Oil, Melted",
        "2 cups - Chicken Broth",
        "2 Jalapeno Peppers, Finely Diced",
        "1/2 cup - Coconut Milk"
      ],
      "instructions": [
        "Cook the sweet potatoes the night before and store in the fridge.",
        "The next day, place the chicken in the slow cooker.",
        "Add the onions, carrots, celery, jalapeno peppers and coconut oil.",
        "Scoop out the sweet potato insides and place in a blender with one cup of the chicken broth. Puree until smooth and add to the slow cooker.",
        "Add the coconut milk and remaining chicken broth and stir well. Cover and cook on LOW for 4 hrs. Uncover and cook on LOW for another half hour. This will thicken the chowder."
      ]
    },
    {
      "category": "Crockpot",
      "title": "Sweet Potato Sausage Hash",
      "image": "images/sweet_potato_sausage_hash.png",
      "notes": "You can start this in the slow cooker before you go to bed and wake up to a ready-to-eat breakfast!",
      "ingredients": [
        "3 Medium Sweet Potatoes, peeled and grated",
        "1 Yellow Onion, diced",
        "1 Jalapeno Pepper, diced",
        "1 Box Applegate Farm Chicken and Sage Sausage, chopped",
        "Optional: Garnish with Avocado"
      ],
      "instructions": [
        "Peel the sweet potatoes, shred them with a grater, and place them in the slow cooker.",
        "Add the rest of the ingredients and stir together.",
        "Cover and cook on LOW for 6-8 hours."
      ]
    }
  ]
}
